
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)                  
	
	
	НовоеПолеСтраница = Элементы.Вставить("гф_СтраницаB2B", Тип("ГруппаФормы"),
										Элементы.СтраницыКарточкаНоменклатуры);
	НовоеПолеСтраница.Вид = ВидГруппыФормы.Страница;	
	НовоеПолеСтраница.Видимость = Истина;
	НовоеПолеСтраница.Заголовок = "B2B дополнительные реквизиты";
	//НовоеПолеСтраница.ПутьКДаннымЗаголовка = "Объект.гф_ТоварыВКоробах.КоличествоСтрок";

	
	НовоеПоле = Элементы.Добавить("B2B_ГруппаНаСайтеОсновная", Тип("ПолеФормы"), НовоеПолеСтраница);
	НовоеПоле.Заголовок = "Группа на сайте (основная)";
	НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "Объект.B2B_ГруппаНаСайтеОсновная";
	//НовоеПоле.УстановитьДействие("ПриИзменении", "гф_ТоварыВКоробахВариантКомплектацииПриИзменении");

КонецПроцедуры
