	
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия = "1.0";
    ПараметрыРегистрации.Наименование = "Загрузка заказов из табличного документа";
    ПараметрыРегистрации.Информация = НСтр("ru='Загрузка заказов из табличного документа'");
	ПараметрыРегистрации.БезопасныйРежим = Истина;

    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Идентификатор = "ЗагрузкаЗаказовИзТабличногоДокументаWMN";
    Команда.Представление = "Загрузка заказов из табличного документа";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    
    Возврат ПараметрыРегистрации;
    
КонецФункции

#КонецОбласти 

	
#Область СлужебныеПроцедуры

Функция ПолучитьМакетОбработки(Имя) Экспорт
	Возврат ПолучитьМакет(Имя);
КонецФункции

#КонецОбласти 
