
&ИзменениеИКонтроль("ВыполнитьКомандуПечатиПечатьТТН")
Процедура гф_ВыполнитьКомандуПечатиПечатьТТН(КодВозврата, ОписаниеКоманды)

	Если ОписаниеКоманды.Идентификатор = "ТТН" Тогда
		МенеджерПечати = "Документ.ТранспортнаяНакладная.Печать";
		ИменаМакетов = "ТТН";
		#Вставка
		//++ ЕсиповАВ
	ИначеЕсли ОписаниеКоманды.Идентификатор = "СМР" Тогда
		МенеджерПечати = "Документ.ТранспортнаяНакладная.Печать";
		ИменаМакетов = "СМР";
		//-- ЕсиповАВ
		#КонецВставки
	Иначе
		МенеджерПечати = "Документ.ТранспортнаяНакладная.Печать";
		ИменаМакетов = "ТранспортнаяНакладная";
	КонецЕсли;

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	МенеджерПечати,
	ИменаМакетов,
	ОписаниеКоманды.ОбъектыПечати,
	ОписаниеКоманды.Форма);

КонецПроцедуры
