
&НаКлиенте
Процедура Применить(Команда)
	Результат = Новый Структура();
	Результат.Вставить("флДоговор", флДоговор);
	Результат.Вставить("Период", Период);
	Результат.Вставить("ВидСкидки", ВидСкидки);
	Результат.Вставить("Скидка", Скидка);
	Результат.Вставить("флУстановитьСкидку", флУстановитьСкидку);
	Закрыть(Результат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Скидка.Доступность = ЗначениеЗаполнено(ВидСкидки);
КонецПроцедуры

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	Элементы.Скидка.Доступность = ЗначениеЗаполнено(ВидСкидки);
КонецПроцедуры

&НаСервере
Процедура СкидкаПриИзмененииНаСервере()
	// здесь надо ограничить при необходимости значение Скидки
	МинимальноеЗначение = 0;
	МаксимальноеЗначение = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	гф_ДопустимыеЗначенияСкидок.МинимальноеЗначение КАК МинимальноеЗначение,
	               |	гф_ДопустимыеЗначенияСкидок.МаксимальноеЗначение КАК МаксимальноеЗначение
	               |ИЗ
	               |	РегистрСведений.гф_ДопустимыеЗначенияСкидок КАК гф_ДопустимыеЗначенияСкидок
	               |ГДЕ
	               |	гф_ДопустимыеЗначенияСкидок.ВидСкидки = &ВидСкидки";
	Запрос.УстановитьПараметр("ВидСкидки", ВидСкидки);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		МинимальноеЗначение = Выборка.МинимальноеЗначение;
		МаксимальноеЗначение = Выборка.МаксимальноеЗначение;
	КонецЕсли;
	Если Скидка < МинимальноеЗначение Тогда
		Скидка = МинимальноеЗначение;
		Сообщить("Скидка = МинимальноеЗначение:" + Скидка);
	КонецЕсли;
	Если Скидка > МаксимальноеЗначение Тогда
		Скидка = МаксимальноеЗначение;
		Сообщить("Скидка = МаксимальноеЗначение:" + Скидка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	СкидкаПриИзмененииНаСервере();
	флУстановитьСкидку = Истина;
КонецПроцедуры
