
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
	// Галфинд_Домнышева 2023/07/17
	ЗначениеВыбора = Параметры.Значение;
	
	Если Параметры.Свойство("ПослеОтменить") Тогда
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите другой документ.");
	КонецЕсли;	 
		 
	Если ЗначениеВыбора = 0 Тогда
		ЗаполнитьТаблицуЗаявками();
	Иначе  
		ЗаполнитьТаблицуПеремаркировками();
	КонецЕсли;
	// } #wortmann
КонецПроцедуры

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Подбирает проведенные документы ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента со статусом
// гф_ЗаявкаПереданаВРМК
// Галфинд_Домнышева 2023/07/17
&НаСервере
Процедура ЗаполнитьТаблицуЗаявками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаВозвратТоваровОтКлиента.Ссылка) КАК Представление
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
		|ГДЕ
		|	ЗаявкаНаВозвратТоваровОтКлиента.Проведен = ИСТИНА
		|	И ЗаявкаНаВозвратТоваровОтКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК)
		|	И ЗаявкаНаВозвратТоваровОтКлиента.ПометкаУдаления = Ложь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявкаНаВозвратТоваровОтКлиента.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокДокументов.Добавить(Выборка.Ссылка, Выборка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Подбирает непроведенные ДокументСсылка.ПеремаркировкаТоваровИСМП в статусе Черновик
// с ДокументОснование = ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента
// гф_ЗаявкаПереданаВРМК 
// Галфинд_Домнышева 2023/07/17
&НаСервере
Процедура ЗаполнитьТаблицуПеремаркировками()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыДокументовИСМП.Документ КАК Документ,
		|	ПРЕДСТАВЛЕНИЕ(СтатусыДокументовИСМП.Документ) КАК Представление
		|ИЗ
		|	РегистрСведений.СтатусыДокументовИСМП КАК СтатусыДокументовИСМП
		|ГДЕ
		|	СтатусыДокументовИСМП.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиПеремаркировкиТоваровИСМП.Черновик)
		|	И СтатусыДокументовИСМП.Документ ССЫЛКА Документ.ПеремаркировкаТоваровИСМП
		|	И СтатусыДокументовИСМП.Документ.Проведен = ЛОЖЬ
		|	И СтатусыДокументовИСМП.Документ.ПометкаУдаления = ЛОЖЬ
		|	И СтатусыДокументовИСМП.Документ.ДокументОснование ССЫЛКА Документ.ВозвратТоваровОтКлиента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокДокументов.Добавить(Выборка.Документ, Выборка.Представление);

	КонецЦикла;
	
КонецПроцедуры// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Возвращает выбранное значение на форму владельца 
// Галфинд_Домнышева 2023/07/17
&НаКлиенте
Процедура СписокДокументовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("Значение", СписокДокументов[Значение].Значение);
	
	Закрыть(СтруктураЗначений);

КонецПроцедуры// } #wortmann

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee40ea0c7c088b
	// Завершает работу с формой при принудительном закрытии 
	// Галфинд_Домнышева 2023/08/23
	ЗавершениеРаботы = Истина;
	// } #wortmann
КонецПроцедуры
