#Область ПрограммныйИнтерфейс

// #wortmann {
// Галфинд Волков 2023/009/26
// Формирование ПФ "Печать этикеток GS1" документы основания: "Перемещение товаров", "РТиУ"
// Параметры:
//
// КомандаПечати		- Структура.
//
&НаКлиенте
Функция гф_СформироватьПечатнуюФормуПечатьЭтикетокГС1(КомандаПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДефектнаяВедомостьЗаявкаНаРемонт";
	
	ОткрытьФорму("Обработка." + "гф_ПечатьЭтикетокГС1" + ".Форма", Новый Структура("ОбъектыПечати", КомандаПечати.ОбъектыПечати));
	
	Возврат Неопределено;
	
КонецФункции // } #wortmann

&НаКлиенте
Функция гф_СформироватьПечатнуюФормуПечатьЭтикетокРМКизРТУ(КомандаПечати) Экспорт
	
	ПараметрыФормы = Новый Структура("ПечатьИзРТУ");
	ПараметрыФормы.Вставить("СсылкаНаРТУ", КомандаПечати.ОбъектыПечати[0]);
	
	ОткрытьФорму("Обработка.гф_РабочееМестоКладовщика.Форма", ПараметрыФормы,, "ПечатьИзРТУ");
	
	Возврат Неопределено;
	
КонецФункции

//(н)Галфинд/Сефербеков 11.03.2024 ( 
&НаКлиенте
Функция гф_СформироватьПечатнуюФормуПечатьЭтикетокWortman(КомандаПечати) Экспорт
	
	//
	ОткрытьФорму("Обработка." + "гф_ПечатьЭтикетокГС1" + ".Форма.ФормаПечатьЭтикетокWortman", Новый Структура("ОбъектыПечати", КомандаПечати.ОбъектыПечати));
	
	Возврат Неопределено;
	
КонецФункции 
//(к)Галфинд/Сефербеков 11.03.2024 ) 

#КонецОбласти
