#Область ПрограммныйИнтерфейс

// #wortmann {
// Галфинд Волков 2023/009/26
// Формирование ПФ "Печать этикеток GS1" документы основания: "Перемещение товаров", "РТиУ"
// Параметры:
//
// КомандаПечати		- Структура.
//
&НаКлиенте
Функция гф_СформироватьПечатнуюФормуПечатьЭтикетокГС1(КомандаПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ДефектнаяВедомостьЗаявкаНаРемонт";
	
	ОткрытьФорму("Обработка." + "гф_ПечатьЭтикетокГС1" + ".Форма", Новый Структура("ОбъектыПечати", КомандаПечати.ОбъектыПечати));
	
	Возврат Неопределено;
	
КонецФункции // } #wortmann

#КонецОбласти
