
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// #wortmann {
	// #5.2.08
	// настройка дополнительных элементов формы 
	// Галфинд Sakovich 2022/08/09
	НастроитьДополнительныеЭлементы();
	// } #wortmann
КонецПроцедуры

// #wortmann {
// #5.2.08
// настройка дополнительных элементов формы 
// Галфинд Sakovich 2022/08/09
&НаСервере
Процедура НастроитьДополнительныеЭлементы()
	ТипПолеФормы = Тип("ПолеФормы");
	ТипТаблицаФормы = Тип("ТаблицаФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипГруппаФормы = Тип("ГруппаФормы");
	
	НовыйЭлемент = Элементы.Вставить("гф_IDкороба", ТипПолеФормы,
		Элементы.Товары);
    НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
    НовыйЭлемент.ПутьКДанным = "Объект.Товары.гф_IDкороба";
	НовыйЭлемент.Заголовок = "ID короба";
	НастроитьВидимостьIDкороба();
КонецПроцедуры // } #wortmann

// #wortmann {
// #5.2.08
// Галфинд Sakovich 2022/09/20
&НаСервере
Процедура НастроитьВидимостьIDкороба()
	Элементы.гф_IDкороба.Видимость = 
	(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв
	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезервПоМногимНазначениям
	ИЛИ Объект.ВидОперации =  Перечисления.ВидыОперацийКорректировкиНазначения.Резервировать
	ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать);
КонецПроцедуры // } #wortmann

// #wortmann {
// #5.2.08
// 
// Галфинд Sakovich 2022/08/09
&НаКлиенте
&После("ВидОперацииОбработкаВыбораЗавершение")
Процедура гф_ВидОперацииОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)
	НастроитьВидимостьIDкороба();
КонецПроцедуры // } #wortmann

#КонецОбласти


