#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Переопределяет параметры загрузки данных из файла.
//
// Параметры:
//  Параметры - Структура:
//   * ИмяМакетаСШаблоном - Строка - наименование макета. Например, "ЗагрузкаИзФайла".
//   * ИмяТабличнойЧасти - Строка - полное имя табличной части. Например, "Документ._ДемоСчетНаОплатуПокупателю.ТабличнаяЧасть.Товары"
//   * ОбязательныеКолонки - Массив из Строка - наименования обязательных для заполнения колонок.
//   * ТипДанныхКолонки - Соответствие из КлючИЗначение:
//      * Ключ - Строка - имя колонки;
//      * Значение - ОписаниеТипов - тип колонки загружаемых данных.
//   * ДополнительныеПараметры - Структура
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
	Возврат; // не используем, т.к загрузка производится в единственную таб.часть  Галфинд \ Sakovich 23.03.2023
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры["ДополнительныеПараметры"], 
		"Команда") = "гф_ЗагрузитьТоварыИзФайла" 
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИмяТабличнойЧасти") = 
		"Документ.ЗаявкаНаВозвратТоваровОтКлиента.ТабличнаяЧасть.ВозвращаемыеТовары" Тогда
		Параметры["ИмяМакетаСШаблоном"] = "ЗагрузкаИзФайлаВозвращаемыеТовары";
	КонецЕсли;
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
// СписокНеоднозначностей содержит список неоднозначных значений, для которых в ИБ имеется несколько
// подходящих вариантов.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                                        находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки.
//       Остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                                        являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений:
//     * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность.
//     * Идентификатор - Число - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - Произвольный - любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(
	АдресЗагружаемыхДанных, 
	АдресТаблицыСопоставления, 
	СписокНеоднозначностей, 
	ПолноеИмяТабличнойЧасти, 
	ДополнительныеПараметры) Экспорт
	
	Товары = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений
	
	ТаблицаДанныхДляЗагрузки = ПроверитьИПреобразоватьЗагружаемыеДанные(ЗагружаемыеДанные);// Галфинд_Домнышева_25_04_2023
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.гф_GTIN КАК СТРОКА(200))) КАК GTIN,
	|	ПОДСТРОКА(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.гф_GTIN КАК СТРОКА(200))), 1, 14) КАК GTIN_1_14,
	|	ПОДСТРОКА(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.гф_GTIN КАК СТРОКА(200))), 2, 13) КАК GTIN_2_13,
	|	СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.гф_КМСтрокой КАК СТРОКА(200))) КАК КМ,
	// ++ Галфинд_Домнышева_25_04_2023
	|	СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.гф_КМДляЗагрузки КАК СТРОКА(200))) КАК КМДляЗагрузки,
	// -- Галфинд_Домнышева_25_04_2023
	|	СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.Артикул КАК СТРОКА(200))) КАК Артикул,
	|	СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.НаименованиеНоменклатуры КАК СТРОКА(200))) КАК НаименованиеНоменклатуры,
	|	СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.Характеристика КАК СТРОКА(200))) КАК Характеристика,
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.гф_GTIN КАК СТРОКА(200)))) > 0
	|			ТОГДА ""ПоГтин""
	|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.Артикул КАК СТРОКА(200)))) > 0
	|				И ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.НаименованиеНоменклатуры КАК СТРОКА(200)))) = 0
	|			ТОГДА ""ПоАртикулу""
	|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.Артикул КАК СТРОКА(200)))) > 0
	|				И ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.НаименованиеНоменклатуры КАК СТРОКА(200)))) > 0
	|			ТОГДА ""ПоАртикулуИНаименованию""
	|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.Артикул КАК СТРОКА(200)))) = 0
	|				И ДЛИНАСТРОКИ(СОКРЛП(ВЫРАЗИТЬ(ДанныеДляСопоставления.НаименованиеНоменклатуры КАК СТРОКА(200)))) > 0
	|			ТОГДА ""ПоНаименованию""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВариантПоиска
	|ПОМЕСТИТЬ ДанныеДляСопоставления
	|ИЗ
	|	&ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	спрХарактеристики.Ссылка КАК Ссылка,
	|	спрХарактеристики.Владелец КАК Владелец,
	|	спрХарактеристики.Наименование КАК Наименование
	|ПОМЕСТИТЬ спрХарактеристики
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК спрХарактеристики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДляСопоставления КАК ДанныеСопоставления
	|		ПО спрХарактеристики.Наименование = ДанныеСопоставления.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДляСопоставления.ВариантПоиска КАК ВариантПоиска,
	|	ДанныеДляСопоставления.GTIN КАК GTIN_из_Файла,
	|	ВЫБОР
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоГтин""
	|			ТОГДА ВЫБОР
	|					КОГДА ШтрихкодыНоменклатуры_1_14.Штрихкод ЕСТЬ НЕ NULL 
	|						ТОГДА ШтрихкодыНоменклатуры_1_14.Штрихкод
	|					КОГДА ШтрихкодыНоменклатуры_2_13.Штрихкод ЕСТЬ НЕ NULL 
	|						ТОГДА ШтрихкодыНоменклатуры_2_13.Штрихкод
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК GTIN,
	|	ВЫБОР
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоГтин""
	|			ТОГДА ВЫБОР
	|					КОГДА ШтрихкодыНоменклатуры_1_14.Штрихкод ЕСТЬ НЕ NULL 
	|						ТОГДА ШтрихкодыНоменклатуры_1_14.Номенклатура
	|					КОГДА ШтрихкодыНоменклатуры_2_13.Штрихкод ЕСТЬ НЕ NULL 
	|						ТОГДА ШтрихкодыНоменклатуры_2_13.Номенклатура
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоАртикулу""
	|			ТОГДА спрНоменклатура.Ссылка
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоАртикулуИНаименованию""
	|			ТОГДА спрНоменклатураАН.Ссылка
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоНаименованию""
	|			ТОГДА спрНоменклатураН.Ссылка
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоГтин""
	|			ТОГДА ВЫБОР
	|					КОГДА ШтрихкодыНоменклатуры_1_14.Штрихкод ЕСТЬ НЕ NULL 
	|						ТОГДА ШтрихкодыНоменклатуры_1_14.Характеристика
	|					КОГДА ШтрихкодыНоменклатуры_2_13.Штрихкод ЕСТЬ НЕ NULL 
	|						ТОГДА ШтрихкодыНоменклатуры_2_13.Характеристика
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоАртикулу""
	|			ТОГДА ВЫБОР
	|					КОГДА спрХарактеристики.Ссылка ЕСТЬ НЕ NULL 
	|						ТОГДА ВЫБОР
	|								КОГДА спрХарактеристики.Наименование = ДанныеДляСопоставления.Характеристика
	|									ТОГДА спрХарактеристики.Ссылка
	|								ИНАЧЕ ""УдалитьСтрокуСХарактеристикой""
	|							КОНЕЦ
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоАртикулуИНаименованию""
	|			ТОГДА ВЫБОР
	|					КОГДА спрХарактеристикиАН.Ссылка ЕСТЬ НЕ NULL 
	|						ТОГДА ВЫБОР
	|								КОГДА спрХарактеристикиАН.Наименование = ДанныеДляСопоставления.Характеристика
	|									ТОГДА спрХарактеристикиАН.Ссылка
	|								ИНАЧЕ ""УдалитьСтрокуСХарактеристикой""
	|							КОНЕЦ
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	
	|		КОГДА ДанныеДляСопоставления.ВариантПоиска = ""ПоНаименованию""
	|			ТОГДА ВЫБОР
	|					КОГДА спрХарактеристикиН.Ссылка ЕСТЬ НЕ NULL 
	|						ТОГДА ВЫБОР
	|								КОГДА спрХарактеристикиН.Наименование = ДанныеДляСопоставления.Характеристика
	|									ТОГДА спрХарактеристикиН.Ссылка
	|								ИНАЧЕ ""УдалитьСтрокуСХарактеристикой""
	|							КОНЕЦ
	|					ИНАЧЕ NULL
	|				КОНЕЦ
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Характеристика,
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК гф_ПринятыеКМ,
	// ++ Галфинд_Домнышева_25_04_2023
	//|	ДанныеДляСопоставления.КМ КАК гф_КМСтрокой,
	|	ДанныеДляСопоставления.КМ КАК гф_КМИзФайла,
	|	ДанныеДляСопоставления.КМДляЗагрузки КАК гф_КМСтрокой,
	// -- Галфинд_Домнышева_25_04_2023
	|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ДанныеПредварительно
	|ИЗ
	|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры_1_14
	|		ПО ДанныеДляСопоставления.GTIN_1_14 = ШтрихкодыНоменклатуры_1_14.Штрихкод
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры_2_13
	|		ПО ДанныеДляСопоставления.GTIN_2_13 = ШтрихкодыНоменклатуры_2_13.Штрихкод
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	// ++ Галфинд_Домнышева_25_04_2023
	//|		ПО (ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = ДанныеДляСопоставления.КМ)
	|		ПО (ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = ДанныеДляСопоставления.КМДляЗагрузки)
	// -- Галфинд_Домнышева_25_04_2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ спрХарактеристики КАК спрХарактеристики
	|			ПО (спрХарактеристики.Владелец = спрНоменклатура.ВладелецХарактеристик
	|					ИЛИ спрХарактеристики.Владелец = спрНоменклатура.ВидНоменклатуры
	|					ИЛИ спрХарактеристики.Владелец = спрНоменклатура.Ссылка)
	|		ПО ДанныеДляСопоставления.Артикул = спрНоменклатура.Артикул
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатураАН
	|			ЛЕВОЕ СОЕДИНЕНИЕ спрХарактеристики КАК спрХарактеристикиАН
	|			ПО (спрХарактеристикиАН.Владелец = спрНоменклатураАН.ВладелецХарактеристик
	|					ИЛИ спрХарактеристикиАН.Владелец = спрНоменклатураАН.ВидНоменклатуры
	|					ИЛИ спрХарактеристикиАН.Владелец = спрНоменклатураАН.Ссылка)
	|		ПО ДанныеДляСопоставления.Артикул = спрНоменклатураАН.Артикул
	|			И ДанныеДляСопоставления.НаименованиеНоменклатуры = спрНоменклатураАН.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатураН
	|			ЛЕВОЕ СОЕДИНЕНИЕ спрХарактеристики КАК спрХарактеристикиН
	|			ПО (спрХарактеристикиН.Владелец = спрНоменклатураН.ВладелецХарактеристик
	|					ИЛИ спрХарактеристикиН.Владелец = спрНоменклатураН.ВидНоменклатуры
	|					ИЛИ спрХарактеристикиН.Владелец = спрНоменклатураН.Ссылка)
	|		ПО ДанныеДляСопоставления.НаименованиеНоменклатуры = спрНоменклатураН.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеПредварительно.ВариантПоиска КАК ВариантПоиска,
	|	ДанныеПредварительно.GTIN_из_Файла КАК GTIN_из_Файла,
	|	ДанныеПредварительно.GTIN КАК GTIN,
	|	ДанныеПредварительно.Номенклатура КАК Номенклатура,
	|	ДанныеПредварительно.Характеристика КАК Характеристика,
	|	ДанныеПредварительно.гф_ПринятыеКМ КАК гф_ПринятыеКМ,
	|	ДанныеПредварительно.гф_КМСтрокой КАК гф_КМСтрокой,
	|	ДанныеПредварительно.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ДанныеПредварительно КАК ДанныеПредварительно
	|ГДЕ
	|	НЕ ДанныеПредварительно.Характеристика = ""УдалитьСтрокуСХарактеристикой""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ
	|	МАКСИМУМ(Данные.Номенклатура) КАК Номенклатура,
	|	Данные.Идентификатор КАК Идентификатор,
	|	КОЛИЧЕСТВО(Данные.Идентификатор) КАК Количество
	|ИЗ
	|	Данные КАК Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ
	|	Данные.GTIN_из_Файла КАК GTIN_из_Файла,
	|	Данные.GTIN КАК GTIN,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Характеристика КАК Характеристика,
	|	Данные.гф_ПринятыеКМ КАК гф_ПринятыеКМ,
	|	Данные.гф_КМСтрокой КАК гф_КМСтрокой,
	|	Данные.Идентификатор КАК Идентификатор
	|ИЗ
	|	Данные КАК Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор,
	|	Номенклатура,
	|	Характеристика";
	
	// ++ Галфинд_Домнышева_25_04_2023
	//Запрос.УстановитьПараметр("ДанныеДляСопоставления", ЗагружаемыеДанные);
	Запрос.УстановитьПараметр("ДанныеДляСопоставления", ТаблицаДанныхДляЗагрузки);
	// -- Галфинд_Домнышева_25_04_2023

	РезультатыЗапросов = Запрос.ВыполнитьПакет(); // Массив из РезультатЗапроса
	
	ТаблицаНоменклатура = РезультатыЗапросов[4].Выгрузить(); // ТаблицаЗначений
	ТаблицаДанные = РезультатыЗапросов[5].Выгрузить(); // ТаблицаЗначений
	Для каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		Товар = Товары.Добавить();
		Товар.Идентификатор = СтрокаТаблицы.Идентификатор;
		// ++ Галфинд_Домнышева_25_04_2023
		//Товар.гф_КМСтрокой = СтрокаТаблицы.гф_КМСтрокой;
		Товар.гф_КМИзФайла = СтрокаТаблицы.гф_КМСтрокой;
		// -- Галфинд_Домнышева_25_04_2023
		
		СтрокаДанные = ТаблицаДанные.Найти(СтрокаТаблицы.Идентификатор, "Идентификатор");
		СтрокаНоменклатура = ТаблицаНоменклатура.Найти(СтрокаТаблицы.Идентификатор, "Идентификатор");
		Если СтрокаДанные  <> Неопределено Тогда
			Товар.Характеристика = СтрокаДанные.Характеристика;
			Товар.гф_ПринятыеКМ = СтрокаДанные.гф_ПринятыеКМ;
			Товар.гф_КМСтрокой = СтрокаДанные.гф_КМСтрокой; // Галфинд_Домнышева_25_04_2023
		КонецЕсли;	
		Если СтрокаНоменклатура <> Неопределено Тогда
			Если СтрокаНоменклатура.Количество = 1 Тогда
				Товар.Номенклатура = СтрокаНоменклатура.Номенклатура;
			Иначе
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор;
				ЗаписьОНеоднозначности.Колонка = "Номенклатура";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Товары, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   СписокНеоднозначностей    - Массив из СправочникСсылка.Номенклатура - массив для заполнения с неоднозначными данными.
//   ИмяКолонки                - Строка - имя колонки, в который возникла неоднозначность.
//   ЗагружаемыеЗначенияСтрока - Строка - загружаемые данные на основании которых возникла неоднозначность.
//   ДополнительныеПараметры   - Произвольный - любые дополнительные сведения.
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
		
	Если ИмяКолонки = "Номенклатура" Тогда
		Запрос = Новый Запрос;
		ТекстГде = "";
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.Артикул) Тогда
			ТекстГде = "ГДЕ спрНоменклатура.Артикул = &Артикул";
			Запрос.УстановитьПараметр("Артикул", ЗагружаемыеЗначенияСтрока.Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗагружаемыеЗначенияСтрока.НаименованиеНоменклатуры) Тогда
			Если ЗначениеЗаполнено(ТекстГде) Тогда
				ТекстГде = ТекстГде + " И спрНоменклатура.Наименование = &НаименованиеНоменклатуры";
			Иначе
				ТекстГде = "ГДЕ спрНоменклатура.Наименование = &НаименованиеНоменклатуры";
			КонецЕсли;
			Запрос.УстановитьПараметр("НаименованиеНоменклатуры", ЗагружаемыеЗначенияСтрока.НаименованиеНоменклатуры);
		КонецЕсли;
		Запрос.Текст = "ВЫБРАТЬ
			|	спрНоменклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК спрНоменклатура " + ТекстГде;
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокНеоднозначностей.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// vvv Галфинд \ Sakovich 23.03.2023
// создается документ ПриходныйОрдрерНаТовары с видом операции «Возврат не принятых получателем товаров».
// Отправителем является Клиент. Табличная часть заполняется сопоставленными строками ТЧ «Товары» документа
// «Заявка на возврат товаров от клиента».
//
// Параметры: - ОбъектИлиСсылка - Тип:
//				- ДокументОбъект.ЗаявкаНаВозвратТоваровОтКлиента
//				- ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента
Процедура гф_СоздатьПриходныйОрдерНаТовары(ОбъектИлиСсылка, ЗагружаемыеТовары = Неопределено) Экспорт
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Склад", ОбъектИлиСсылка.Склад);
	ДанныеЗаполнения.Вставить("Помещение");
	ДанныеЗаполнения.Вставить("Распоряжение", ОбъектИлиСсылка.Ссылка);
	ДанныеЗаполнения.Вставить("ДатаПоступления", ОбъектИлиСсылка.ДатаПоступления);
	ДанныеЗаполнения.Вставить("ЗонаПриемки");
	ДанныеЗаполнения.Вставить("СкладскаяОперация");
	ДанныеЗаполнения.Вставить("Отправитель", ОбъектИлиСсылка.Партнер);
	ДанныеЗаполнения.Вставить("ДатаВходящегоДокумента");
	ДанныеЗаполнения.Вставить("НомерВходящегоДокумента");
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", ОбъектИлиСсылка.ХозяйственнаяОперация);
	ДанныеЗаполнения.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	
	обПрихОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	обПрихОрдер.Дата = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(обПрихОрдер, ДанныеЗаполнения);
	
	// vvv Галфинд \ Sakovich 23.03.2023
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edc9317888e8d6
	//обПрихОрдер.СкладскаяОперация = 
	//СкладыКлиентСервер.СкладскаяОперацияПриемкиПоХозяйственнойОперации(обПрихОрдер.ХозяйственнаяОперация);
	обПрихОрдер.СкладскаяОперация = Перечисления.СкладскиеОперации.ВозвратНеПринятыхТоваров;
	// ^^^ Галфинд \ Sakovich 23.03.2023 
	// ++ Галфинд_ДомнышеваКР_07_06_2023
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8ea8b083fed1320811ee0383d7909af6
	Если ЗагружаемыеТовары = Неопределено Тогда
	// -- Галфинд_ДомнышеваКР_07_06_2023	
		тзВозвращаемыеТовары = ОбъектИлиСсылка.ВозвращаемыеТовары.Выгрузить();
	// ++ Галфинд_ДомнышеваКР_07_06_2023	
	Иначе
		тзВозвращаемыеТовары = ЗагружаемыеТовары;
	КонецЕсли;
	// -- Галфинд_ДомнышеваКР_07_06_2023
	гф_ЗаполнитьПриходныйОрдерТовары(обПрихОрдер, тзВозвращаемыеТовары);
	
	ОбъектМетаданныхСтатус = обПрихОрдер.Метаданные().Реквизиты.Статус; // ОбъектМетаданныхРеквизит
	обПрихОрдер.Статус = ОбъектМетаданныхСтатус.ЗначениеЗаполнения;
	
	обПрихОрдер.Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(обПрихОрдер.Склад);
	Если ЗначениеЗаполнено(обПрихОрдер.Склад) Тогда
		Если СкладыСервер.ИспользоватьАдресноеХранение(обПрихОрдер.Склад, обПрихОрдер.Помещение, обПрихОрдер.Дата) Тогда
			обПрихОрдер.ЗонаПриемки = 
			Справочники.СкладскиеЯчейки.ЗонаПриемкиПоУмолчанию(
			обПрихОрдер.Склад, 
			обПрихОрдер.Помещение, 
			обПрихОрдер.ЗонаПриемки);
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		обПрихОрдер.Записать(РежимЗаписиДокумента.Проведение);
		ТекстСообщения = "Создан документ " + обПрихОрдер.Ссылка;
		ЗаписатьДокументПриходныйОрдерВТабличнуюЧасть(обПрихОрдер, ОбъектИлиСсылка);// Галфинд_Домнышева 2023/04/24
	Исключение
		ТекстСообщения = "Не удалось создать документ ""Приходный ордер на товары!""";
	КонецПопытки;
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры // ^^^ Галфинд \ Sakovich 23.03.2023 

Процедура гф_ЗаполнитьПриходныйОрдерТовары(обОрдер, тзТовары)
	
	обОрдер.Товары.Очистить();
	ПараметрыОтбора = Новый Структура("Отменено", Ложь);
	мСтрокТовары = тзТовары.НайтиСтроки(ПараметрыОтбора);
	тзТоварыКЗаполнению = тзТовары.Скопировать(мСтрокТовары);
	
	массивКМ = тзТоварыКЗаполнению.ВыгрузитьКолонку("гф_ПринятыеКМ");
	
	тзТоварыКЗаполнению.Свернуть("Номенклатура, Характеристика, Назначение, гф_IDКороба",
	"Количество, КоличествоУпаковок");
	
	ВыборкаШтрихкодов = гф_ПолучитьШтрихкодыНоменклатуры(тзТоварыКЗаполнению);
	
	Для каждого стрТЗ Из тзТоварыКЗаполнению Цикл
		нс = обОрдер.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(нс, стрТЗ, 
		"Номенклатура, Характеристика, Назначение, Количество, КоличествоУпаковок, гф_IDКороба");
		ВыборкаШтрихкодов.Сбросить();
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика", нс["Номенклатура"], нс["Характеристика"]);
		Если ВыборкаШтрихкодов.НайтиСледующий(СтруктураПоиска) Тогда
			нс["Штрихкод"] = ВыборкаШтрихкодов["Штрихкод"];
		КонецЕсли;
	КонецЦикла; 
	
	обОрдер["ВсегоМест"] = обОрдер.Товары.Итог("Количество");
	
	Для каждого КМ Из массивКМ Цикл
		Если ЗначениеЗаполнено(КМ) Тогда
			нс = обОрдер["ШтрихкодыУпаковок"].Добавить();
			нс["ШтрихкодУпаковки"] = КМ;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция гф_ПолучитьШтрихкодыНоменклатуры(тзТоварыКЗаполнению)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТоварыКЗаполнению
	|ИЗ
	|	&тзТоварыКЗаполнению КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК Штрихкод,
	|	ТоварыКЗаполнению.Номенклатура КАК Номенклатура,
	|	ТоварыКЗаполнению.Характеристика КАК Характеристика
	|ИЗ
	|	ТоварыКЗаполнению КАК ТоварыКЗаполнению
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ТоварыКЗаполнению.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И ТоварыКЗаполнению.Характеристика = ШтрихкодыНоменклатуры.Характеристика");
	Запрос.УстановитьПараметр("тзТоварыКЗаполнению", тзТоварыКЗаполнению);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Возврат Выборка;
		
КонецФункции

// #wortmann { 
// Заполняет ТЧ Заявки соответствующими значениями ордеров 
// Галфинд_Домнышева 2023/04/24
Процедура ЗаписатьДокументПриходныйОрдерВТабличнуюЧасть(ПриходныйОрдер, ЗаявкаНаВозврат)
	
	Заявка = ЗаявкаНаВозврат.ПолучитьОбъект();
	
	// ++ Галфинд_Домнышева_11_04_2023
	Для каждого Строка Из ПриходныйОрдер.Товары Цикл
		СтруОтбора = Новый Структура;
		СтруОтбора.Вставить("Номенклатура", Строка.Номенклатура);
		СтруОтбора.Вставить("Характеристика", Строка.Характеристика);
		СтруОтбора.Вставить("гф_IDКороба", Строка.гф_IDКороба);
		
		СтрокиТоваров = Заявка.ВозвращаемыеТовары.НайтиСтроки(СтруОтбора);
		
		Для Каждого Стр из СтрокиТоваров Цикл
			Стр.гф_ДокументПриходныйОрдер = ПриходныйОрдер.Ссылка;
		КонецЦикла;
	КонецЦикла;
	Заявка.ОбменДанными.Загрузка = Истина;
	Заявка.Записать();
	// --Галфинд_Домнышева_11_04_2023

КонецПроцедуры

// #wortmann { 
// Создает копию ТЗ ЗагружаемыеДанные и добавляет колонку "гф_КМДляЗагрузки" 
// Галфинд_Домнышева 2023/04/25
Функция ПроверитьИПреобразоватьЗагружаемыеДанные(ЗагружаемыеДанные)

	НоваяТаблица = ЗагружаемыеДанные.Скопировать();
	ЗначенияСтроковые = НоваяТаблица.ВыгрузитьКолонку("гф_КМСтрокой");
	НовыеЗначения = Новый Массив;
	Для каждого Значение Из ЗначенияСтроковые Цикл
		
		Если   Лев(Значение, 1) <> "("  Тогда
			
			НовоеЗначение = "(" + Лев(Значение, 2) + ")" + Сред(Значение, 3, 14) + "(" + Сред(Значение, 17, 2) + ")" + Сред(Значение, 19);
			НовыеЗначения.Добавить(НовоеЗначение);
		Иначе
			НовыеЗначения.Добавить(Значение);
		КонецЕсли;
		
	КонецЦикла;
		
	НоваяТаблица.Колонки.Добавить("гф_КМДляЗагрузки", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.ЗагрузитьКолонку(НовыеЗначения, "гф_КМДляЗагрузки");
	Возврат НоваяТаблица;
	
КонецФункции// } #wortmann

&ИзменениеИКонтроль("ТекстЗапросаТаблицаЗаявкиНаВозвратТоваровОтКлиентов")
Функция гф_ТекстЗапросаТаблицаЗаявкиНаВозвратТоваровОтКлиентов(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ЗаявкиНаВозвратТоваровОтКлиентов";

	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1                                                  КАК Порядок,
	|	ТаблицаВозвращаемыеТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)             КАК ВидДвижения,
	|	&Период                                            КАК Период,
	|	ТаблицаВозвращаемыеТовары.Ссылка                   КАК ЗаявкаНаВозвратТоваровОтКлиента,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор,
	|	ВЫБОР КОГДА 
	|			ТаблицаВозвращаемыеТовары.Порча 
	|				И ТаблицаВозвращаемыеТовары.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
	|			ТаблицаВозвращаемыеТовары.НоменклатураОприходование
	|		ИНАЧЕ ТаблицаВозвращаемыеТовары.Номенклатура
	|	КОНЕЦ                                              КАК Номенклатура,
	|	ВЫБОР КОГДА 
	|			ТаблицаВозвращаемыеТовары.Порча 
	|				И ТаблицаВозвращаемыеТовары.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
	|			ТаблицаВозвращаемыеТовары.ХарактеристикаОприходование
	|		ИНАЧЕ ТаблицаВозвращаемыеТовары.Характеристика
	|	КОНЕЦ                                              КАК Характеристика,
	|	ТаблицаВозвращаемыеТовары.КодСтроки                КАК КодСтроки,
	|	ВЫБОР КОГДА НЕ ТаблицаВозвращаемыеТовары.Отменено ТОГДА
	|			ТаблицаВозвращаемыеТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                              КАК КОформлению,
	|	ТаблицаВозвращаемыеТовары.Количество               КАК Заявлено
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТаблицаВозвращаемыеТовары
	|ГДЕ
	|	ТаблицаВозвращаемыеТовары.Ссылка = &Ссылка
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Отклонена))
	|	И &ХозяйственнаяОперация НЕ В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2                                                  КАК Порядок,
	|	ТаблицаВозвращаемыеТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)             КАК ВидДвижения,
	|	&Период                                            КАК Период,
	|	ТаблицаВозвращаемыеТовары.Ссылка                   КАК ЗаказПоставщику,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор,
	|	ТаблицаВозвращаемыеТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаВозвращаемыеТовары.Характеристика           КАК Характеристика,
	|	ТаблицаВозвращаемыеТовары.КодСтроки                КАК КодСтроки,
	|	0                                                  КАК КОформлению,
	|	-ТаблицаВозвращаемыеТовары.Количество              КАК Заявлено
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТаблицаВозвращаемыеТовары
	|ГДЕ
	|	ТаблицаВозвращаемыеТовары.Ссылка = &Ссылка
	|	И (ТаблицаВозвращаемыеТовары.Отменено И НЕ &Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована))
	|	И &ХозяйственнаяОперация НЕ В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3                                                  КАК Порядок,
	|	ТаблицаВозвращаемыеТовары.НомерСтроки              КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)             КАК ВидДвижения,
	|	&Период                                            КАК Период,
	|	ТаблицаВозвращаемыеТовары.Ссылка                   КАК ЗаявкаНаВозвратТоваровОтКлиента,
	|	ТаблицаВозвращаемыеТовары.Ссылка.Договор           КАК Договор,
	|	ВЫБОР КОГДА 
	|			ТаблицаВозвращаемыеТовары.Порча 
	|				И ТаблицаВозвращаемыеТовары.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
	|			ТаблицаВозвращаемыеТовары.НоменклатураОприходование
	|		ИНАЧЕ ТаблицаВозвращаемыеТовары.Номенклатура
	|	КОНЕЦ                                              КАК Номенклатура,
	|	ВЫБОР КОГДА 
	|			ТаблицаВозвращаемыеТовары.Порча 
	|				И ТаблицаВозвращаемыеТовары.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
	|			ТаблицаВозвращаемыеТовары.ХарактеристикаОприходование
	|		ИНАЧЕ ТаблицаВозвращаемыеТовары.Характеристика
	|	КОНЕЦ                                              КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ЭтоВозвратОтКомиссионера
	|			И НЕ ДоговорыКонтрагентов.Ссылка ЕСТЬ NULL
	|			И ДоговорыКонтрагентов.КомиссионныеПродажи25
	|			ТОГДА 0
	|		КОГДА &ЭтоВозвратОтХранителя
	|			ТОГДА 0
	|		ИНАЧЕ ТаблицаВозвращаемыеТовары.КодСтроки
	|	КОНЕЦ                                              КАК КодСтроки,
	|	ВЫБОР КОГДА НЕ ТаблицаВозвращаемыеТовары.Отменено ТОГДА
	|			ТаблицаВозвращаемыеТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                              КАК КОформлению,
	|	ТаблицаВозвращаемыеТовары.Количество               КАК Заявлено
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТаблицаВозвращаемыеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО ДоговорыКонтрагентов.Ссылка = ТаблицаВозвращаемыеТовары.Ссылка.Договор
	|ГДЕ
	|	ТаблицаВозвращаемыеТовары.Ссылка = &Ссылка
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|						ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Отклонена))
	|	И &ХозяйственнаяОперация В (
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтХранителя),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТекстЗапросаТаблицаЗаказыКлиентов")
Функция гф_ТекстЗапросаТаблицаЗаказыКлиентов(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "ЗаказыКлиентов";

	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки               КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	НачалоПериода(&Период, День)            КАК Период,
	|	&Ссылка                                 КАК ЗаказКлиента,
	|	ТаблицаТовары.Номенклатура              КАК Номенклатура,
	|	ТаблицаТовары.Характеристика            КАК Характеристика,
	|	ТаблицаТовары.Серия                     КАК Серия,
	|	ТаблицаТовары.КодСтроки                 КАК КодСтроки,
	|	ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|		&Склад
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                   КАК Склад,
	|	ТаблицаТовары.Количество                КАК Заказано,
	|	0                                       КАК КОформлению,
	|	ТаблицаТовары.СуммаСНДС                 КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                            КАК ПричинаОтмены
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки               КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	ТаблицаТовары.ДатаОтгрузки              КАК Период,
	|	&Ссылка                                 КАК ЗаказКлиента,
	|	ТаблицаТовары.Номенклатура              КАК Номенклатура,
	|	ТаблицаТовары.Характеристика            КАК Характеристика,
	|	ТаблицаТовары.Серия                     КАК Серия,
	|	ТаблицаТовары.КодСтроки                 КАК КодСтроки,
	|	ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|		&Склад
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                   КАК Склад,
	|	0                                       КАК Заказано,
	|	ТаблицаТовары.Количество                КАК КОформлению,
	|	0                                       КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                            КАК ПричинаОтмены
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
	|	И НЕ ТаблицаТовары.Отменено
	|	И ТаблицаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки                КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)   КАК ВидДвижения,
	|	&Период                                  КАК Период,
	|	&Ссылка                                  КАК ЗаказКлиента,
	|	ТаблицаТовары.Номенклатура               КАК Номенклатура,
	|	ТаблицаТовары.Характеристика             КАК Характеристика,
	|	ТаблицаТовары.Серия                      КАК Серия,
	|	ТаблицаТовары.КодСтроки                  КАК КодСтроки,
	|	ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)) ТОГДА
	|			&Склад
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                    КАК Склад,
	|	-ТаблицаТовары.Количество                КАК Заказано,
	|	0                                        КАК КОформлению,
	|	-ТаблицаТовары.СуммаСНДС                 КАК Сумма,
	|	ТаблицаТовары.ПричинаОтмены              КАК ПричинаОтмены
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Отменено
	|	И &Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ОтразитьРаспределениеЗапасовДвижения")
Процедура гф_ОтразитьРаспределениеЗапасовДвижения(Запрос, ТекстыЗапроса, Регистры)
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка         КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата    КАК Период,
		|	ТабЧасть.Номенклатура   КАК Номенклатура,
		|	ТабЧасть.Характеристика КАК Характеристика,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|				ТабЧасть.Подразделение
		|			ИНАЧЕ
		|				ТабЧасть.Ссылка.Склад
		|		КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Обособленно ТОГДА
		|				
		|				ТабЧасть.Ссылка.Назначение
		|				
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		КОНЕЦ КАК Назначение,
		|	
		|	ТабЧасть.Количество     КАК Количество,
		|	ТабЧасть.Ссылка         КАК ЗапланированныйРасходРаспределенногоЗапаса,
		|	ИСТИНА                  КАК КонтрольСвободногоОстатка,
		|	ЛОЖЬ                    КАК ИгнорироватьРезервыПриКонтролеОстатков
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Отменено
		|		И ТабЧасть.Ссылка.Статус В(
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
		|		И ТабЧасть.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)";
	
	РаспределениеЗапасовДвижения.РасходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	
	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка             КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата        КАК Период,
		|	ТабЧасть.Номенклатура       КАК Номенклатура,
		|	ТабЧасть.Характеристика     КАК Характеристика,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|			ТабЧасть.Подразделение
		|		ИНАЧЕ
		|			ТабЧасть.Ссылка.Склад
		|		КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Обособленно ТОГДА
		|				
		|				ТабЧасть.Ссылка.Назначение
		|				
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		КОНЕЦ КАК Назначение,
		|	
		|	ТабЧасть.Количество         КАК Количество,
		|	ТабЧасть.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ТабЧасть.Ссылка             КАК Заказ,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Ссылка.НеОтгружатьЧастями ТОГДА
		|				ТабЧасть.Ссылка.ДатаОтгрузки
		|			ИНАЧЕ
		|				ТабЧасть.ДатаОтгрузки
		|		КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике,
		|	0 КАК КоличествоВГрафике
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Отменено
		|		И ТабЧасть.Ссылка.Статус В(
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
		|		И ТабЧасть.ВариантОбеспечения <> ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)";
	
	РаспределениеЗапасовДвижения.ЗапланироватьРасходЗапаса(
		Запрос,
		ТекстыЗапроса,
		Регистры,
		ТекстЗапросаТабЧасть);

	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка                                     КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата                                КАК Период,
		|	ТабЧасть.Номенклатура                               КАК Номенклатура,
		|	ТабЧасть.Характеристика                             КАК Характеристика,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|			ТабЧасть.Подразделение
		|		ИНАЧЕ
		|			ТабЧасть.Ссылка.Склад
		|		КОНЕЦ КАК Склад,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Обособленно ТОГДА
		|				
		|				ТабЧасть.Ссылка.Назначение
		|				
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|		КОНЕЦ КАК Назначение,
		|	
		|	ТабЧасть.Количество                                 КАК Количество,
		|	
		|	ВЫБОР
		|		КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) И ТабЧасть.Обособленно
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
		|		КОГДА ТабЧасть.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) И НЕ ТабЧасть.Обособленно
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
		|	КОНЕЦ КАК ВариантОбеспечения,
		|	
		|	ТабЧасть.Ссылка                                     КАК Заказ,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Ссылка.НеОтгружатьЧастями ТОГДА
		|				ТабЧасть.Ссылка.ДатаОтгрузки
		|			ИНАЧЕ
		|				ТабЧасть.ДатаОтгрузки
		|		КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
		|	ЛОЖЬ КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО КАК РаспоряжениеВГрафике,
		|	0 КАК КоличествоВГрафике
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТабЧасть
		|ГДЕ
		|	НЕ ТабЧасть.Отменено
		|		И ТабЧасть.Ссылка.Статус В(
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату))
		|		И ТабЧасть.ВариантОбеспечения В(
		|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить),
		|			ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада))";
	
	РаспределениеЗапасовДвижения.ЗапланироватьРасходЗапаса(
		Запрос,
		ТекстыЗапроса,
		Регистры,
		ТекстЗапросаТабЧасть);

	ТекстЗапросаТабЧасть =
		"ВЫБРАТЬ
		|	ТабЧасть.Ссылка          КАК Ссылка,
		|	ТабЧасть.Ссылка.Дата     КАК Период,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Порча И ТабЧасть.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
		|				ТабЧасть.НоменклатураОприходование
		|			ИНАЧЕ
		|				ТабЧасть.Номенклатура
		|		КОНЕЦ КАК Номенклатура,
		|	
		|	ВЫБОР КОГДА ТабЧасть.Порча И ТабЧасть.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
		|				ТабЧасть.ХарактеристикаОприходование
		|			ИНАЧЕ
		|				ТабЧасть.Характеристика
		|		КОНЕЦ КАК Характеристика,
		|	
		|	ТабЧасть.Ссылка.Склад    КАК Склад,
		|	ТабЧасть.Назначение      КАК Назначение,
		|	ТабЧасть.Количество      КАК Количество,
		|	ТабЧасть.Ссылка          КАК Заказ,
		|	ТабЧасть.ДатаПоступления КАК ДатаПоступления,
		|	ИСТИНА                   КАК ДоступенДляРасхода,
		|	ЛОЖЬ                     КАК ПоГрафику,
		|	НЕОПРЕДЕЛЕНО             КАК РаспоряжениеВГрафике,
		|	0                        КАК КоличествоВГрафике
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ТабЧасть
		|ГДЕ
		|	ТабЧасть.Ссылка.Статус В(
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
		|			ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
		|	И НЕ ТабЧасть.Отменено";
	
	РаспределениеЗапасовДвижения.ЗапланироватьПриходЗапаса(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаТабЧасть);
	
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьТекстыОтраженияВзаиморасчетов")
Процедура гф_ДобавитьТекстыОтраженияВзаиморасчетов(Запрос, ТекстыЗапроса, Регистры)

	Если НЕ ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтКонтрольОплаты", ТекстыЗапроса) Тогда
		ТекстЗапросаВтКонтрольОплаты(Запрос, ТекстыЗапроса);
	КонецЕсли;

	ТекстПланыОплат =
	"ВЫБРАТЬ
	|	Таблица.Ссылка                                                           КАК Ссылка,
	|	Таблица.Ссылка.Организация                                               КАК Организация,
	|	Таблица.Ссылка.Партнер                                                   КАК Партнер,
	|	
	|	Таблица.Ссылка.ОбъектРасчетов                                            КАК ОбъектРасчетов,
	|	Таблица.Ссылка.Дата                                                      КАК ДатаРегистратора,
	|	Таблица.Ссылка.Номер                                                     КАК НомерРегистратора,
	|	Таблица.Ссылка.ПорядокРасчетов                                           КАК ПорядокРасчетов,
	|	Таблица.Ссылка.Валюта                                                    КАК ВалютаВзаиморасчетов,
	|	Таблица.Ссылка.Валюта                                                    КАК ВалютаДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПланированиеПоЗаказуКлиента) КАК ХозяйственнаяОперация,
	|	Таблица.Ссылка.ФормаОплаты                                               КАК ФормаОплаты,
	|	Таблица.ДатаПлатежа                                                      КАК ДатаПлатежа,
	|	Таблица.ВариантОплаты                                                    КАК ВариантОплаты,
	|	Таблица.СуммаПлатежа + Таблица.СуммаЗалогаЗаТару                         КАК КОплате,
	|	Таблица.СуммаОтклоненияМерныхТоваров                                     КАК СуммаОтклоненияМерныхТоваров,
	|	ВЫБОР
	|		КОГДА Таблица.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения)
	|			ТОГДА КонтрольОплаты.ИсключатьПриКонтролеАванс
	|		КОГДА Таблица.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки)
	|			ТОГДА КонтрольОплаты.ИсключатьПриКонтролеПредоплату
	|		КОГДА Таблица.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ                                                                   КАК ИсключатьПриКонтроле
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЭтапыГрафикаОплаты КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКонтрольОплаты КАК КонтрольОплаты
	|		ПО ИСТИНА
	|ГДЕ
	|	Таблица.Ссылка В (&Ссылка)
	|	И Таблица.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
	|	И Таблица.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)";

	ТекстПланыОтгрузок =
	"ВЫБРАТЬ
	|	Таблица.Ссылка                                                           КАК Ссылка,
	|	Таблица.Ссылка.Организация                                               КАК Организация,
	|	Таблица.Ссылка.Партнер                                                   КАК Партнер,
	|	
	|	Таблица.Ссылка.ОбъектРасчетов                                            КАК ОбъектРасчетов,
	|	КОНЕЦПЕРИОДА(Таблица.ДатаОтгрузки, ДЕНЬ)                                 КАК ДатаОтгрузки,
	|	Таблица.СуммаСНДС                                                        КАК КОтгрузке,
	|	ВЫБОР КОГДА Таблица.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|			ТОГДА Таблица.СуммаСНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                    КАК УвеличитьОтгружается,
	|	Таблица.Ссылка.Дата                                                      КАК ДатаРегистратора,
	|	Таблица.Ссылка.Номер                                                     КАК НомерРегистратора,
	|	Таблица.Ссылка.ПорядокРасчетов                                           КАК ПорядокРасчетов,
	|	Таблица.Ссылка.Валюта                                                    КАК ВалютаВзаиморасчетов,
	|	Таблица.Ссылка.Валюта                                                    КАК ВалютаДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПланированиеПоЗаказуКлиента) КАК ХозяйственнаяОперация,
	|	Таблица.Ссылка.ФормаОплаты                                               КАК ФормаОплаты
	|	
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&Ссылка)
	|	И Таблица.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
	|	И НЕ Таблица.Ссылка.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
	|	И (Таблица.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		ИЛИ Таблица.Ссылка.ТребуетсяЗалогЗаТару
	|		ИЛИ НЕ Таблица.Ссылка.ВернутьМногооборотнуюТару)
	|	И Таблица.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И Таблица.Ссылка.СпособКомпенсации = ЗНАЧЕНИЕ(Перечисление.СпособыКомпенсацииВозвратовТоваров.ЗаменитьТовары)";

	ВзаиморасчетыСервер.ПроведениеЗаказаКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстПланыОплат, ТекстПланыОтгрузок);

	ТекстВозврат = "
	|ВЫБРАТЬ
	|	Таблица.Ссылка                         КАК Ссылка,
	|	Таблица.Ссылка.Организация             КАК Организация,
	|	Таблица.Ссылка.Партнер                 КАК Партнер,
	|	
	|	Таблица.Ссылка.ОбъектРасчетов          КАК ОбъектРасчетов,
	|	Таблица.Ссылка.Валюта                  КАК ВалютаВзаиморасчетов,
	|	Таблица.Ссылка.Валюта                  КАК ВалютаДокумента,
	|	0                                      КАК СуммаВзаиморасчетов,
	|	0                                      КАК Сумма,
	|	Таблица.СуммаСНДС                      КАК КОплате,
	|	
	|	Таблица.Ссылка.Дата                    КАК ДатаРегистратора,
	|	Таблица.Ссылка.Номер                   КАК НомерРегистратора,
	|	Таблица.Ссылка.Дата                    КАК ДатаКурса,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПланированиеПоЗаказуКлиента)  КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&Ссылка)
	|	И Таблица.Ссылка.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|	И Таблица.Ссылка.СпособКомпенсации = ЗНАЧЕНИЕ(Перечисление.СпособыКомпенсацииВозвратовТоваров.ВернутьДенежныеСредства)
	|	И Таблица.Ссылка.ПорядокРасчетов <> ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)
	|	И (Таблица.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|		ИЛИ Таблица.Ссылка.ТребуетсяЗалогЗаТару
	|		ИЛИ НЕ Таблица.Ссылка.ВернутьМногооборотнуюТару)
	|	И НЕ Таблица.Ссылка.ПорядокРасчетов = ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоНакладным)";

	ВзаиморасчетыСервер.ПроведениеВозвратаОтКлиента(Запрос, ТекстыЗапроса, Регистры, ТекстВозврат); 

КонецПроцедуры

&ИзменениеИКонтроль("ЗапланироватьПоступлениеТоваров")
Процедура гф_ЗапланироватьПоступлениеТоваров(Запрос, ТекстыЗапроса, Регистры)

	ТекстЗапросаДокумента = 
	"ВЫБРАТЬ
	|	ИсточникДанных.Ссылка                        КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО                                 КАК Накладная,
	|	ЛОЖЬ                                         КАК Исправление,
	|	НЕОПРЕДЕЛЕНО                                 КАК ИсправляемыйДокумент,
	|	ИсточникДанных.Ссылка                        КАК Заказ,
	|	НЕОПРЕДЕЛЕНО                                 КАК Договор,
	|	НЕОПРЕДЕЛЕНО                                 КАК Соглашение,
	|	ИсточникДанных.Ссылка.ВариантПриемкиТоваров  КАК ВариантПриемкиТоваров,
	|	ИсточникДанных.ДатаПоступления               КАК Дата,
	|	ВЫБОР
	|		КОГДА ИсточникДанных.Порча
	|			ТОГДА ИсточникДанных.НоменклатураОприходование
	|		ИНАЧЕ ИсточникДанных.Номенклатура
	|	КОНЕЦ                                        КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ИсточникДанных.Порча
	|			ТОГДА ИсточникДанных.ХарактеристикаОприходование
	|		ИНАЧЕ ИсточникДанных.Характеристика
	|	КОНЕЦ                                        КАК Характеристика,
	|	ИсточникДанных.Назначение                    КАК Назначение,
	|	ИсточникДанных.СтатусУказанияСерий           КАК СтатусУказанияСерий,
	|	ИсточникДанных.Серия                         КАК Серия,
	|	ЛОЖЬ                                         КАК СверхЗаказа,
	|	ИсточникДанных.Ссылка.Склад                  КАК Склад,
	|	ИсточникДанных.Ссылка.Партнер                КАК Отправитель,
	|	ИсточникДанных.Ссылка.ХозяйственнаяОперация  КАК ХозяйственнаяОперация,
	|	ИсточникДанных.Количество                    КАК Количество,
	|	ЛОЖЬ                                         КАК ЭтоНакладная,
	|	ЛОЖЬ                                         КАК ПоступлениеПоЗаказам
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Ссылка В (&Ссылка)
	|	И НЕ ИсточникДанных.Отменено
	|	И ИсточникДанных.Ссылка.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22 
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))";

	ПараметрыМетода = СкладыСервер.ПараметрыМодульногоПроведения();
	ПараметрыМетода.ТребуетсяУчитыватьСерииКОформлениюНакладныхПоРаспоряжению = Истина;

	СкладыСервер.ЗапланироватьПоступлениеТоваровСНастройками(Запрос,
	ТекстыЗапроса,
	Регистры,
	ТекстЗапросаДокумента,
	ПараметрыМетода);

КонецПроцедуры

&ИзменениеИКонтроль("ЗапланироватьОтгрузкуТоваров")
Процедура гф_ЗапланироватьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры)

	ТекстЗапросаДанныхДокумента = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.Ссылка				КАК Ссылка,
	|	ТоварыДокумента.ДатаОтгрузки		КАК Период,
	|	ТоварыДокумента.Ссылка				КАК Заказ,
	|	НЕОПРЕДЕЛЕНО						КАК Накладная,
	|	ЛОЖЬ								КАК Исправление,
	|	НЕОПРЕДЕЛЕНО						КАК ИсправляемыйДокумент,
	|	ДанныеШапки.Партнер					КАК Получатель,
	|	ДанныеШапки.Склад					КАК Склад,
	|	ТоварыДокумента.Номенклатура		КАК Номенклатура,
	|	ТоварыДокумента.Характеристика		КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ТоварыДокумента.Обособленно
	|			ТОГДА ДанныеШапки.Назначение
	|		ИНАЧЕ &НазначениеПоУмолчанию
	|	КОНЕЦ								КАК Назначение,
	|	ТоварыДокумента.Серия				КАК Серия,
	|	ТоварыДокумента.СтатусУказанияСерий	КАК СтатусУказанияСерий,
	|	ТоварыДокумента.Количество			КАК Количество,
	|	ЛОЖЬ								КАК СверхЗаказа,
	|	ТоварыДокумента.Отменено			КАК Отменено,
	|	ЛОЖЬ								КАК ЭтоНакладная,
	|	ЛОЖЬ								КАК ОтгрузкаПоЗаказу
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ДанныеШапки
	|		ПО ТоварыДокумента.Ссылка = ДанныеШапки.Ссылка
	|
	|ГДЕ
	|	ТоварыДокумента.Ссылка В(&Ссылка)
	|	И НЕ ТоварыДокумента.Отменено
	|	И ДанныеШапки.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке),
	#Вставка
	// #wortmann { 
	// Добавление новых статусов отразилось на проведении документа 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee10d8f761b7e8
	// Галфинд_Домнышева 2023/06/22 
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован),
	|				ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК),
	// } #wortmann
	#КонецВставки
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена))
	|	И ТоварыДокумента.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|	И ТоварыДокумента.Количество <> 0";

	ТекстЗапросаДанныхДокумента = СтрЗаменить(ТекстЗапросаДанныхДокумента,
	"&НазначениеПоУмолчанию",
	"ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)");

	СкладыСервер.ЗапланироватьОтгрузкуТоваров(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаДанныхДокумента);

КонецПроцедуры

&ИзменениеИКонтроль("ДопустимыеСтатусыВводаНаОсновании")
Функция гф_ДопустимыеСтатусыВводаНаОсновании(ИмяДокумента, КВозврату, ИспользоватьРасширенныеВозможностиЗаказаКлиента)

	МассивДопустимыхСтатусов = Новый Массив;

	Если ИспользоватьРасширенныеВозможностиЗаказаКлиента = Неопределено Тогда
		ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	КонецЕсли;

	Если ИмяДокумента = "ПоступлениеТоваровОтХранителя" Тогда
		КВозврату = Истина;
	КонецЕсли;

	Если ИспользоватьРасширенныеВозможностиЗаказаКлиента Тогда
		Если КВозврату Тогда
			МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КВозврату);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
			МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению);
		Иначе
			Если КВозврату Тогда
				МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОбеспечению);
			КонецЕсли;
			МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.КОтгрузке);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыКлиентовБезПолнойОплаты")
			ИЛИ ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыКлиентовБезПолнойОтгрузки") Тогда
			МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.Выполнена);
		КонецЕсли;
		#Вставка
		// #wortmann { 
		// e1cib/data/Задача.ЗадачаИсполнителя?ref=8ea8b083fed1320811ee0b71b283bff1
		// Галфинд_Домнышева 2023/06/13 
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДСформирован);// Добавлено Галфинд_ДомнышеваКР_19_07_2023
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_УКДПодписан);// Добавлено Галфинд_ДомнышеваКР_20_06_2023
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены);
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаПереданаВРМК);
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ТоварПеремаркирован);
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_ЗаявкаОбработанаВРМК);// Добавлено Галфинд_ДомнышеваКР_30_06_2023
		// } #wortmann
		#КонецВставки
	Иначе
		МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.НеСогласована);
	КонецЕсли;

	Возврат МассивДопустимыхСтатусов;

КонецФункции

#КонецОбласти

#КонецЕсли



