#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ОбработкаПроверкиЗаполнения")
Процедура гф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// #wortmann {
	// #5.2.08
	// ID короба в строках обязательно к заполнению, если Склад.гф_ТоварыВКоробках = Истина
	// Галфинд Sakovich 2022/08/09
	лШаблонСообщения = НСтр("ru = 'В строке %НомерСтроки% списка ""Товары"" не заполнено значение ""ID короба"".'");
	лКлючДанных = ОбщегоНазначенияУТ.КлючДанныхДляСообщенияПользователю(ЭтотОбъект);
	Для каждого стрТовары Из Товары Цикл
		ТоварыВКоробах = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(стрТовары["Склад"], "гф_ТоварыВКоробках");
		Если ТоварыВКоробах = Истина И Не ЗначениеЗаполнено(стрТовары["гф_IDкороба"]) Тогда
			ТекстСообщения = СтрЗаменить(лШаблонСообщения, "%НомерСтроки%", стрТовары.НомерСтроки);
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", стрТовары.НомерСтроки, "гф_IDкороба");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, лКлючДанных, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	// } #wortmann
КонецПроцедуры

#КонецОбласти

#КонецЕсли