#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НеУчитыватьЛимиты(Команда)
	
	ПодтвердитьВыбор("НеУчитыватьЛимиты");
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ПодтвердитьВыбор("Отменить");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодтвердитьВыбор(Действие)
	
	СтруктураВозврата = Новый Структура("ДатаЦен,ПроцентСкидки");
	СтруктураВозврата.Вставить("Действие", Действие);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти