
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// #wortmann {
	// Галфинд Sakovich 2022/12/01
	гф_ДобавитьЭлементыФормы()	
	// } #wortmann
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_ДобавитьЭлементыФормы()

	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипТаблицаФормы = Тип("ТаблицаФормы");
	
	Команда = Команды.Добавить("гф_ОткрытьОбработкуЗаказовНаЭмиссиюПоПТУ");
	Команда.Заголовок = "Заказы на эмиссию кодов маркировки СУЗ по " +
	"поступлениям и заказам поставщику";
	Команда.Действие = "гф_ОткрытьОбработкуЗаказовНаЭмиссиюПоПТУ";
	
	НоваяКнопка = Элементы.Вставить("гф_КнопкаОткрытьОбработкуЗаказовНаЭмиссиюПоПТУ", 
		ТипКнопкаФормы,
		Элементы.ГруппаЗакупки);
	НоваяКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	НоваяКнопка.ИмяКоманды = "гф_ОткрытьОбработкуЗаказовНаЭмиссиюПоПТУ";
	НоваяКнопка.Шрифт = Новый Шрифт(, , Истина);
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура гф_ОткрытьОбработкуЗаказовНаЭмиссиюПоПТУ(Команда)
	ОткрытьФорму("Обработка.гф_ОбработкаЗаказовНаЭмиссиюКМ.Форма", ,
	ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

#КонецОбласти