#Область ПрограммныйИнтерфейс

Функция ДанныеЗаполненияПриходныйОрдерНаТовары(докПеремещение, ЗаполнениеПоКоробам = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка КАК ДокументОтгрузки,
	|	ПеремещениеТоваровТовары.Количество КАК Количество,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПеремещениеТоваровТовары.Назначение КАК Назначение,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК УпаковочныйЛист,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК УпаковочныйЛистРодитель,
	|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ЛОЖЬ КАК ЭтоУпаковочныйЛист
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО (ПеремещениеТоваровТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
	|			И (ПеремещениеТоваровТовары.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеТоваровгф_ТоварыВКоробах.Ссылка КАК ДокументОтгрузки,
	|	УпаковочныйЛистТовары.Количество КАК Количество,
	|	УпаковочныйЛистТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	УпаковочныйЛистТовары.Назначение КАК Назначение,
	|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
	|	УпаковочныйЛистТовары.Упаковка КАК Упаковка,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК УпаковочныйЛист,
	|	ПеремещениеТоваровгф_ТоварыВКоробах.УпаковочныйЛист КАК УпаковочныйЛистРодитель,
	|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ЛОЖЬ КАК ЭтоУпаковочныйЛист
	|ИЗ
	|	Документ.ПеремещениеТоваров.гф_ТоварыВКоробах КАК ПеремещениеТоваровгф_ТоварыВКоробах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|			ПО УпаковочныйЛистТовары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|				И УпаковочныйЛистТовары.Характеристика = ШтрихкодыНоменклатуры.Характеристика
	|		ПО ПеремещениеТоваровгф_ТоварыВКоробах.УпаковочныйЛист = УпаковочныйЛистТовары.Ссылка
	|ГДЕ
	|	ПеремещениеТоваровгф_ТоварыВКоробах.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоУпаковок)
	|ПО
	|	УпаковочныйЛистРодитель";
	
	Запрос.УстановитьПараметр("Ссылка", докПеремещение);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если ЗаполнениеПоКоробам Тогда
		Возврат МассивРезультатов[1];
	Иначе
		Возврат МассивРезультатов[0];
	КонецЕсли;
	
КонецФункции

Функция ДанныеЗаполненияРасходныОрдерйНаТовары(
	докПеремещение, 
	Действие, 
	ЗаполнениеПоКоробам = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
	|	ПеремещениеТоваровТовары.Назначение КАК Назначение,
	|	ЛОЖЬ КАК ЭтоУпаковочныйЛист,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК УпаковочныйЛистРодитель,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК УпаковочныйЛист,
	|	ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
	|	ПеремещениеТоваровТовары.Количество КАК Количество,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	&Действие КАК Действие
	|
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|	;
	|	/////////////////
	|	 ВЫБРАТЬ
	|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
	|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
	|	УпаковочныйЛистТовары.Назначение КАК Назначение,
	|	ЛОЖЬ КАК ЭтоУпаковочныйЛист,
	|	УпаковочныйЛистТовары.Ссылка КАК УпаковочныйЛистРодитель,
	|	ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка) КАК УпаковочныйЛист,
	|	УпаковочныйЛистТовары.Упаковка КАК Упаковка,
	|    УпаковочныйЛистТовары.Количество КАК Количество,
	|	УпаковочныйЛистТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|    &Действие КАК Действие
	|ИЗ
	|	Документ.ПеремещениеТоваров.гф_ТоварыВКоробах КАК ПеремещениеТоваровгф_ТоварыВКоробах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
	|		ПО (ПеремещениеТоваровгф_ТоварыВКоробах.УпаковочныйЛист = УпаковочныйЛистТовары.Ссылка)
	|ГДЕ
	|	ПеремещениеТоваровгф_ТоварыВКоробах.Ссылка = &Ссылка
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоУпаковок)
	|ПО
	|	УпаковочныйЛистРодитель";
	
	Запрос.УстановитьПараметр("Ссылка", докПеремещение);
	Запрос.УстановитьПараметр("Действие", Действие);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Если ЗаполнениеПоКоробам Тогда
		Возврат МассивРезультатов[1];
	Иначе
		Возврат МассивРезультатов[0];
	КонецЕсли;
	
КонецФункции

#КонецОбласти