
&НаКлиенте
Процедура Выбрать(Команда)
	
	ТабДокумент = ВывестиВОбщуюФормуПечатьДокументовНаСервере();    
    КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
    ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Макет");
    ПечатнаяФорма.СинонимМакета = "Макет";
    ПечатнаяФорма.ТабличныйДокумент = ТабДокумент;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Макет";
    
    ОбластиОбъектов = Новый СписокЗначений;
    УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
    ТабДокумент.Показать();
    
КонецПроцедуры

&НаСервере
Функция ВывестиВОбщуюФормуПечатьДокументовНаСервере()
	
	//ТабДокумент = Новый ТабличныйДокумент;
	//Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ДанныеУпаковочныхЛистов");
	//
	//ОблШапка = Макет.ПолучитьОбласть("Шапка");
	//ТабДокумент.Вывести(ОблШапка);
	//Возврат ТабДокумент;
	
	//Возврат Макет; 
КонецФункции