
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Галфинд_ДомнышеваКР_29_01_2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eebaa71ff8e54c
	Если Параметры.Свойство("Объект") Тогда

        СписокДокументов = Параметры.Объект;

        НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
        НовыйЭлемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
        НовыйЭлемент.ПравоеЗначение   = СписокДокументов;
        НовыйЭлемент.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;

	КонецЕсли;
    // -- Галфинд_ДомнышеваКР_29_01_2024
КонецПроцедуры
