#Область СлужебныеПроцедурыИФункции

Функция флСоздатьМаркировкаТоваровИСМП(Склад, Договор) Экспорт
	// СадомцевСА 07.12.2023 Задача e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee92d1eb947016
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee92d1eb947016
	// Перенес код для определения "требуется/НЕ требуется создание Маркировки товаров ИСМП" в общий модуль
	// Документ требуется создавать только при одновременном выполнении условий:
	// 1) Cклад отгрузки в РТУ имеет признак "Товары в коробах"=Да
	// 2) Договор в РТУ имеет признак "Отгрузка кодов маркировки парами"=Нет
	// 3) Договор в РТУ имеет признак "Первичные документы в коробах"=Да
	// Используется при проведении РТУ и Расх. ордера в статусе "К отгрузке"
	флТоварыВКоробах = УправлениеСвойствами.ЗначениеСвойства(Склад, "гф_СкладыТоварыВКоробах"); 
	Если Не флТоварыВКоробах = Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	флОтгрузкаПарами = УправлениеСвойствами.ЗначениеСвойства(Договор, "гф_ДоговорыКонтрагентовОтгрузкаКодовМаркировкиПарами"); 
	Если флОтгрузкаПарами = Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	флПервичныеДокументыВКоробах = УправлениеСвойствами.ЗначениеСвойства(Договор, "гф_ДоговорыКонтрагентовПервичныеДокументыВКоробах");
	Если Не флПервичныеДокументыВКоробах = Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

#КонецОбласти
