
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// ++ Галфинд СадомцевСА 05.12.2023 Реализовал отбор документов РТУ
	// НЕ добавлять РТУ, у которых реквизит "Маркируемая продукция" ="Не выбывает из оборота".
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee92a2360bcf4a
	МассивРТУ = ИнтеграцияИС.гф_ПолучитьМассивРТУ();
	ЭО = СписокКОформлению.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументОснование");
	ЭО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭО.ПравоеЗначение = МассивРТУ;	
	// -- Галфинд СадомцевСА 05.12.2023
КонецПроцедуры
