// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Возвращает выбранное значение команды на форму владельца 
// Галфинд_Домнышева 2023/07/17 
&НаКлиенте
Процедура ОбработчикКоманд(Команда)
	
	ВыбраннаяКоманда = Новый Структура;
	
	Если Команда = ЭтотОбъект.Команды.ОтменитьДействия Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "ОтменитьДействия");
		
	ИначеЕсли Команда = ЭтотОбъект.Команды.НачатьЗаново Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "НачатьЗаново");
		
	ИначеЕсли Команда = ЭтотОбъект.Команды.РаспечататьНеподтвержденные Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "РаспечататьНеподтвержденные");

	ИначеЕсли Команда = ЭтотОбъект.Команды.ПодтвердитьНеподтверждённые Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "ПодтвердитьНеподтверждённые");

	ИначеЕсли Команда = ЭтотОбъект.Команды.ПовторитьПечать Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "ПовторитьПечать");
	
	ИначеЕсли Команда = ЭтотОбъект.Команды.ПродолжитьПечать Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "ПродолжитьПечать");
	
	ИначеЕсли Команда = ЭтотОбъект.Команды.ПодтвердитьРаспечатанные Тогда
		
		ВыбраннаяКоманда.Вставить("Команда", "ПодтвердитьРаспечатанные");
		
	Иначе       
		
		Возврат;
		
	КонецЕсли;		
		
	Закрыть(ВыбраннаяКоманда); 

КонецПроцедуры// } #wortmann

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
	// Определяем видимость определенных команд в зависимости от места вызова формы. 
	// Галфинд_Домнышева 2023/07/17
	Если Параметры.Значение = "2" Тогда
		ЭтотОбъект.Элементы.ПодтвердитьНеподтверждённые.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Значение = "5" Тогда 
		ЭтотОбъект.Элементы.ГруппаКоманд1.Видимость = Ложь;
		ЭтотОбъект.Элементы.ГруппаКоманд2.Видимость = Истина;
	КонецЕсли;
	
	Если Параметры.Значение = "10" Тогда
		ЭтотОбъект.Элементы.ГруппаКоманд1.Видимость = Ложь;
		ЭтотОбъект.Элементы.ГруппаКоманд2.Видимость = Ложь;
		ЭтотОбъект.Элементы.ГруппаКоманд3.Видимость = Истина;

	КонецЕсли;
	// } #wortmann
	
КонецПроцедуры
