
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	гф_СоздатьНовыеРеквизиты();
	
КонецПроцедуры  

&НаКлиенте
Процедура гф_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.гф_АдресаДоставки.Форма.ФормаВыбора" Тогда
		
		Адрес =  ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "Адрес");
		АдресЗначение = ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "Значение");
		АдресЗначенияПолей = " ";
		
		ИмяРеквизитаАдресаДоставки = ДоставкаТоваровКлиентСервер.ПолучитьИмяРеквизитаАдресаДоставки(ТекущийЭлемент);
		
		Объект[ИмяРеквизитаАдресаДоставки] = Адрес;
		Объект[ИмяРеквизитаАдресаДоставки+ "Значение"] = АдресЗначение;
		Объект[ИмяРеквизитаАдресаДоставки+ "ЗначенияПолей"] = АдресЗначенияПолей;
				
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("АдресДоставкиНачалоВыбора")
Процедура гф_АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    #Вставка
	СтандартнаяОбработка = Ложь;

	ИмяРеквизитаАдресаДоставки = ДоставкаТоваровКлиентСервер.ПолучитьИмяРеквизитаАдресаДоставки(ТекущийЭлемент);
	
	ПараметрыФормы = Новый Структура;
	
	Если ИмяРеквизитаАдресаДоставки = "АдресДоставкиПеревозчика" Тогда
		
		КонтрагентПеревозчик = ПартнерыИКонтрагентыВызовСервера.КонтрагентПартнера(Объект.ПеревозчикПартнер); 
		ЗначениеОтбора = Новый Структура("Владелец", КонтрагентПеревозчик);		
		ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);		
		
	Иначе
		ЗначениеОтбора = Новый Структура("Владелец", Объект.Контрагент);
		ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
	    	
	КонецЕсли;	
		
	ОткрытьФорму("Справочник.гф_АдресаДоставки.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	Возврат;
	
	#КонецВставки
	ИмяРеквизитаАдресаДоставки = ДоставкаТоваровКлиентСервер.ПолучитьИмяРеквизитаАдресаДоставки(Элемент);

	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	Элемент,
	Объект,
	ИмяРеквизитаАдресаДоставки,
	СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_СоздатьНовыеРеквизиты()
	
	КвалификаторыСтроки	= Новый КвалификаторыСтроки(256);
	КвалификаторыДаты 	= Новый КвалификаторыДаты(ЧастиДаты.Дата);	
	
	ОписаниеТиповСтатусДокумента		= Новый ОписаниеТипов("ПеречислениеСсылка.гф_СтатусРаботыСЗаказомИ5");
	ОписаниеТиповСтрока 				= Новый ОписаниеТипов("Строка", , КвалификаторыСтроки); 
	ОписаниеТиповДата 	 				= Новый ОписаниеТипов("Дата", , , , , КвалификаторыДаты);
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитФормы_гф_СтатусДокумента		= Новый РеквизитФормы("гф_СтатусДокумента",
										ОписаниеТиповСтатусДокумента, , "Статус документа", Истина);

	РеквизитФормы_гф_ИмяЗаказа				= Новый РеквизитФормы("гф_ИмяЗаказа",
										ОписаниеТиповСтрока, , "Имя заказа", Истина);

	РеквизитФормы_гф_ДатаОбновленияИзИ5		= Новый РеквизитФормы("гф_ДатаОбновленияИзИ5",
										ОписаниеТиповДата, , "Дата обновления из i5", Истина);									
    										
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_СтатусДокумента); 
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_ИмяЗаказа);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_ДатаОбновленияИзИ5);
		
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ТипПолеФормы = Тип("ПолеФормы");
	
	НовоеПоле = Элементы.Добавить("гф_СтатусДокумента", ТипПолеФормы,
										Элементы.ГруппаПараметрыПраво);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;	
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_СтатусРаботыСЗаказомИ5";
	
	НовоеПоле = Элементы.Добавить("гф_ИмяЗаказа", ТипПолеФормы,
										Элементы.ГруппаШапка);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;	
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_ИмяЗаказа"; 
	
	НовоеПоле = Элементы.Добавить("гф_ДатаОбновленияИзИ5", ТипПолеФормы,
										Элементы.ГруппаПараметрыПраво);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;	
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_ДатаОбновленияИзИ5";
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);

КонецФункции	

#КонецОбласти   
