
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("ОбъектыНазначения", ОбъектыНазначения);
	ОткрытьФорму("Обработка.гф_ЗагрузкаДанныхИзТабличногоДокумента_WMN.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//ОткрытьФорму(
	//	"Обработка.гф_ЗагрузкаФайловИзПочты.Форма.Форма",
	//	Новый Структура,
	//	ПараметрыВыполненияКоманды.Источник,
	//	"Обработка.гф_ЗагрузкаФайловИзПочты.Форма.Форма" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""),
	//	ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
