#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// #wortmann {
// #4.2.03
// Создание группы досупа и её установка в партнере 
// Галфинд Окунев 2022/07/05
// Параметры:
// Отказ - параметр вызова события ПередЗаписью
&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Ссылка.Пустая() И ЗначениеЗаполнено(Партнер) Тогда
		
		Если Не ЗначениеЗаполнено(Партнер.ГруппаДоступа) Тогда
		
			ГруппаДоступа = Справочники.ГруппыДоступаПартнеров.СоздатьЭлемент();
		
			ГруппаДоступа.Наименование = СокрЛП(Партнер.Наименование) + " " + СокрЛП(ИНН);
			
			ГруппаДоступа.Записать();
			
			ПартнерОбъект = Партнер.ПолучитьОбъект();
			
			Если  ПартнерОбъект <> Неопределено Тогда
				
				ПартнерОбъект.ГруппаДоступа = ГруппаДоступа.Ссылка;  
				
				ПартнерОбъект.ОбменДанными.Загрузка = Истина;
				
				ПартнерОбъект.Записать();
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	
КонецПроцедуры// } #wortmann
#КонецОбласти
#КонецЕсли