
&НаКлиенте
Процедура Проверить(Команда)
	Объект.НеЗаказано.Очистить();
	Объект.СозданныеДокументы.Очистить();
	ПроверитьНаСервере();
	Если Объект.НеЗаказано.Количество() = 0 Тогда
		ТекстСообщения = "Количество заказанной номенклатуры совпадает с номенклатурой в ПТиУ";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Дозаказать(Команда)
	ДозаказатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьОстаткиКЗаказу();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Элементы.ФормаДозаказать.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

&НаСервере
Процедура ДозаказатьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДозаказатьНоменклатуру();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	Для Каждого СтрокаД Из Объект.НеЗаказано Цикл
		ИД = СтрокаД.ПолучитьИдентификатор();
		Если Элементы.НеЗаказано.ПроверитьСтроку(ИД) Тогда
			СтрокаД.Отметка = Истина;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	Для Каждого СтрокаД Из Объект.НеЗаказано Цикл
		ИД = СтрокаД.ПолучитьИдентификатор();
		Если Элементы.НеЗаказано.ПроверитьСтроку(ИД) Тогда
			СтрокаД.Отметка = Ложь;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НеЗаказаноПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НеЗаказаноПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СозданныеДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СозданныеДокументыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
