
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// ++ Галфинд_ДомнышеваКР_06_12_2023
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee9062a7e31a79
	ДобавитьНовыеЭлементы();
	// -- Галфинд_ДомнышеваКР_06_12_2023
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	
	ТипДекорацияФормы = Тип("ДекорацияТекстФормы");
	ТипПолеФормы = Тип("ПолеФормы");
	ТипТаблицаФормы = Тип("ТаблицаФормы");
	
	ТаблицаФормы = Элементы.Вставить("гф_НастройкиЗаполненияПодразделений", ТипТаблицаФормы, Элементы.ГруппаМеждународныйУчет);
	ТаблицаФормы.ПутьКДанным = "Объект.гф_НастройкиЗаполненияПодразделений";
	ТаблицаФормы.Высота = 2;
	ТаблицаФормы.Заголовок = "Заполнение подразделений";
	ТаблицаФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	ТаблицаФормы.ЦветТекстаЗаголовка = Новый Цвет(0, 200, 0);

	НовыйЭлемент  = Элементы.Добавить("гф_НастройкиЗаполненияПодразделенийПодразделение", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_НастройкиЗаполненияПодразделений.Подразделение";

	//НовыйЭлемент  = Элементы.Добавить("гф_НастройкиЗаполненияПодразделенийЗаполнятьИзИсточника", ТипПолеФормы, ТаблицаФормы);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	//НовыйЭлемент.ПутьКДанным = "Объект.гф_НастройкиЗаполненияПодразделений.ЗаполнятьИзИсточника";
	
	НовыйЭлемент  = Элементы.Добавить("гф_НастройкиЗаполненияПодразделенийУказанноеЗначение", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_НастройкиЗаполненияПодразделений.УказанноеЗначение";
	 	
КонецПроцедуры