Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Наименование = "Статусы GTIN в документах ПТУ (гф)";
	ПараметрыРегистрации.Версия = "1.0";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = "Отчет показывает статусы штрихкодов номенклатуры (GTIN), находящейся в табличной части «Товары» документа «Приобретение товаров и услуг»"; 
	
    Возврат ПараметрыРегистрации;
	
КонецФункции

