
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомандыПечати = УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(Метаданные.Документы["СчетНаОплатуКлиенту"]);
	мПечатныеФормы = Новый Массив;	
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		Если Не ЗначениеЗаполнено(КомандаПечати.Обработчик) Тогда
			мПечатныеФормы.Добавить(КомандаПечати.Представление);
		КонецЕсли;
	КонецЦикла;
	Элементы.ПечатнаяФорма.СписокВыбора.ЗагрузитьЗначения(мПечатныеФормы);
	
	гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя = 
		_омОбщегоНазначенияВызовСервера.ПолучитьГлобальноеЗначение("гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя");
	Если гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не найдено глобальное значение по ключу <гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя>!";
		Сообщение.Сообщить();
		Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСохранить.Доступность = Ложь;
		Элементы.ПечатнаяФорма.Доступность = Ложь;
	Иначе
		ПечатнаяФорма = гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если ЗначениеЗаполнено(ПечатнаяФорма) Тогда
		СохранитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	ГлобЗначСсылка = ПланыВидовХарактеристик.гф_ГлобальныеЗначения.НайтиПоРеквизиту("Ключ", "гф_ПечатнаяФормаСчетаДляСпецификацииПокупателя");
	Если ЗначениеЗаполнено(ГлобЗначСсылка) Тогда
		ГлобЗначОбъект = ГлобЗначСсылка.ПолучитьОбъект();
		ГлобЗначОбъект.Значение = ПечатнаяФорма;
		ГлобЗначОбъект.Записать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выбранное значение сохранено!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры