
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
// #wortmann {
// Добавление новых полей на форму	
// Галфинд Плотников 2022/07/22
	гф_ДобавитьНовыеРеквизиты();
// } #wortmann
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервере
// #wortmann {
// Добавление новых полей на форму	
// Галфинд Плотников 2022/07/22
Процедура гф_ДобавитьНовыеРеквизиты()
	
	ТипГруппаФормы	= Тип("ГруппаФормы");
	ТипПолеФормы	= Тип("ПолеФормы");
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаШапкаЧетвертаяЛиния", ТипГруппаФормы);

	НовыйЭлемент.Вид						= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение				= ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок		= Ложь; 
	НовыйЭлемент.Группировка				= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина						= 0;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Неопределено;
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаШапкаЧетвертаяЛиния, ЭтотОбъект.Элементы.ГруппаШапка);
	
	КС	= Новый КвалификаторыСтроки(256);
	КЧ	= Новый КвалификаторыЧисла(10,3);
	
	ОписаниеТиповСтрока 			= Новый ОписаниеТипов("Строка", , КС);
	ОписаниеТиповЧисло 				= Новый ОписаниеТипов("Число", , КЧ);

	НовыеРеквизиты = Новый Массив;
	
	РеквизитФормы_гф_Штрихкод			= Новый РеквизитФормы("гф_Штрихкод",
										ОписаниеТиповСтрока, , "Штрихкод (EAN)", Истина);

	РеквизитФормы_гф_ВесКороба			= Новый РеквизитФормы("гф_ВесКороба",
										ОписаниеТиповЧисло, , "Вес короба (кг)", Истина);	
										
	РеквизитФормы_гф_ДлинаКороба		= Новый РеквизитФормы("гф_ДлинаКороба",
										ОписаниеТиповЧисло, , "Длина короба (м)", Истина);	

	РеквизитФормы_гф_ШиринаКороба		= Новый РеквизитФормы("гф_ШиринаКороба",
										ОписаниеТиповЧисло, , "Ширина короба (м)", Истина);	
										
	РеквизитФормы_гф_ВысотаКороба		= Новый РеквизитФормы("гф_ВысотаКороба",
										ОписаниеТиповЧисло, , "Высота короба (м)", Истина);	
										
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_Штрихкод);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_ВесКороба);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_ДлинаКороба);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_ШиринаКороба);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_ВысотаКороба);
	
	ИзменитьРеквизиты(НовыеРеквизиты);

	НовыйЭлемент = Элементы.Добавить("гф_Штрихкод", ТипПолеФормы,
										Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
	
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 10;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_Штрихкод";
									
	НовыйЭлемент = Элементы.Добавить("гф_ВесКороба", ТипПолеФормы,
										Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
									
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 5;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_ВесКороба";
	
	НовыйЭлемент = Элементы.Добавить("гф_ДлинаКороба", ТипПолеФормы,
										Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
									
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 5;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_ДлинаКороба";

	НовыйЭлемент = Элементы.Добавить("гф_ШиринаКороба", ТипПолеФормы,
										Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
									
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 5;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_ШиринаКороба";

	НовыйЭлемент = Элементы.Добавить("гф_ВысотаКороба", ТипПолеФормы,
										Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
									
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 5;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_ВысотаКороба";
	
КонецПроцедуры	
// } #wortmann

#КонецОбласти      

