
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	//ЗаполнитьСписокВыбораАдреса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура гф_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	ОчиститьРеквизитыПриИзмененииХозОперации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьРеквизитыПриИзмененииХозОперации()
	
	Если Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию Тогда
		 Объект.гф_Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		 Объект.гф_АдресДоставки = Справочники.гф_АдресаДоставки.ПустаяСсылка();		 
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьИДоступностьРеквизитов()
	
	Элементы.гф_Контрагент.Видимость = Объект.ХозяйственнаяОперация = 
										Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	Элементы.гф_АдресДоставки.Видимость = Объект.ХозяйственнаяОперация = 
										Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;	
	
КонецПроцедуры	 
									
&НаКлиенте
Процедура гф_гф_КонтрагентПриИзмененииПосле(Элемент)
	
	//КонтрагентПриИзмененииСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервере() 
	
	//Объект.гф_АдресДоставки = ""; 
	//ЗаполнитьСписокВыбораАдреса();	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокВыбораАдреса()
	
	//ЭлементАдресДоставки = Элементы.гф_АдресДоставки;
	//Контрагент = Объект.гф_Контрагент;
	//ПродажиСервер.ЗаполнитьСписокВыбораАдреса(ЭлементАдресДоставки, Контрагент,	Истина, ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти