
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	гф_СоздатьНовыеРеквизиты();
	УстановитьВидимостьИДоступностьРеквизитов();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура гф_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	ОчиститьРеквизитыПриИзмененииХозОперации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОчиститьРеквизитыПриИзмененииХозОперации()
	
	Если Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию Тогда
		 Объект.гф_Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		 Объект.гф_АдресДоставки = Справочники.гф_АдресаДоставки.ПустаяСсылка();		 
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьИДоступностьРеквизитов()
	
	Элементы.гф_Контрагент.Видимость = Объект.ХозяйственнаяОперация = 
										Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	Элементы.гф_АдресДоставки.Видимость = Объект.ХозяйственнаяОперация = 
										Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;	
	
КонецПроцедуры	 

&НаСервере
Процедура гф_СоздатьНовыеРеквизиты()
	
	КвалификаторыСтроки	= Новый КвалификаторыСтроки(256);
	
	//ОписаниеТиповОрганизация		= Новый ОписаниеТипов("СправочникСсылка.Организации");
	ОписаниеТиповКонтрагенты		= Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ОписаниеТиповАдресаДоставки		= Новый ОписаниеТипов("СправочникСсылка.гф_АдресаДоставки");
	
	//ОписаниеТиповБулево				= Новый ОписаниеТипов("Булево");
	//ОписаниеТиповСтрока 			= Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);

	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитФормы_гф_Контрагент			= Новый РеквизитФормы("гф_Контрагент",
										ОписаниеТиповКонтрагенты, , "Контрагент", Истина);

	РеквизитФормы_гф_АдресаДоставки			= Новый РеквизитФормы("гф_АдресДоставки",
										ОписаниеТиповАдресаДоставки, , "Адрес доставки", Истина);	
										
	//РеквизитФормы_гф_БезРезерва			= Новый РеквизитФормы("гф_БезРезерва",
	//									ОписаниеТиповБулево, ,"Без резерва", Истина);	
	//									
	//РеквизитФормы_гф_Комментарий		= Новый РеквизитФормы("гф_Комментарий",
	//									ОписаниеТиповСтрока, ,"Комментарий", Истина);
										
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_Контрагент);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_АдресаДоставки);
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_БезРезерва);
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_Комментарий);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ТипПолеФормы = Тип("ПолеФормы");
	
	//НовоеПоле = Элементы.Добавить("гф_Организация", ТипПолеФормы,
	//									Элементы.ОсновноеПраво);
	//
	//НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	//НовоеПоле.АвтоОтметкаНезаполненного = Истина;
	//НовоеПоле.Видимость		= Истина;
	//НовоеПоле.ПутьКДанным	= "Объект.гф_Организация";
	
	НовоеПоле = Элементы.Добавить("гф_Контрагент", ТипПолеФормы,
										Элементы.ГруппаДополнительно);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_Контрагент"; 
	
		
	НовоеПоле = Элементы.Добавить("гф_АдресДоставки", ТипПолеФормы,
										Элементы.ГруппаДополнительно);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеФлажка;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_АдресДоставки"; 
	
	//НовоеПоле = Элементы.Добавить("гф_Комментарий", ТипПолеФормы);
	//
	//НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	//НовоеПоле.Видимость		= Истина;
	//НовоеПоле.ПутьКДанным	= "Объект.гф_Комментарий";
	
КонецПроцедуры	


#КонецОбласти