
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура гф_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьРеквизитов()
	
	Элементы.гф_Контрагент.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
		
КонецПроцедуры	

