
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	ПродажиСервер.ЗаполнитьСписокВыбораАдреса(Элементы.гф_АдресДоставки, Объект.гф_Контрагент,Истина,ТекущаяДатаСеанса()); 
	
КонецПроцедуры

&НаКлиенте
Процедура гф_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	
	УстановитьВидимостьИДоступностьРеквизитов();
	ОчиститьРеквизитыПриИзмененииХозОперации();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыПриИзмененииХозОперации()
	
	Если Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию Тогда
		 Объект.гф_Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		 Объект.гф_АдресДоставки = "";
		 Элементы.гф_АдресДоставки.СписокВыбора.Очистить();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьИДоступностьРеквизитов()
	
	Элементы.гф_Контрагент.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	Элементы.гф_АдресДоставки.Видимость = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;	
	
КонецПроцедуры	


&НаКлиенте
Процедура гф_гф_КонтрагентПриИзмененииПосле(Элемент)
	
	КонтрагентПриИзмененииСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервере() 
	
	Объект.гф_АдресДоставки = "";
	ПродажиСервер.ЗаполнитьСписокВыбораАдреса(Элементы.гф_АдресДоставки, Объект.гф_Контрагент,Истина,ТекущаяДатаСеанса());
	
КонецПроцедуры	
