
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

&Вместо("ОчисткаПулаКодовМаркировкиПоЗаказуНаЭмиссию")
Процедура гф_ОчисткаПулаКодовМаркировкиПоЗаказуНаЭмиссию(ЗаказНаЭмиссию, ИдентификаторЗаказаСУЗ)
	// Галфинд \ Sakovich 05.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eed60674c62e29
	// не используем
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Вместо("ОчисткаПулаКодовМаркировкиПоОтчетуОНанесении")
Процедура гф_ОчисткаПулаКодовМаркировкиПоОтчетуОНанесении(КодыМаркировки)
	// Галфинд \ Sakovich 05.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eed60674c62e29
	// не используем
	Возврат;
КонецПроцедуры

&Вместо("УдалениеНеиспользованныхКодовМаркировки")
Процедура гф_УдалениеНеиспользованныхКодовМаркировки()
	// Галфинд \ Sakovich 05.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eed60674c62e29
	// не используем
	Возврат;
КонецПроцедуры

&Вместо("ОчисткаПулаКодовМаркировки")
Процедура гф_ОчисткаПулаКодовМаркировки()
	// Галфинд \ Sakovich 05.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eed60674c62e29
	// используем
	ПродолжитьВызов();
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли