#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отменить(Команда)
	
	ПодтвердитьВыбор("Отменить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПеремещение(Команда)
	
	Если ЗначениеЗаполнено(Склад) Тогда
	
		ПодтвердитьВыбор("Перемещение");
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не указан склад! '");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодтвердитьВыбор(Действие)
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Действие", 		Действие);
	СтруктураВозврата.Вставить("Склад", 		Склад);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти