
// #wortmann { 
// #2.3.09
// Добавление команды и кнопки Сформировать строки перевода
// XYZ Юрий 2022/09/20
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("гф_СформироватьСтрокиПеревода");
	НоваяКоманда.Действие = "гф_СформироватьСтрокиПеревода";
	НоваяКоманда.Заголовок = "Сформировать строки перевода";
	
	НоваяКнопка = ЭтаФорма.Элементы.Вставить("гф_ФормаСформироватьСтрокиПеревода", Тип("КнопкаФормы"),ЭтаФорма.КоманднаяПанель, ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы[2]);
	НоваяКнопка.ИмяКоманды = "гф_СформироватьСтрокиПеревода";
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #2.3.09
// Добавление процедуры для кнопки "Сформировать строки перевода"
// XYZ Юрий 2022/09/20
&НаКлиенте
Процедура гф_СформироватьСтрокиПеревода(Команда)
	
	П = Новый Структура;
	П.Вставить("МассивНоменклатур", МассивНоменклатур());
	П.Вставить("ЯзыкПеревода", ПредопределенноеЗначение("Справочник.гф_ВидыЯзыков.Russian"));
	П.Вставить("ТолькоБезПеревода", ИСТИНА);
		
	Если МассивНоменклатур() = Неопределено Тогда
		Сообщить("Список товаров пуст!");	
	ИначеЕсли МассивНоменклатур().Количество() > 0 Тогда
		ОткрытьФорму("Обработка.гф_ДиспетчерПереводов.Форма.ФормаПереводаОбъектов", П, ЭтаФорма);
	Иначе
		Сообщить("Отсутствуют выбранные товары или товары подходящие для перевода!");
	КонецЕсли;
		
КонецПроцедуры // } #wortmann

// #wortmann {
// #2.3.09
// Для кнопки "Сформировать строки перевода"
// XYZ Юрий 2022/09/20
&НаСервере
Функция МассивНоменклатур()
	
	мТовары = Новый Массив;
	
	Если Объект.Товары.Количество() = 0 тогда	
		Возврат Неопределено;
	КонецЕсли;
	
	Для каждого Товар Из Объект.Товары  Цикл
		
		Если Товар.Выбран Тогда	
		    Если ИскатьПереводы(Товар.Номенклатура) Тогда
				мТовары.Добавить(Товар.Номенклатура);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат мТовары;

КонецФункции // } #wortmann

// #wortmann {
// #2.3.09
// Для кнопки "Сформировать строки перевода"
// XYZ Юрий 2022/09/20
&НаСервере
Функция ИскатьПереводы(Номенклатура)
	
	Запрос = новый Запрос(
	"ВЫБРАТЬ
	|	а.Объект КАК Объект,
	|	а.Свойство КАК Свойство,
	|	а.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК а
	|ГДЕ
	|	а.Объект = &Объект
	|	И а.Свойство = &Свойство");
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("имя", "гф_НоменклатураДатаОбновленияНоменклатурыИзI5"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции // } #wortmann 



