Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД(Черновик)") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УПД(Черновик)",
		НСтр("ru = 'Универсальный передаточный документ (УПД)(Черновик)';
		|en = 'Universal transfer document (UTD)'"),
		СформироватьПечатнуюФормуУПДЧерновик(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, СтруктураТипов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуУПДЧерновик(СтруктураТипов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	МакетОбработки = ПолучитьМакет("ПФ_MXL_УПД_Черновик");
	
	МассивДок = Новый Массив;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДок, СтруктураОбъектов.Значение);
	
    КонецЦикла; 

    //Сообщить("Создан ЧЕРНОВИК. Планируемая поставка");

	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьЗаголовкаТаблицы = МакетОбработки.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрокаКомплектующие = МакетОбработки.ПолучитьОбласть("СтрокаКомплектующие");
	ОбластьСтрокаНабор = МакетОбработки.ПолучитьОбласть("СтрокаНабор");
	ОбластьСтрока = МакетОбработки.ПолучитьОбласть("Строка");
	ОбластьИтого = МакетОбработки.ПолучитьОбласть("Итого");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	ОбластьНумерацияЛистов = МакетОбработки.ПолучитьОбласть("НумерацияЛистов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Автор КАК Автор,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.Руководитель КАК Руководитель,
	|	РеализацияТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		СуммаСНДС КАК СуммаСНДС
	|	) КАК Товары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Имя";
	
	Запрос.Параметры.Вставить("Имя",МассивДок[0].Ссылка);
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	//НомерДок = Прав(Таб[0].Номер, 6);
	//
	//НомерБезНулей = НомерДок;
	//   Пока Найти(НомерБезНулей,"0") = 1 Цикл
	//            НомерБезНулей = Сред(НомерБезНулей,2); //удаляет лидирующие нули
	//   КонецЦикла;
	   
	//ОбластьШапка.Параметры.Номер = НомерБезНулей;
	ОбластьШапка.Параметры.Дата = Формат(Таб[0].Дата, "ДЛФ=DD");
	ОбластьШапка.Параметры.ПредставлениеПоставщика = Таб[0].Организация;
	ОбластьШапка.Параметры.ПредставлениеПокупателя = Таб[0].Партнер.НаименованиеПолное;
	ПеремКодВалюты = Таб[0].Валюта.Код;
	ПеремВалюта = Таб[0].Валюта;
	ПеремВалютаЗнач = Строка(ПеремКодВалюты);
	ПеремВалютаЗначКод = Строка(ПеремВалюта);
	ОбластьШапка.Параметры.Валюта = ПеремВалютаЗначКод + ", " + ПеремВалютаЗнач;
	ОбластьШапка.Параметры.ИННПоставщика = Таб[0].Организация.ИНН + "/" + Таб[0].Организация.КПП;
	ОбластьШапка.Параметры.ПредставлениеГрузополучателя = Таб[0].Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.ИННПокупателя = Таб[0].Контрагент.ИНН + "/" + Таб[0].Контрагент.КПП;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовкаТаблицы);
	
	СуммаВсего = 0; 
	СуммаВсегоСНДС = 0;
	СуммаВсегоНДС = 0;
	СуммаВсегоБезНДС = 0;
	
	Для Каждого Стр Из Таб[0].Товары Цикл
		
		ОбластьСтрокаКомплектующие.Параметры.ПредставлениеНоменклатуры = Таб[0].Товары[0].Номенклатура.Наименование;
		ОбластьСтрокаКомплектующие.Параметры.Цена = Таб[0].Товары[0].Цена;
		ОбластьСтрокаКомплектующие.Параметры.Количество = Таб[0].Товары[0].Количество;
		ОбластьСтрокаКомплектующие.Параметры.СтавкаНДС = Таб[0].Товары[0].СтавкаНДС;
		ОбластьСтрокаКомплектующие.Параметры.СуммаНДС = Таб[0].Товары[0].СуммаНДС;
		ОбластьСтрокаКомплектующие.Параметры.СуммаСНДС = Таб[0].Товары[0].СуммаСНДС;
		
		СуммаБезНДС = (Таб[0].Товары[0].СуммаСНДС - Таб[0].Товары[0].СуммаНДС) * Таб[0].Товары[0].Количество; 
		ОбластьСтрокаКомплектующие.Параметры.СуммаБезНДС = СуммаБезНДС;
		СуммаВсегоБезНДС = СуммаВсегоБезНДС + СуммаБезНДС;
		СуммаВсего = СуммаВсего + Таб[0].Товары[0].СуммаСНДС;
		СуммаВсегоСНДС = СуммаВсегоСНДС + Таб[0].Товары[0].СуммаСНДС; 
		СуммаВсегоНДС = СуммаВсегоНДС + Таб[0].Товары[0].СуммаНДС;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаКомплектующие);
		
	КонецЦикла;
	
	ОбластьИтого.Параметры.ИтогоСуммаБезНДС = СуммаВсегоБезНДС;
	ОбластьИтого.Параметры.ИтогоСуммаНДС = СуммаВсегоНДС;
	ОбластьИтого.Параметры.ИтогоСуммаСНДС = СуммаВсего;
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	//ОбластьПодвал.Параметры.Номер = Таб[0].Номер;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции