Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УПД(Черновик)") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"УПД(Черновик)",
		НСтр("ru = 'Универсальный передаточный документ (УПД)(Черновик)';
		|en = 'Universal transfer document (UTD)'"),
		СформироватьПечатнуюФормуУПДЧерновик(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, СтруктураТипов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуУПДЧерновик(СтруктураТипов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	МакетОбработки = ПолучитьМакет("ПФ_MXL_УниверсальныйПередаточныйДокумент_Черновик");
	
	МассивДок = Новый Массив;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДок, СтруктураОбъектов.Значение);
	
    КонецЦикла; 

    Сообщить("Создан ЧЕРНОВИК. Планируемая поставка");

	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьЗаголовкаТаблицы = МакетОбработки.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрокаКомплектующие = МакетОбработки.ПолучитьОбласть("СтрокаКомплектующие");
	ОбластьСтрокаНабор = МакетОбработки.ПолучитьОбласть("СтрокаНабор");
	ОбластьСтрока = МакетОбработки.ПолучитьОбласть("Строка");
	ОбластьИтого = МакетОбработки.ПолучитьОбласть("Итого");
	ОбластьПодвал = МакетОбработки.ПолучитьОбласть("Подвал");
	ОбластьНумерацияЛистов = МакетОбработки.ПолучитьОбласть("НумерацияЛистов");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ВерсияДанных КАК ВерсияДанных,
	|	РеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
	|	РеализацияТоваровУслуг.УдалитьДатаПлатежа КАК УдалитьДатаПлатежа,
	|	РеализацияТоваровУслуг.УдалитьДатаРаспоряжения КАК УдалитьДатаРаспоряжения,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Менеджер КАК Менеджер,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.Сделка КАК Сделка,
	|	РеализацияТоваровУслуг.СкидкиРассчитаны КАК СкидкиРассчитаны,
	|	РеализацияТоваровУслуг.Склад КАК Склад,
	|	РеализацияТоваровУслуг.Согласован КАК Согласован,
	|	РеализацияТоваровУслуг.Соглашение КАК Соглашение,
	|	РеализацияТоваровУслуг.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровУслуг.ФормаОплаты КАК ФормаОплаты,
	|	РеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.Касса КАК Касса,
	|	РеализацияТоваровУслуг.Отпустил КАК Отпустил,
	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ОтпустилДолжность,
	|	РеализацияТоваровУслуг.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
	|	РеализацияТоваровУслуг.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РеализацияТоваровУслуг.КартаЛояльности КАК КартаЛояльности,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Основание КАК Основание,
	|	РеализацияТоваровУслуг.Статус КАК Статус,
	|	РеализацияТоваровУслуг.Автор КАК Автор,
	|	РеализацияТоваровУслуг.УдалитьСуммаПредоплаты КАК УдалитьСуммаПредоплаты,
	|	РеализацияТоваровУслуг.УдалитьСуммаПредоплатыЗаТару КАК УдалитьСуммаПредоплатыЗаТару,
	|	РеализацияТоваровУслуг.СпособДоставки КАК СпособДоставки,
	|	РеализацияТоваровУслуг.ЗонаДоставки КАК ЗонаДоставки,
	|	РеализацияТоваровУслуг.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	РеализацияТоваровУслуг.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	РеализацияТоваровУслуг.ВремяДоставкиС КАК ВремяДоставкиС,
	|	РеализацияТоваровУслуг.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
	|	РеализацияТоваровУслуг.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	РеализацияТоваровУслуг.КонтактноеЛицо КАК КонтактноеЛицо,
	|	РеализацияТоваровУслуг.Руководитель КАК Руководитель,
	|	РеализацияТоваровУслуг.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.ПорядокРасчетов КАК ПорядокРасчетов,
	|	РеализацияТоваровУслуг.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	РеализацияТоваровУслуг.ДатаВозвратаМногооборотнойТары КАК ДатаВозвратаМногооборотнойТары,
	|	РеализацияТоваровУслуг.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
	|	РеализацияТоваровУслуг.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
	|	РеализацияТоваровУслуг.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
	|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
	|	РеализацияТоваровУслуг.ДопоставкаПоРеализации КАК ДопоставкаПоРеализации,
	|	РеализацияТоваровУслуг.ДатаПереходаПраваСобственности КАК ДатаПереходаПраваСобственности,
	|	РеализацияТоваровУслуг.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
	|	РеализацияТоваровУслуг.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	РеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РеализацияТоваровУслуг.КурсЧислитель КАК КурсЧислитель,
	|	РеализацияТоваровУслуг.КурсЗнаменатель КАК КурсЗнаменатель,
	|	РеализацияТоваровУслуг.УдалитьПорядокОплаты КАК УдалитьПорядокОплаты,
	|	РеализацияТоваровУслуг.ЕстьМаркируемаяПродукцияГИСМ КАК ЕстьМаркируемаяПродукцияГИСМ,
	|	РеализацияТоваровУслуг.УдалитьЕстьАлкогольнаяПродукцияДляРеализацииРозницаЕГАИС КАК УдалитьЕстьАлкогольнаяПродукцияДляРеализацииРозницаЕГАИС,
	|	РеализацияТоваровУслуг.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
	|	РеализацияТоваровУслуг.ОплатаВВалюте КАК ОплатаВВалюте,
	|	РеализацияТоваровУслуг.Курьер КАК Курьер,
	|	РеализацияТоваровУслуг.Сборщик КАК Сборщик,
	|	РеализацияТоваровУслуг.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначение КАК АдресДоставкиПеревозчикаЗначение,
	|	РеализацияТоваровУслуг.ВариантВыбытияМаркируемойПродукции КАК ВариантВыбытияМаркируемойПродукции,
	|	РеализацияТоваровУслуг.КлиентКонтрагент КАК КлиентКонтрагент,
	|	РеализацияТоваровУслуг.КлиентПартнер КАК КлиентПартнер,
	|	РеализацияТоваровУслуг.КлиентДоговор КАК КлиентДоговор,
	|	РеализацияТоваровУслуг.гф_РасходныйОрдер КАК гф_РасходныйОрдер,
	|	РеализацияТоваровУслуг.ЭтапГосконтрактаЕИС КАК ЭтапГосконтрактаЕИС,
	|	РеализацияТоваровУслуг.гф_АдресДоставки КАК гф_АдресДоставки,
	|	РеализацияТоваровУслуг.гф_ПочтовоеОтправление КАК гф_ПочтовоеОтправление,
	|	РеализацияТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Назначение КАК Назначение,
	|		Упаковка КАК Упаковка,
	|		КоличествоУпаковок КАК КоличествоУпаковок,
	|		Количество КАК Количество,
	|		ВидЦены КАК ВидЦены,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		УдалитьСтавкаНДС КАК УдалитьСтавкаНДС,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		СуммаСНДС КАК СуммаСНДС,
	|		КодСтроки КАК КодСтроки,
	|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|		ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|		КлючСвязи КАК КлючСвязи,
	|		Склад КАК Склад,
	|		СтатусУказанияСерий КАК СтатусУказанияСерий,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ЗаказКлиента КАК ЗаказКлиента,
	|		СрокПоставки КАК СрокПоставки,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		Серия КАК Серия,
	|		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		НоменклатураНабора КАК НоменклатураНабора,
	|		ХарактеристикаНабора КАК ХарактеристикаНабора,
	|		АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|		КодТНВЭД КАК КодТНВЭД,
	|		ОбъектРасчетов КАК ОбъектРасчетов,
	|		Подразделение КАК Подразделение,
	|		НоменклатураПартнера КАК НоменклатураПартнера,
	|		СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|		СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|		СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте
	|	) КАК Товары,
	|	РеализацияТоваровУслуг.СкидкиНаценки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КлючСвязи КАК КлючСвязи,
	|		СкидкаНаценка КАК СкидкаНаценка,
	|		Сумма КАК Сумма,
	|		НапомнитьПозже КАК НапомнитьПозже
	|	) КАК СкидкиНаценки,
	|	РеализацияТоваровУслуг.ВидыЗапасов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВидЗапасов КАК ВидЗапасов,
	|		НомерГТД КАК НомерГТД,
	|		Упаковка КАК Упаковка,
	|		КоличествоУпаковок КАК КоличествоУпаковок,
	|		Количество КАК Количество,
	|		КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|		УдалитьСтавкаНДС КАК УдалитьСтавкаНДС,
	|		СуммаСНДС КАК СуммаСНДС,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ЗаказКлиента КАК ЗаказКлиента,
	|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|		Цена КАК Цена,
	|		ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
	|		ОбъектРасчетов КАК ОбъектРасчетов,
	|		КодТНВЭД КАК КодТНВЭД
	|	) КАК ВидыЗапасов,
	|	РеализацияТоваровУслуг.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	РеализацияТоваровУслуг.РасшифровкаПлатежа.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		УдалитьЗаказ КАК УдалитьЗаказ,
	|		Сумма КАК Сумма,
	|		ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ОбъектРасчетов КАК ОбъектРасчетов
	|	) КАК РасшифровкаПлатежа,
	|	РеализацияТоваровУслуг.Серии.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Серия КАК Серия,
	|		Количество КАК Количество,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Назначение КАК Назначение,
	|		Склад КАК Склад
	|	) КАК Серии,
	|	РеализацияТоваровУслуг.ЭтапыГрафикаОплаты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Заказ КАК Заказ,
	|		СверхЗаказа КАК СверхЗаказа,
	|		ВариантОплаты КАК ВариантОплаты,
	|		ДатаПлатежа КАК ДатаПлатежа,
	|		Сдвиг КАК Сдвиг,
	|		СуммаПлатежа КАК СуммаПлатежа,
	|		ПроцентПлатежа КАК ПроцентПлатежа,
	|		СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
	|		ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
	|		ОбъектРасчетов КАК ОбъектРасчетов,
	|		ВариантОтсчета КАК ВариантОтсчета
	|	) КАК ЭтапыГрафикаОплаты,
	|	РеализацияТоваровУслуг.ШтрихкодыУпаковок.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|		ЧастичноеВыбытиеКоличество КАК ЧастичноеВыбытиеКоличество,
	|		ЧастичноеВыбытиеВариантУчета КАК ЧастичноеВыбытиеВариантУчета,
	|		ЧастичноеВыбытиеНоменклатура КАК ЧастичноеВыбытиеНоменклатура,
	|		ЧастичноеВыбытиеХарактеристика КАК ЧастичноеВыбытиеХарактеристика
	|	) КАК ШтрихкодыУпаковок,
	|	РеализацияТоваровУслуг.гф_ТоварыВКоробах.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		УпаковочныйЛист КАК УпаковочныйЛист,
	|		Артикул КАК Артикул,
	|		КоличествоПар КАК КоличествоПар,
	|		Коэффициент КАК Коэффициент,
	|		ЦенаКороба КАК ЦенаКороба,
	|		НДС КАК НДС
	|	) КАК гф_ТоварыВКоробах,
	|	РеализацияТоваровУслуг.НачислениеБонусныхБаллов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КлючСвязи КАК КлючСвязи,
	|		БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|		ДатаНачисления КАК ДатаНачисления,
	|		ДатаСписания КАК ДатаСписания,
	|		СуммаБонусныхБаллов КАК СуммаБонусныхБаллов
	|	) КАК НачислениеБонусныхБаллов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Имя";
	
	Запрос.Параметры.Вставить("Имя",МассивДок[0].Ссылка);
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	НомерДок = Прав(Таб[0].Номер, 6);
	
	НомерБезНулей = НомерДок;
       Пока Найти(НомерБезНулей,"0") = 1 Цикл
                НомерБезНулей = Сред(НомерБезНулей,2); //удаляет лидирующие нули
       КонецЦикла;
	//Объект.ОбработанныйНомер = НомерБезНулей;
	   
	ОбластьШапка.Параметры.Номер = НомерБезНулей;
	ОбластьШапка.Параметры.Дата = Формат(Таб[0].Дата, "ДЛФ=DD");
	ОбластьШапка.Параметры.ПредставлениеПоставщика = Таб[0].Организация;
	ОбластьШапка.Параметры.ПредставлениеПокупателя = Таб[0].Партнер.НаименованиеПолное;
	ПеремКодВалюты = Таб[0].Валюта.Код;
	ПеремВалюта = Таб[0].Валюта;
	ПеремВалютаЗнач = Строка(ПеремКодВалюты);
	ПеремВалютаЗначКод = Строка(ПеремВалюта);
	ОбластьШапка.Параметры.Валюта = ПеремВалютаЗначКод + ", " + ПеремВалютаЗнач;
	ОбластьШапка.Параметры.ИННПоставщика = Таб[0].Организация.ИНН + "/" + Таб[0].Организация.КПП;
	ОбластьШапка.Параметры.ПредставлениеГрузополучателя = Таб[0].Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.ИННПокупателя = Таб[0].Контрагент.ИНН + "/" + Таб[0].Контрагент.КПП;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовкаТаблицы);
	
	СуммаВсего = 0; 
	СуммаВсегоСНДС = 0;
	СуммаВсегоНДС = 0;
	СуммаВсегоБезНДС = 0;
	
	Для Каждого Стр Из Таб[0].Товары Цикл
		
		ОбластьСтрокаКомплектующие.Параметры.ПредставлениеНоменклатуры = Таб[0].Товары[0].Номенклатура.Наименование;
		ОбластьСтрокаКомплектующие.Параметры.Цена = Таб[0].Товары[0].Цена;
		ОбластьСтрокаКомплектующие.Параметры.Количество = Таб[0].Товары[0].Количество;
		ОбластьСтрокаКомплектующие.Параметры.СтавкаНДС = Таб[0].Товары[0].СтавкаНДС;
		ОбластьСтрокаКомплектующие.Параметры.СуммаНДС = Таб[0].Товары[0].СуммаНДС;
		ОбластьСтрокаКомплектующие.Параметры.СуммаСНДС = Таб[0].Товары[0].СуммаСНДС;
		
		СуммаБезНДС = (Таб[0].Товары[0].СуммаСНДС - Таб[0].Товары[0].СуммаНДС) * Таб[0].Товары[0].Количество; 
		ОбластьСтрокаКомплектующие.Параметры.СуммаБезНДС = СуммаБезНДС;
		СуммаВсегоБезНДС = СуммаВсегоБезНДС + СуммаБезНДС;
		СуммаВсего = СуммаВсего + Таб[0].Товары[0].СуммаСНДС;
		СуммаВсегоСНДС = СуммаВсегоСНДС + Таб[0].Товары[0].СуммаСНДС; 
		СуммаВсегоНДС = СуммаВсегоНДС + Таб[0].Товары[0].СуммаНДС;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаКомплектующие);
		
	КонецЦикла;
	
	ОбластьИтого.Параметры.ИтогоСуммаБезНДС = СуммаВсегоБезНДС;
	ОбластьИтого.Параметры.ИтогоСуммаНДС = СуммаВсегоНДС;
	ОбластьИтого.Параметры.ИтогоСуммаСНДС = СуммаВсего;
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	//ОбластьПодвал.Параметры.Номер = Таб[0].Номер;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;
	
КонецФункции