// #wortmann {
// #ТЗ_Счет_НаОплатуКлиенту
// добавление дополнительных реквизитов на форму	
// Галфинд Куканов 2022/07/15	
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	
	// ++ Галфинд_ДомнышеваКР_08_04_2024
	ХЗ = Неопределено;
	Если Объект.Ссылка.Пустая() И Параметры.Свойство("гф_ТоварыВКоробах", ХЗ) Тогда
		
		гф_ТоварыВКоробах = ХЗ.Получить();
		Объект.гф_ТоварыВКоробах.Загрузить(гф_ТоварыВКоробах);
	КонецЕсли;
	// -- Галфинд_ДомнышеваКР_08_04_2024
	
	ЭлементГруппаНовыхРеквизитов = Элементы.Добавить("ГруппаРеквизитыДоработок", Тип("ГруппаФормы"), Элементы.ГруппаДополнительно); 
	ЭлементГруппаНовыхРеквизитов.Вид = ВидГруппыФормы.ОбычнаяГруппа;  
	ЭлементГруппаНовыхРеквизитов.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
	
	//элементы отображения новых реквизитов документа
	ЭлементСпецификацияПокупателя = Элементы.Добавить("СпецификацияПокупателя", Тип("ПолеФормы"), ЭлементГруппаНовыхРеквизитов); 
	ЭлементСпецификацияПокупателя.Заголовок = "Спецификация покупателя";   
	ЭлементСпецификацияПокупателя.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСпецификацияПокупателя.ПутьКДанным = "Объект.гф_СпецификацияПокупателя";
	ЭлементСпецификацияПокупателя.ТолькоПросмотр = Истина;

	
	ЭлементНомерПоставки = Элементы.Добавить("НомерПоставки", Тип("ПолеФормы"), ЭлементГруппаНовыхРеквизитов);
	ЭлементНомерПоставки.Заголовок = "Номер поставки";   
	ЭлементНомерПоставки.Вид = ВидПоляФормы.ПолеВвода;    
	ЭлементНомерПоставки.ПутьКДанным = "Объект.гф_НомерПоставки";
	ЭлементНомерПоставки.ТолькоПросмотр = Истина;
	
	гф_СоздатьТаблицуТоварыВКоробах();
	
КонецПроцедуры// } #wortmann

&НаСервере
Процедура гф_СоздатьТаблицуТоварыВКоробах()                                  	
	
	НовоеПолеСтраница = Элементы.Вставить("гф_СтраницаТоварыВКоробах", Тип("ГруппаФормы"),
	Элементы.ГруппаСтраницы, Элементы.ГруппаКомментарий); 
	НовоеПолеСтраница.Вид					= ВидГруппыФормы.Страница;	
	НовоеПолеСтраница.Видимость				= Истина;
	НовоеПолеСтраница.Заголовок				= "Товары в коробах";
	НовоеПолеСтраница.ПутьКДаннымЗаголовка	= "Объект.гф_ТоварыВКоробах.КоличествоСтрок";
	
	НовоеПолеТаблица = Элементы.Добавить("гф_ТаблицаТоварыВКоробах", Тип("ТаблицаФормы"), НовоеПолеСтраница);									
	НовоеПолеТаблица.ПутьКДанным = "Объект.гф_ТоварыВКоробах";
	НовоеПолеТаблица.Подвал = Истина;
	//НовоеПолеТаблица.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024
	
	//++ СадомцевСА 31.01.2024
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахЗаказКлиента", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок			= "Заказ клиента";
	НовоеПоле.Вид				= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным		= "Объект.гф_ТоварыВКоробах.ЗаказКлиента";
	НовоеПоле.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024
	//-- СадомцевСА 31.01.2024

	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахВариантКомплектации", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок			= "Вариант комплектации";
	НовоеПоле.Вид				= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным		= "Объект.гф_ТоварыВКоробах.ВариантКомплектации";
	
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахВариантКомплектацииВладелец", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок			= "Номенклатура";
	НовоеПоле.Вид				= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024

	// СадомцевСА 07.03.2024 тч гф_ТоварыВКоробах добавил реквизит Номенклатура
	//НовоеПоле.ПутьКДанным		= "Объект.гф_ТоварыВКоробах.ВариантКомплектации.Владелец";
	НовоеПоле.ПутьКДанным		= "Объект.гф_ТоварыВКоробах.Номенклатура";
	
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахКоличество", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок				= "Количество";
	НовоеПоле.Вид					= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным			= "Объект.гф_ТоварыВКоробах.Количество";
	НовоеПоле.ПутьКДаннымПодвала	= "Объект.гф_ТоварыВКоробах.ИтогКоличество";
	НовоеПоле.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024
	
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахЦена", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок				= "Цена";
	НовоеПоле.Вид					= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным			= "Объект.гф_ТоварыВКоробах.Цена";
	НовоеПоле.ТолькоПросмотр = Ложь;  // Галфинд_ДомнышеваКР_29_03_2024
	НовоеПоле.УстановитьДействие("ПриИзменении", "гф_ПриИзмененииЦеныСкидкаНаценка"); // Галфинд_ДомнышеваКР_29_03_202
	
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахВариантКомплектацииСтавкаНДС", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок			= "СтавкаНДС";
	НовоеПоле.Вид				= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным		= "Объект.гф_ТоварыВКоробах.СтавкаНДС";
	НовоеПоле.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024
	
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахСуммаНДС", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок				= "СуммаНДС";
	НовоеПоле.Вид					= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным			= "Объект.гф_ТоварыВКоробах.СуммаНДС";
	НовоеПоле.ПутьКДаннымПодвала	= "Объект.гф_ТоварыВКоробах.ИтогСуммаНДС";
	НовоеПоле.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024
	
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахСумма", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок				= "Сумма";
	НовоеПоле.Вид					= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным			= "Объект.гф_ТоварыВКоробах.Сумма";
	НовоеПоле.ПутьКДаннымПодвала	= "Объект.гф_ТоварыВКоробах.ИтогСумма";
	НовоеПоле.ТолькоПросмотр = Истина; // Галфинд_ДомнышеваКР_29_03_2024
	
	// ++ Галфинд_ДомнышеваКР_29_03_2024
	НовоеПоле = Элементы.Добавить("гф_ТоварыВКоробахСкидкаНаценка", Тип("ПолеФормы"), НовоеПолеТаблица);
	НовоеПоле.Заголовок			= "Скидка/Наценка";
	НовоеПоле.Вид				= ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным		= "Объект.гф_ТоварыВКоробах.СкидкаНаценка";
	НовоеПоле.ТолькоПросмотр = Ложь;
	НовоеПоле.Доступность = Истина;
	НовоеПоле.УстановитьДействие("ПриИзменении", "гф_ПриИзмененииЦеныСкидкаНаценка");
	
	ТипКнопкаФормы = Тип("КнопкаФормы");
	Команда = Команды.Добавить("гф_КомандаЗаполнитьСкидкаНакидка");
	Команда.Действие = "гф_КомандаЗаполнитьСкидкаНакидка";
	
	НовыйЭлемент = Элементы.Добавить("гф_ЗаполнитьСкидкаНакидка", ТипКнопкаФормы, НовоеПолеТаблица.КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Заполнить все"; 
	НовыйЭлемент.ИмяКоманды = "гф_КомандаЗаполнитьСкидкаНакидка";
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
    // -- Галфинд_ДомнышеваКР_29_03_2024

КонецПроцедуры 

&НаКлиенте
Процедура гф_ПриИзмененииЦеныСкидкаНаценка(Элемент) 
	// ++ Галфинд_ДомнышеваКР_29_03_2024
	ТекущиеДанные = Элементы.гф_ТаблицаТоварыВКоробах.ТекущиеДанные;
	СтавкаНДС = гф_ПолучитьЗначениеСтавки(ТекущиеДанные.СтавкаНДС);
	СкидкаНаценка = ТекущиеДанные.СкидкаНаценка;
		ТекущиеДанные.СуммаНДС = (СтавкаНДС / 100) 
		* (ТекущиеДанные.Цена - ТекущиеДанные.Цена * (СкидкаНаценка / 100) ) * ТекущиеДанные.Количество;
	ТекущиеДанные.Сумма = ТекущиеДанные.СуммаНДС 
		+ (ТекущиеДанные.Цена - ТекущиеДанные.Цена * (СкидкаНаценка / 100)) * ТекущиеДанные.Количество; 
	// -- Галфинд_ДомнышеваКР_29_03_2024
КонецПроцедуры

&НаКлиенте
Процедура гф_КомандаЗаполнитьСкидкаНакидка(Команда)
	// ++ Галфинд_ДомнышеваКР_29_03_2024
	ТекущиеДанные = Элементы.гф_ТаблицаТоварыВКоробах.ТекущиеДанные;
	СкидкаНаценка = ТекущиеДанные.СкидкаНаценка;
	Для каждого Стр Из Объект.гф_ТоварыВКоробах Цикл
		Стр.СкидкаНаценка = СкидкаНаценка;
	КонецЦикла;
	гф_ПреобразоватьТоварыВКоробах();
    // -- Галфинд_ДомнышеваКР_29_03_2024
КонецПроцедуры 

&НаСервере
Функция гф_ПолучитьЗначениеСтавки(СтавкаНДССсылка)
	// Галфинд_ДомнышеваКР_29_03_2024
	
	Возврат СтавкаНДССсылка.Ставка;
	
КонецФункции 

&НаСервере
Процедура гф_ПреобразоватьТоварыВКоробах()
	
	// ++ Галфинд_ДомнышеваКР_29_03_2024
	
	Для каждого Стр Из Объект.гф_ТоварыВКоробах Цикл
		СкидкаНаценка = Стр.СкидкаНаценка;
		Стр.СуммаНДС = (Стр.СтавкаНДС.Ставка / 100) * (Стр.Цена - Стр.Цена * (СкидкаНаценка / 100) ) * Стр.Количество;
		Стр.Сумма = Стр.СуммаНДС + (Стр.Цена - Стр.Цена * (СкидкаНаценка / 100)) * Стр.Количество;	
	КонецЦикла;
    // -- Галфинд_ДомнышеваКР_29_03_2024
	
КонецПроцедуры 

