#Область ОбработчикиСобытийФормы
  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Данные = ТекущийОбъект.ДанныеХЗ.Получить();
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Данные);
		Если Порт = 0 Тогда
			Порт = 21;		
		КонецЕсли;
		Если Таймаут = 0 Тогда
			Таймаут = 10;		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Прав(Каталог, 1) <> "/" Тогда
		Каталог = Каталог + "/";	
	КонецЕсли;
	ТекущийОбъект.ДанныеХЗ = вСформироватьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Функция СтруктураФТП()
	
	Данные = Новый Структура;
	Данные.Вставить("Сервер", "");
	Данные.Вставить("Порт", 21);
	Данные.Вставить("Пользователь", "");
	Данные.Вставить("Пароль", "");
	Данные.Вставить("ПользовательПрокси", "");
	Данные.Вставить("ПарольПрокси", "");
	Данные.Вставить("Каталог", "");
	Данные.Вставить("ПассивноеСоединение", Ложь);
	Данные.Вставить("Таймаут", 10);
		
	Возврат Данные;
	
КонецФункции

&НаСервере
Функция вСформироватьДанные()
	
	Данные = СтруктураФТП();
	ЗаполнитьЗначенияСвойств(Данные, ЭтотОбъект);
	ДанныеХЗ = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(6));
	Возврат ДанныеХЗ;
	
КонецФункции

&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	
	Записать();
	
	фтп = Новый FTPСоединение(Сервер, Порт, Пользователь, Пароль,
		, ПассивноеСоединение,
		Таймаут);
	
	ИмяВременногоФайлаПроверкиПодключения = ПолучитьИмяВременногоФайла("tmp");
	ИмяФайлаНаСторонеПриемника = ОбменДаннымиСервер.ИмяВременногоФайлаПроверкиПодключения();
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайлаПроверкиПодключения);
	ЗаписьТекста.ЗаписатьСтроку(ИмяФайлаНаСторонеПриемника);
	ЗаписьТекста.Закрыть();
	
	ИмяФайлаНаСторонеПриемника = Каталог + ИмяФайлаНаСторонеПриемника;
	
	Попытка
		фтп.Записать(ИмяВременногоФайлаПроверкиПодключения, ИмяФайлаНаСторонеПриемника);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;

	Попытка
		УдалитьФайлы(ИмяВременногоФайлаПроверкиПодключения);
		фтп.Удалить(ИмяФайлаНаСторонеПриемника);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Успешно!");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	ПроверитьСоединениеНаСервере();
КонецПроцедуры

 #КонецОбласти