    #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ЗагрузкаИзФайлаВТЧ

// Переопределяет параметры загрузки данных из файла.
//
// Параметры:
// Параметры 
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт

КонецПроцедуры
// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
// 
// Параметры:
// 	АдресЗагружаемыхДанных- Строка - адрес временного хранилища с таблицей значений, в которой
//                                   находятся загруженные данные из файла.
// 	АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                                       являющейся копией табличной части документа, 
//                                       которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
// 	СписокНеоднозначностей - ТаблицаЗначений - состоит из:
//  * Идентификатор - Число - идентификатор
//  * Колонка - Строка - имя колонки
// 	ПолноеИмяТабличнойЧасти - Строка - полное имя табличной части
// 	ДополнительныеПараметры - Структура - дополнительные параметры, переданные из формы-источнике.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	Блокировка = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	    "ВЫБРАТЬ
		|	ДанныеДляСопоставления.ОсновноеСредство КАК Контрагент,
		|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ДанныеДляСопоставления
        |ИЗ
		|	&ДанныеДляСопоставления КАК ДанныеДляСопоставления
		|; 
		|/////////////////////////////////////////////////////////////////////////////// 
		|ВЫБРАТЬ
		|	Контрагент.Ссылка КАК Ссылка,
		|	Контрагент.Ссылка.Наименование КАК Наименование,
		|	ДанныеДляСопоставления.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ СопоставленныйКонтрагентПоНаименованию
		|ИЗ
		|	ДанныеДляСопоставления КАК ДанныеДляСопоставления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО (Контрагенты.Ссылка.Наименование = ДанныеДляСопоставления.Контрагент)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(СопоставленныйКонтрагентПоНаименованию.Ссылка),
		|	СопоставленныйКонтрагентПоНаименованию.Идентификатор,
		|	КОЛИЧЕСТВО(СопоставленныйКонтрагентПоНаименованию.Идентификатор)
		|ИЗ
		|	СопоставленныйКонтрагентПоНаименованию КАК СопоставленныйКонтрагентПоНаименованию
		|СГРУППИРОВАТЬ ПО
		|	СопоставленныйКонтрагентПоНаименованию.Идентификатор";


	Запрос.УстановитьПараметр("ДанныеДляСопоставления", ЗагружаемыеДанные);
	РезультатыЗапросов = Запрос.ВыполнитьПакет(); // Массив из РезультатЗапроса
	
	ТаблицаДанных = РезультатыЗапросов[3].Выгрузить(); // ТаблицаЗначений

	Для каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		Данные =Блокировка.Добавить();
		Данные.Идентификатор = СтрокаТаблицы.Идентификатор;
		Данные.Флаг = СтрокаТаблицы.Флаг;
		Данные.ДоговорКонтрагента = СтрокаТаблицы.ДоговорКонтрагента;
		Данные.ВидБлокировки = СтрокаТаблицы.Видблокировки;
		Данные.Заблокирован = СтрокаТаблицы.Заблокирован;     
		Данные.Комментарий = СтрокаТаблицы.Комментарий;
		
		Строка = ТаблицаДанных.Найти(СтрокаТаблицы.Идентификатор, "Идентификатор");
		Если Строка <> Неопределено Тогда 
			Если Строка.Количество = 1 Тогда 
				Данные.Контрагент = Строка.Ссылка;
			КонецЕсли;
			Если Строка.Количество > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор;
				ЗаписьОНеоднозначности.Колонка = "Контрагент";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Блокировка, АдресТаблицыСопоставления);
	
КонецПроцедуры

#КонецОбласти
#КонецОбласти 
#КонецЕсли