////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
Процедура ОКНажатие(Команда)
// Процедура - обаботчик события "Нажатие" в: Кнопка "ОК"
//
	Закрыть(Элементы.СписокНастроек.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаНажатие(Команда)
// Процедура - обаботчик события "Нажатие" в: Кнопка "Отмена"
//
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНажатие(Команда)
// Процедура - обаботчик события "Нажатие" в: Кнопка "Удалить"
//
	
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздавалиНовуюСтроку и ТекущиеДанные = СписокНастроек[СписокНастроек.Количество() - 1] Тогда
		СоздавалиНовуюСтроку = Ложь;
	КонецЕсли;
	
	Если СписокНастроек.Количество() = 1 Тогда
		СоздавалиНовуюСтроку = Истина;
		ТекущиеДанные.Представление = "";
		ТекущиеДанные.Пометка = Ложь;
	Иначе
		СписокНастроек.Удалить(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если СписокНастроек.Количество() = 0 Тогда
		ТекущиеДанные = СписокНастроек.Добавить();
		ТекущиеДанные.Представление = "Основная";
		ТекущиеДанные.Значение = "Новая";
		СоздавалиНовуюСтроку = Истина;
	Иначе
		СоздавалиНовуюСтроку = Ложь;
		ТекущиеДанные = СписокНастроек[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНастройкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Нашли = Ложь;
	
	Для каждого ТекущиеДанные Из СписокНастроек Цикл
		Если ТекущиеДанные.Представление = Текст Тогда
			Нашли = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Нашли Тогда
		
		Если Не СоздавалиНовуюСтроку Тогда
			ТекущиеДанные = СписокНастроек.Добавить();
			СоздавалиНовуюСтроку = истина;
		Иначе
			ТекущиеДанные = СписокНастроек[СписокНастроек.Количество() - 1];
		КонецЕсли;
		
		ТекущиеДанные.Представление = Текст;
	КонецЕсли;
	
	Элементы.СписокНастроек.ТекущаяСтрока = ТекущиеДанные;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПриОткрытииПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если ТекущиеДанные.Пометка Тогда
		Для каждого ЭлементСписка Из СписокНастроек Цикл
			Если ЭлементСписка.Пометка и Не ЭлементСписка = ТекущиеДанные Тогда
				ЭлементСписка.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если ТекущиеДанные.Пометка Тогда
		Для каждого ЭлементСписка Из СписокНастроек Цикл
			Если ЭлементСписка.Пометка и Не ЭлементСписка = ТекущиеДанные Тогда
				ЭлементСписка.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
