
&НаКлиенте
Процедура ЗагрузитьИзКаталога(Команда)
	МассивФайлов = НайтиФайлы(Объект.Каталог, "*.*");

	ОписанияПередаваемыхФайлов = Новый Массив;
	
	Для каждого Элемент из МассивФайлов Цикл		 
	Описание = Новый ОписаниеПередаваемогоФайла;
	Описание.Имя = Элемент.ПолноеИмя;
	//Описание.Хранение = ПолучитьНавигационнуюСсылку(Элемент.ПолноеИмя);
	ОписанияПередаваемыхФайлов.Добавить(Описание);
	КонецЦикла;

	ОписаниеОЗавершении = Новый ОписаниеОповещения("ОбработатьВыборВнешнегоФайла", ЭтотОбъект);
	//ФайловаяСистемаКлиент.ЗагрузитьФайлы(ОписаниеОЗавершении, , МассивФайлов);
	НачатьПомещениеФайловНаСервер(ОписаниеОЗавершении, , ,ОписанияПередаваемыхФайлов, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры 
 
&НаКлиенте
Процедура ОбработатьВыборВнешнегоФайла(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДанныеДляЗагрузки = Новый Массив;
	
	Для каждого Элемент из ПомещенныеФайлы Цикл
		Элт =Новый Структура("Адрес, Имя, ПолноеИмя, ВремяИзменения, ИмяБезРасширения, Расширение, Размер, Путь");
		Элт.Адрес = Элемент.Адрес;
		Элт.Имя = Элемент.СсылкаНафайл.Файл.Имя;
		Элт.ПолноеИмя = Элемент.СсылкаНафайл.Файл.ПолноеИмя;
		Элт.ВремяИзменения = Элемент.СсылкаНафайл.ПолучитьУниверсальноеВремяИзменения();
        Элт.ИмяБезРасширения = Элемент.СсылкаНафайл.Файл.ИмяБезРасширения;
		Элт.Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Элемент.СсылкаНафайл.Файл.Расширение);
	
		Элт.Размер = Элемент.СсылкаНафайл.Файл.Размер(); 
		Элт.Путь = Элемент.СсылкаНафайл.Файл.Путь;
		ДанныеДляЗагрузки.Добавить(Элт);
	КонецЦикла;
	
	ЗагрузитьИзКаталогаНаСервере(ДанныеДляЗагрузки);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзКаталогаНаСервере(МассивФайлов)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьКартинкиИзКаталога(МассивФайлов);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьSFTPНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьКартинкиSFTPСервера();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьSFTP(Команда)
	 ЗагрузитьSFTPНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	Объект.Каталог = Объект.Каталог + ?(прав(Объект.Каталог,1) = "\", "", "\");
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Каталог = Объект.Каталог;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Укажите каталог для сохранения данных";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Каталог = ДиалогОткрытияФайла.Каталог; 
	КонецЕсли; 
	
	Объект.Каталог = Каталог + ?(прав(Каталог,1) = "\", "", "\");
	
КонецПроцедуры
