#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 	
Функция ПолучитьСсылкуСпрНоменклатураВнешнихСистем(Номенклатура, Характеристика, Организация, ВнешняяСистема) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	Запрос.Текст = "ВЫБРАТЬ
	               |	гф_НоменклатураВнешнихСистем.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.гф_НоменклатураВнешнихСистем КАК гф_НоменклатураВнешнихСистем
	               |ГДЕ
	               |	гф_НоменклатураВнешнихСистем.Номенклатура = &Номенклатура
	               |	И гф_НоменклатураВнешнихСистем.Характеристика = &Характеристика
	               |	И гф_НоменклатураВнешнихСистем.Организация = &Организация
	               |	И гф_НоменклатураВнешнихСистем.ВнешняяСистема = &ВнешняяСистема";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Возврат Справочники.гф_НоменклатураВнешнихСистем.СоздатьЭлемент();
	КонецЕсли;
	
КонецФункции

#КонецЕсли