
&После("ПриЗаполненииСписковСОграничениемДоступа")
Процедура гф_ПриЗаполненииСписковСОграничениемДоступа(Списки)
	
	Списки.Вставить(Метаданные.Справочники.гф_АдресаДоставки, Истина);
	Списки.Вставить(Метаданные.Документы.гф_АгрегацияКМ, Истина);
КонецПроцедуры

&После("ПриЗаполненииВидовОграниченийПравОбъектовМетаданных")
Процедура гф_ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание)

	Описание = Описание + "
		|Документ.гф_АгрегацияКМ.Чтение.Организации
		|Документ.гф_АгрегацияКМ.Изменение.Организации";
	
КонецПроцедуры
