#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция гф_ЕстьОграниченияДостпаКонтакныхЛиц(ТекущийПользователь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЭтоПолныеПрава = НЕ Пользователи.ЭтоПолноправныйПользователь(ТекущийПользователь);
	Если  ЭтоПолныеПрава Тогда
		ЕстьОграничения = Ложь;
	Иначе
		ЕстьОграничения = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст =" 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДоступаЗначенияДоступа.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ГруппыДоступаСОграничением
		|ИЗ
		|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
		|ГДЕ
		|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа ССЫЛКА Справочник.ГруппыДоступаПартнеров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицыГруппДоступа.ГруппаДоступа КАК ГруппаДоступа
		|ПОМЕСТИТЬ ВсеГруппыКЛ
		|ИЗ
		|	РегистрСведений.ТаблицыГруппДоступа КАК ТаблицыГруппДоступа
		|ГДЕ
		|	ТаблицыГруппДоступа.Таблица.Имя = &ИмяКЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДоступаПользователи.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ГруппыДоступаПользователя
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеГруппыКЛ КАК ВсеГруппыКЛ
		|		ПО (ВсеГруппыКЛ.ГруппаДоступа = ГруппыДоступаПользователи.Ссылка)
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &ТекущийПользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступаПользователя.Ссылка КАК Ссылка
		|ИЗ
		|	ГруппыДоступаПользователя КАК ГруппыДоступаПользователя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГруппыДоступаСОграничением КАК ГруппыДоступаСОграничением
		|		ПО (ГруппыДоступаПользователя.Ссылка = ГруппыДоступаСОграничением.Ссылка)
		|ГДЕ
		|	ГруппыДоступаСОграничением.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("ИмяКЛ", "КонтактныеЛицаПартнеров");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЕстьОграничения = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат ЕстьОграничения;	
КонецФункции // ()
#КонецЕсли