
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ГруппаДоступа") Тогда 
		
		Элементы.Список.ТекущийРодитель = Параметры.ГруппаДоступа;
		
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Использование = Истина;
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		ОтборГруппа = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
		
		ОтборЭлемент = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии;
		ОтборЭлемент.ПравоеЗначение = Параметры.ГруппаДоступа;
		
	КонецЕсли;
	
КонецПроцедуры
