
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("ГруппаДоступа") И ЗначениеЗаполнено(Параметры.ГруппаДоступа) Тогда
		
		Список.УсловноеОформление.Элементы.Очистить();
		
		Элементы.Список.ТекущийРодитель = Параметры.ГруппаДоступа;
		
		ЭлементУО = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Использование = Истина;
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		ОтборГруппа = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ОтборГруппа.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе;
		
		ОтборЭлемент = ОтборГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ОтборЭлемент.ПравоеЗначение = Параметры.ГруппаДоступа;
		
		ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
		ПолеОформления.Использование = Истина;
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Наименование");
		
		ПолеОформления = ЭлементУО.Поля.Элементы.Добавить();
		ПолеОформления.Использование = Истина;
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Код");
		
	КонецЕсли;
	
КонецПроцедуры
