#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаПолученияФормы")
Процедура гф_ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма,
	ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Перем Значение;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ", Значение) И ЗначениеЗаполнено(Значение) Тогда
			пИмяОбъекта = _омОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Значение,
			"ПланВидовХарактеристик.гф_ГлобальныеЗначения", "Ключ", "");
			Если ПустаяСтрока(пИмяОбъекта) Тогда
				пИмяОбъекта = ПолучитьИмяПредопределенного(Значение);
			КонецЕсли;
			
			Если пИмяОбъекта = "СтрокаСоединенияИнтермех" 
				ИЛИ пИмяОбъекта = "СтрокаСоединенияПримавера" 
				ИЛИ пИмяОбъекта = "СтрокаСоединенияСЭСА" Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ПланВидовХарактеристик.гф_ГлобальныеЗначения.Форма.ФормаЭлементаСАвторизацией";
			ИначеЕсли СтрНачинаетсяС(пИмяОбъекта, "FTP") Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "ПланВидовХарактеристик.гф_ГлобальныеЗначения.Форма.ФормаЭлементаFTP";
			Иначе
				СтандартнаяОбработка = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли