
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

//++ Плотников 22.06.2022
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаНовыхРеквизитов", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаКомплектация", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаПодвалОбщий", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Комплектация", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина=15;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Комплектация";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ШтрихкодКороба", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина=10;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Комплектация.гф_Штрихкод";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_NVE_распечатан", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Код (NVE) распечатан";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_NVE_распечатан";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_NVE_назначен", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаКомплектация);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Код (NVE) назначен";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_NVE_назначен";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_СостояниеКороба", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаНовыхРеквизитов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Состояние короба";
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_СостояниеКороба";

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаНовыхРеквизитов, ЭтотОбъект.Элементы.ШапкаЛево);
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаКомплектация, ЭтотОбъект.Элементы.гф_ГруппаНовыхРеквизитов);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Организация", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Организация";

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Организация, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Клиент", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Заказ.Партнер";

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Клиент, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Заказ", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Заказ";

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Заказ, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Поставка", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Поставка";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Поставка, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Агрегация", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Агрегация";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_Агрегация, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ФайлЗагрузки", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ФайлЗагрузки";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ФайлЗагрузки, ЭтотОбъект.Элементы.гф_ГруппаПодвалОбщий);

//-- Плотников 22.06.2022    

// #wortmann {
// #3.3.33
// Галфинд Окунев 2022/07/05
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_АдресДоставки", ТипПолеФормы, Элементы.ШапкаЛево);
	
	НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным	= "Объект.гф_АдресДоставки";
// } #wortmann

КонецПроцедуры     
