#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСоответствиеКодовОпераций() Экспорт
	
	СоответствиеКодовОпераций = Новый Соответствие;
	
	ДокументКоды = Обработки.гф_ПочтаРоссииЗапросКТрекеру.ПолучитьМакет("КодыОпераций"); 
	
	КолонкаКодОперации		= 1; 
	КолонкаОперация			= 2; 
	КолонкаКодАтрибута		= 3; 
	КолонкаАтрибут			= 4; 
	КолонкаКонечнаяОперация	= 5; 
	
	КодОперации = Неопределено;
	
	Для НомерСтроки = 2 По ДокументКоды.ВысотаТаблицы Цикл
		
		ОбластьКодОперации		= ДокументКоды.Область(НомерСтроки, КолонкаКодОперации);
		ОбластьОперация			= ДокументКоды.Область(НомерСтроки, КолонкаОперация);
		ОбластьКодАтрибута		= ДокументКоды.Область(НомерСтроки, КолонкаКодАтрибута);
		ОбластьАтрибут			= ДокументКоды.Область(НомерСтроки, КолонкаАтрибут);
		ОбластьКонечнаяОперация	= ДокументКоды.Область(НомерСтроки, КолонкаКонечнаяОперация);
		
		КонечнаяОперация = ЗначениеЗаполнено(ОбластьКонечнаяОперация.Текст);
		
		КодСледующейОперации = ОбластьКодОперации.Текст;
		
		Если ЗначениеЗаполнено(КодСледующейОперации) Тогда
			
			КодОперации = КодСледующейОперации;
			
			АтрибутыОпераций = Новый Структура;
			
			СоответствиеАтрибутов = Новый Соответствие;
			
			АтрибутыОпераций.Вставить("Имя", ОбластьОперация.Текст);     
			АтрибутыОпераций.Вставить("СоответствиеАтрибутов", СоответствиеАтрибутов);     
			
			СоответствиеКодовОпераций.Вставить(КодОперации, АтрибутыОпераций);
			
		КонецЕсли;	    
		
		КодАтрибута = ОбластьКодАтрибута.Текст;
		
		АтрибутОперации = Новый Структура;
		
		АтрибутОперации.Вставить("Атрибут", ОбластьАтрибут.Текст);    
		АтрибутОперации.Вставить("КонечнаяОперация", КонечнаяОперация);     
		
		СоответствиеКодовОпераций[КодОперации].СоответствиеАтрибутов.Вставить(КодАтрибута, АтрибутОперации);
		
	КонецЦикла;	
	
	Возврат СоответствиеКодовОпераций; 
	
КонецФункции	

#КонецОбласти

