
&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.ЗакрыватьПриВыборе = Истина;
	ОповеститьОВыборе(Новый Структура("мсНомерЗаказа, мсАдресЭлектроннойПочты", мсНомерЗаказа, мсАдресЭлектроннойПочты));

КонецПроцедуры


&НаКлиенте
Функция ПроверкаПочты(Текст, Элемент = Неопределено)
	
	Если ЗначениеЗаполнено(Текст) 
		И (Найти(Текст, "@") = 0 Или СтрДлина(Лев(Текст, Найти(Текст, "@"))) = 0
		Или СтрДлина(Прав(Текст, Найти(Текст, "@"))) = 0
		Или Найти(Текст, ".") = 0
		Или СтрДлина(Лев(Текст, Найти(Текст, "."))) = 0
		Или СтрДлина(Прав(Текст, Найти(Текст, "."))) = 0) Тогда
		
		Сообщить("Некорректное значение адреса электронной почты, необходимо исправить");
		
		Если Элемент <> Неопределено Тогда
			ЭтаФорма.ТекущийЭлемент = Элемент;
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура мсАдресЭлектроннойПочтыОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПроверкаПочты(Текст);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	МожноЗакрывать = ПроверкаПочты(мсАдресЭлектроннойПочты);
	
	Если Не МожноЗакрывать Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мсАдресЭлектроннойПочты = Параметры.мсАдресЭлектроннойПочты;
	мсНомерЗаказа = Параметры.мсНомерЗаказа;
	
КонецПроцедуры
