#Область ЗаполнениеВидовЗапасов

&Вместо("ЗаполнитьВидыЗапасовПоОстаткамКОформлению")
Процедура гф_ЗаполнитьВидыЗапасовПоОстаткамКОформлению(ДокументОбъект, МенеджерВременныхТаблиц, Отказ, ПараметрыЗаполненияВидовЗапасов)
	
	// #wortmann {
	// 1.1 Регистрация возвратов	
	// Галфинд Sakovich 2022/11/29
	Если ПараметрыЗаполненияВидовЗапасов.ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию = Неопределено Тогда
		ТекстИсключения = НСтр("ru = 'В вызывающем коде не задано значение параметра %1.';
		|en = 'Value of the %1 parameter is not specified in the called code.'");
		ТекстИсключения = СтрШаблон(ТекстИсключения, "ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию");
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Если ПараметрыЗаполненияВидовЗапасов.ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию = Ложь Тогда
		
		ПараметрыЗаполненияВидовЗапасов.ПриНехваткеТоваровОрганизацииЗаполнятьВидамиЗапасовПоУмолчанию = Истина;
		
	КонецЕсли;
	
	ПродолжитьВызов(ДокументОбъект, МенеджерВременныхТаблиц, Отказ, ПараметрыЗаполненияВидовЗапасов);
	// } #wortmann
	
КонецПроцедуры

#КонецОбласти
