#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОстатков	= ТекущаяДатаСеанса();
	ДатаЦен			= ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)   
	
	Если Не ЗначениеЗаполнено(ПрайсЛист) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для печати необходимо заполнить Прайс-лист");
		
		Возврат;			
		
	КонецЕсли;	
	
	ПараметрыПечати = Новый Структура("ДатаОстатков, ДатаЦен, ПрайсЛист, ПредоплатныйКлиент, СкидкаКлиента");
	
	ЗаполнитьЗначенияСвойств(ПараметрыПечати, ЭтотОбъект);
	
	Закрыть(ПараметрыПечати);
	
КонецПроцедуры

#КонецОбласти

