#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// #wortmann {
	// #3.2.01 Адреса доставки
	// Галфинд Журавлев 2022/07/05
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АдресаДоставки, "Контрагент", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(КонтактныеЛица, "Партнер", Объект.Партнер);
	// } #wortmann
КонецПроцедуры

&НаСервере
Процедура гф_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// #wortmann {
	// #3.2.01 Адреса доставки
	// Галфинд Журавлев 2022/07/05
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АдресаДоставки, "Контрагент", Объект.Ссылка);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(КонтактныеЛица, "Партнер", Объект.Партнер);
	// } #wortmann
КонецПроцедуры

&НаКлиенте
Процедура гф_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	// #wortmann {
	// #3.2.01 Адреса доставки
	// Галфинд Журавлев 2022/07/05
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.гф_АдресаДоставки") Тогда 
		ОбновитьВладельцаДляАдреса(ВыбранноеЗначение);
		Элементы.АдресаДоставки.Обновить();
	КонецЕсли;
	// } #wortmann
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура гф_ПодобратьАдресПосле(Команда)
	// #wortmann {
	// #3.2.01 Адреса доставки
	// Галфинд Журавлев 2022/07/05
	ОткрытьФорму("Справочник.гф_АдресаДоставки.ФормаВыбора", , ЭтотОбъект);
	// } #wortmann
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #wortmann {
// #3.2.01 Адреса доставки
// Галфинд Журавлев 2022/07/05
//
// Обновляет владельца (контрагента) адреса доставки
//
// Параметры:
//  ТекАдрес - СправочникСсылка.гф_АдресаДоставки
//
&НаСервере
Процедура ОбновитьВладельцаДляАдреса(ТекАдрес) 
	
	АдресОбъект = ТекАдрес.ПолучитьОбъект();
	АдресОбъект.Владелец = Объект.Ссылка;
	АдресОбъект.Записать();
	
КонецПроцедуры // } #wortmann

#КонецОбласти
