#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не (РольДоступна("гф_ИспользованиеОтгрузкиПоЗаказам") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'У пользователя недостаточно прав, необходимо право ""Право отгрузки по заказам""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	РасчетЦен = 1; 
	
	СвойствоДоговораПредоплата = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "гф_ДоговорыКонтрагентовПредоплата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗначениеТоварыВКоробах();
	
	УстановитьОрганизацию();
	
	Объект.СтоимостьОтмеченныхКОтгрузкеТоваров = 0;
	
	РассчитатьОбщуюСтоимостьОтмеченныхКОтгрузкеТоваровКлиент(); // СадомцевСА 12.02.2024
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовПриИзменении(Элемент)
	
	ЭлементСтрока = Элемент.ТекущиеДанные;
	
	Если Не Объект.ТоварыВКоробках Тогда
		
		Если ЭлементСтрока.КоличествоДоступно >= ЭлементСтрока.КоличествоОтгрузить Тогда
			// ++ Галфинд ВолковЕВ 04.03.2024 Вывод в Таблицу пользователя представление ставки НДС, а в расчете используется само числовое значение
			// СтавкаНДС = ПолучитьСтавкуНДС(ЭлементСтрока.СтавкаНДССсылка);
			СтавкаНДС = ЭлементСтрока.СтавкаНДС;
			// -- Галфинд ВолковЕВ 04.03.2024
			// ++ Галфинд Волков 2023/12/26
			// ЭлементСтрока.Стоимость = ЭлементСтрока.КоличествоОтгрузить * ЭлементСтрока.Цена * (1 + СтавкаНДС/100);
			ЭлементСтрока.Стоимость = ЭлементСтрока.КоличествоОтгрузить * ЭлементСтрока.Цена
										* (1 + СтавкаНДС / 100) * (1 - ЭлементСтрока.СкидкаИзЗаказа / 100);
			// -- Галфинд Волков 2023/12/26
		Иначе 
			
			ЭлементСтрока.КоличествоОтгрузить = ЭлементСтрока.КоличествоДоступно;
			
			ТекстСообщения = НСтр("ru = 'Количество к отгрузке превышает доступное количество!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЭлементСтрока.Отгрузить = Ложь;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;

	ПоЗаказам = 1;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) И РасчетЦен <> ПоЗаказам Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указан вид цены!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ЭлементСтрока.Отгрузить = Ложь;
		Возврат;
		
	КонецЕсли;
	
	УстановитьФлажкиНиже(ЭлементСтрока, ЭлементСтрока.Отгрузить);
	УстановитьФлажкиВыше(ЭлементСтрока, ЭлементСтрока.Отгрузить);
	
	РассчитатьОбщуюСтоимостьОтмеченныхКОтгрузкеТоваровКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	УстановитьЗначениеТоварыВКоробах();
	
	УстановитьОрганизацию();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьРезерв(Команда)
	
	Отказ = Ложь;
	
	СнятьРезервНаСервере(Отказ);
	
	Если Не Отказ Тогда
		Заполнить(Ложь);
		
		РазвернутьДеревоДокументов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура РасчетЦенПриИзменении(Элемент = Неопределено)
	
	//Элементы.ВидЦены.Доступность			= РасчетЦен = 2; // 1 - по заказу, 2 - по прайс-листу
	Элементы.ВидЦены.ОтметкаНезаполненного	= РасчетЦен = 2; // 1 - по заказу, 2 - по прайс-листу
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПредоплатныхКлиентовПриИзменении(Элемент)
	
	Если ОтборПредоплатныхКлиентов = 1 Тогда // Предоплатные
		
		РасчетЦен = 1; // по заказу 
		
		Элементы.РасчетЦен.ТолькоПросмотр = Истина;
	
	ИначеЕсли ОтборПредоплатныхКлиентов = 2 Тогда // Не предоплатные
		
		РасчетЦен = 2; // по прайс-листу
		
		Элементы.РасчетЦен.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.РасчетЦен.ТолькоПросмотр = Ложь;

	КонецЕсли;	
	
	РасчетЦенПриИзменении();
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Склад) И Объект.ТоварыВКоробках Тогда
		ЗаполнениеДаннымиПоКоробномуСкладу();
	Иначе
		ЗаполнитьТаблицуОстатковДляНеКоробногоСклада(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДаннымиПоКоробномуСкладу()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
	СхемаКомпоновки = ОтчетОбъект.ПолучитьМакет("СхемаКомпоновки");
	
	Объект.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	Объект.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	СхемаКомпоновкиНоменклатуры = ОтчетОбъект.ПолучитьМакет("СхемаКомпоновкиНоменклатуры");
	
	Объект.КомпоновщикНастроекНоменклатуры.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиНоменклатуры));
	Объект.КомпоновщикНастроекНоменклатуры.ЗагрузитьНастройки(СхемаКомпоновкиНоменклатуры.НастройкиПоУмолчанию);
	
	ДатаПолученияЦен = ТекущаяДата();
	
	СхемаКомпоновки1 = ОтчетОбъект.ПолучитьМакет("СхемаКомпоновки1");
	
	Объект.КомпоновщикНастроек1.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки1));
	Объект.КомпоновщикНастроек1.ЗагрузитьНастройки(СхемаКомпоновки1.НастройкиПоУмолчанию);
	
	ЗаполнитьПоОстаткам(ОтчетОбъект, СхемаКомпоновки, СхемаКомпоновкиНоменклатуры, СхемаКомпоновки1);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если РасчетЦен = 2 И Не ЗначениеЗаполнено(Объект.ВидЦены) Тогда // по прайс-листу
		
		ПоказатьПредупреждение(, "При расчете цен по прайс-листу необходимо указать вид цен");
		
		Возврат;
		
	КонецЕсли;	
	
	УстановитьЗначениеТоварыВКоробах();
	
	Заполнить(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(ПервоеОткрытие)
	
	Если Не ПервоеОткрытие И НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		ТекстСообщения = НСтр("ru = 'Не указан Склад!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ЗаполнитьНаСервере(Отказ);
	
	Если Отказ Тогда
		ОчиститьДеревоЗначений();
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСтоимостьОтмеченныхКОтгрузкеТоваровКлиент();
	
	// При повторном заполнении дерево свернуто и его нужно развернуть
	Если Не ПервоеОткрытие Тогда
		РазвернутьДеревоДокументов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбщуюСтоимостьОтмеченныхКОтгрузкеТоваровКлиент()
	
	Элементы.ДеревоДокументовВыставитьСчета.Доступность = Ложь; // СадомцевСА 12.02.2024
	
	Объект.СтоимостьОтмеченныхКОтгрузкеТоваров 		= 0;
	Объект.КоличествоОтмеченныхКОтгрузкеТоваров 	= 0;
	Объект.КоличествоКоробов 						= 0;
	Объект.КоличествоПарВКоробах 					= 0;
	
	Если Объект.ТоварыВКоробках Тогда
		Для Каждого Строка Из ДеревоДокументов.ПолучитьЭлементы() Цикл
			Для Каждого Строка_Н Из Строка.ПолучитьЭлементы() Цикл
				// Очищается номер
				Строка_Н.ДокументПоступленияНомер = "";
				
				Для Каждого Строка_ТТ Из Строка_Н.ПолучитьЭлементы() Цикл
					
					Для Каждого Строка_Т Из Строка_ТТ.ПолучитьЭлементы() Цикл
						
						Если Строка_Т.Отгрузить
							И (ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
							Или ЗначениеЗаполнено(Строка_Т.Номенклатура)) Тогда
							
							Объект.СтоимостьОтмеченныхКОтгрузкеТоваров 		= Объект.СтоимостьОтмеченныхКОтгрузкеТоваров + Строка_Т.Стоимость;
							Объект.КоличествоОтмеченныхКОтгрузкеТоваров 	= Объект.КоличествоОтмеченныхКОтгрузкеТоваров + Строка_Т.КоличествоОтгрузить;
							Объект.КоличествоКоробов 						= Объект.КоличествоКоробов + 1;
							Объект.КоличествоПарВКоробах 					= Объект.КоличествоПарВКоробах + Строка_Т.КоличествоНоменклатуры;
							
						КонецЕсли;
						
						// СадомцевСА 12.02.2024
						Если Строка_Т.Отгрузить Тогда
							Элементы.ДеревоДокументовВыставитьСчета.Доступность = Истина;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ДеревоДокументов.ПолучитьЭлементы() Цикл
		Для Каждого Строка_Н Из Строка.ПолучитьЭлементы() Цикл
			// Очищается номер
			Строка_Н.ДокументПоступленияНомер = "";
			
			Для Каждого Строка_Т Из Строка_Н.ПолучитьЭлементы() Цикл
				
				Если Строка_Т.Отгрузить
					И (ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
					Или ЗначениеЗаполнено(Строка_Т.Номенклатура)) Тогда
					
					Объект.СтоимостьОтмеченныхКОтгрузкеТоваров 		= Объект.СтоимостьОтмеченныхКОтгрузкеТоваров + Строка_Т.Стоимость;
					Объект.КоличествоОтмеченныхКОтгрузкеТоваров 	= Объект.КоличествоОтмеченныхКОтгрузкеТоваров + Строка_Т.КоличествоОтгрузить;
					Объект.КоличествоКоробов 						= Объект.КоличествоКоробов + 1;
					Объект.КоличествоПарВКоробах 					= Объект.КоличествоПарВКоробах + Строка_Т.КоличествоНоменклатуры;
					
				КонецЕсли;
				
				// СадомцевСА 12.02.2024
				Если Строка_Т.Отгрузить Тогда
					Элементы.ДеревоДокументовВыставитьСчета.Доступность = Истина;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткам(ОтчетОбъект, СхемаКомпоновки, СхемаКомпоновкиНоменклатуры, СхемаКомпоновки1)
	
	// ++ Галфинд ВолковЕВ 04.03.2024 Глобальное изменение получения данным с учетом статуса КМ.
	// Формирование дерева значений в момент вывода макета пользователю на форму.
	// Доработан вывод на форму для отгрузки не парных позиций в упаковочных листах которые не имеют статуса КМ.
	// Временно продублированы и изменены основные функции и процедуры на время опытного тестирования.
	//Дерево = ПолучитьРезультатКомпоновкиДанных(ОтчетОбъект.Склад, ОтчетОбъект.Клиент, СхемаКомпоновки, ОтчетОбъект.ОтборЗаказ);
	ТЗДляДерева = ПолучитьРезультатКомпоновкиДанных2(ОтчетОбъект.Склад, ОтчетОбъект.Клиент, СхемаКомпоновки, ОтчетОбъект.ОтборЗаказ);
	Дерево = Неопределено;
	
	Объект.Наличие.Очистить();
	//Объект.ДоступностьУпаковочныхЛистов.Очистить();
	ДоступностьУпаковочныхЛистов = Новый ТаблицаЗначений;
	ДоступностьУпаковочныхЛистов.Колонки.Добавить("УпаковочныйЛист");
	ДоступностьУпаковочныхЛистов.Колонки.Добавить("Проверка");
	
	//СтруктураС_ТЗ = ЗаполнитьТаблицуОстатков(Дерево, ОтчетОбъект.Склад, СхемаКомпоновкиНоменклатуры);
	СтруктураС_ТЗ = ЗаполнитьТаблицуОстатков2(ТЗДляДерева, ОтчетОбъект.Склад, СхемаКомпоновкиНоменклатуры);
	
	// Проверка доступности номенклатуры для формирования расходного ордера,
	// формирование списка упаковочных листов не прошедших проверку
	//ПроверкаДоступностиНоменклатуры(Дерево, СтруктураС_ТЗ);
	ПроверкаДоступностиНоменклатуры2(ТЗДляДерева, СтруктураС_ТЗ, ДоступностьУпаковочныхЛистов);
	
	// Удаление строк с упаковочными листами по которым не достаточно номенклатуры для формирования расходного ордера
	//УдалениеСтрокСУпаковочнымиЛистамиСверхДоступныхОстатков(Дерево);
	УдалениеСтрокСУпаковочнымиЛистамиСверхДоступныхОстатков2(ТЗДляДерева, ДоступностьУпаковочныхЛистов);
	
	// Удаление родителей строк где отсутсвуют упаковочные лмсты полностью
	//УдалитьСтрокиБезУпаковочногоЛиста(Дерево);
	
	//РассчитатьЛимиты(Дерево);
	РассчитатьЛимиты2(ТЗДляДерева);
	
	//ПолучитьБлокировки(Дерево);
	
	ВнешнийНаборДанных = Новый Структура;
	ВнешнийНаборДанных.Вставить("ТаблицаДанных", ТЗДляДерева);
	
	СхемаКомпоновкиДанных = СхемаКомпоновки1;
	
	КомпоновщикНастроек = Объект.КомпоновщикНастроек1;

	Компоновщик = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = Компоновщик.Выполнить(СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки() , , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
	
	Дерево = Новый ДеревоЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(Дерево);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// -- Галфинд ВолковЕВ 04.03.2024
	
	ДеревоДокументовЭлементы = ДеревоДокументов.ПолучитьЭлементы();
	ДеревоДокументовЭлементы.Очистить();
	
	ЗаполнитьСвойстваСтроки(ДеревоДокументов, Дерево.Строки);
	
КонецПроцедуры

Функция ЗаполнитьТаблицуОстатков(Дерево, Склад, СхемаКомпоновкиДанных)
	
	ТЗУпаковочныеЛисты = Новый ТаблицаЗначений;
	ТЗУпаковочныеЛисты.Колонки.Добавить("УпаковочныйЛист");
	// Заказы необходимы для получения таблицы "Товары" для последующей выгрузки и проверки
	// доступности номенклатуры (оптимизация вемени вывода информации пользователю).
	ТЗУпаковочныеЛисты.Колонки.Добавить("Заказ");
	
	// ++ Галфинд Волков 2024/01/18
	ТаблСписокЗаказов = Объект.СписокЗаказов;
	//ТаблСписокЗаказов.Колонки.Добавить("Заказ");
	// -- Галфинд Волков 2024/01/18
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				Стр = ТЗУпаковочныеЛисты.Добавить();
				Стр.УпаковочныйЛист = Строка_Т.УпаковочныйЛистСсылка;
				Стр.Заказ = Строка_Т.Заказ;
				// ++ Галфинд Волков 22.09.2023 Перенесено в основной запрос
				// // Стоимость с НДС
				// Если ЗначениеЗаполнено(Строка_Т.СтавкаНДС) Тогда
				//	// Стоимость, в данном случае, цена короба (из-за того что колонка общая для коробного и не коробного склада).
				//	// КоличествоОстаток всегда один, короб уникальный.
				//	Строка_Т.Стоимость = Строка_Т.Стоимость * Строка_Т.КоличествоОстаток * (1 + Строка_Т.СтавкаНДС.Ставка/100);
				// КонецЕсли;
				// -- Галфинд Волков 22.09.2023
				
				// ++ Галфинд Волков 2024/01/18
				ТаблСписокЗаказов.Добавить(Строка_Т.Заказ);
				// -- Галфинд Волков 2024/01/18
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СсылкиНаДокументы = ТЗУпаковочныеЛисты.ВыгрузитьКолонку("УпаковочныйЛист");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкиНаДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗНоменклатура = РезультатЗапроса.Выгрузить();
	
	ТЗНоменклатура.Свернуть("Номенклатура");
	
	КомпоновщикНастроек = Объект.КомпоновщикНастроекНоменклатуры;
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	ГруппировкаДетальныеПоля = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныеПоля.Использование = Истина;
	АвтоПоле = ГруппировкаДетальныеПоля.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПоле.Использование = Истина;
	
	ПолеПараметрыДанных				= Новый ПолеКомпоновкиДанных("ПараметрыДанных");
	ПолеСистемныеПоля				= Новый ПолеКомпоновкиДанных("СистемныеПоля");
	
	Для Каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование	= Не (ПолеВыбора.Поле = ПолеПараметрыДанных ИЛИ ПолеВыбора.Поле = ПолеСистемныеПоля);
		ВыбранноеПоле.Поле			= ПолеВыбора.Поле;
	КонецЦикла;
	
	ПараметрОбособленныеТовары = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(
		"ПоказатьОбособленныеТовары");
	Если ПараметрОбособленныеТовары <> Неопределено Тогда
		ПараметрОбособленныеТовары.Значение = Истина;
	КонецЕсли;                   
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Предоплата", СвойствоДоговораПредоплата);
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= ТЗНоменклатура.ВыгрузитьКолонку("Номенклатура");
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= Склад;
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;
	
	ТекстЗапросаВесУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
		"Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесНоменклатуры", ТекстЗапросаВесУпаковки);
		
	ТекстЗапросаОбъемУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
		"Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемНоменклатуры", ТекстЗапросаОбъемУпаковки);
	
	//Если ОтборПредоплатныхКлиентов = 1 Тогда
	//	
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "Таблица.ПредоплатныйДоговор");
	//	
	//ИначеЕсли ОтборПредоплатныхКлиентов = 2 Тогда
	//	
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "Не Таблица.ПредоплатныйДоговор");
	//	
	//Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "ИСТИНА");
		
	//КонецЕсли;	
	
	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, , , ТипГенератора);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ТаблицаКомпоновкаДанных = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьОбъект(ТаблицаКомпоновкаДанных);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСДанными.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	|	ТаблицаСДанными.Номенклатура КАК Номенклатура,
	|	ТаблицаСДанными.Характеристика КАК Характеристика,
	|	ТаблицаСДанными.Доступно КАК Доступно
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаСДанными КАК ТаблицаСДанными
	|ГДЕ
	|	НЕ ТаблицаСДанными.ЗаказНаОтгрузку = Неопределено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Доступно КАК Доступно
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТаблицаСДанными", ТаблицаКомпоновкаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатВыборки = РезультатЗапроса.Выгрузить();
	
	Объект.Наличие.Загрузить(РезультатВыборки);
	
	СсылкиНаДокументы = ТЗУпаковочныеЛисты.ВыгрузитьКолонку("УпаковочныйЛист");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистТовары.Ссылка КАК Ссылка,
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
		|	УпаковочныйЛистТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЛОЖЬ КАК Проверка
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкиНаДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Результат = РезультатЗапроса.Выгрузить();
	
	СсылкиНаЗаказы = ТЗУпаковочныеЛисты.ВыгрузитьКолонку("Заказ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка КАК ЗаказКлиентаСсылка,
		|	УпаковочныйЛист.Ссылка КАК УпаковочныйЛистСсылка
		|ИЗ
		|	Документ.ЗаказКлиента.гф_ТоварыВКоробах КАК ЗаказКлиентагф_ТоварыВКоробах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист КАК УпаковочныйЛист
		|		ПО ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации = УпаковочныйЛист.гф_Комплектация
		|ГДЕ
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкиНаЗаказы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_РезультатЗаказы = РезультатЗапроса.Выгрузить();
	
	Возврат Новый Структура("УпаковочныеЛистыСТаблицейТовары, НаличиеНоменклатурыИзКомпоновкиДанных, ЗаказУпаковочныеЛисты", ТЗ_Результат, РезультатВыборки, ТЗ_РезультатЗаказы);
	
КонецФункции

Функция ЗаполнитьТаблицуОстатков2(ТЗДляДерева, Склад, СхемаКомпоновкиДанных)
	
	ТЗУпаковочныеЛисты = Новый ТаблицаЗначений;	
	
	ТЗУпаковочныеЛисты = ТЗДляДерева.Скопировать( ,"УпаковочныйЛистСсылка, Заказ");
	
	ТЗУпаковочныеЛисты.Свернуть("УпаковочныйЛистСсылка, Заказ");
	
	СсылкиНаУпаковочныеЛисты = ТЗУпаковочныеЛисты.ВыгрузитьКолонку("УпаковочныйЛистСсылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Назначение КАК Назначение,
		|	УпаковочныйЛистТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкиНаУпаковочныеЛисты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗНоменклатураУпаковочногоЛиста = РезультатЗапроса.Выгрузить();
	
	МассивУдалитьУЛ = Новый Массив;
	
	// Поиск и удаление упаковочных листов из общего списка где номенклатура в упаковочном листе с техническим
	// статусом или с пустым значением
	Для Каждого Стр Из ТЗНоменклатураУпаковочногоЛиста Цикл
		
		Если Не ЗначениеЗаполнено(Стр.Назначение)
			Или Стр.Назначение = Справочники.Назначения.гф_Техническое
			Или Стр.Назначение = Справочники.Назначения.ПустаяСсылка() Тогда
			
			Индекс = МассивУдалитьУЛ.Найти(Стр.Ссылка);
			Если Индекс = Неопределено Тогда
				МассивУдалитьУЛ.Добавить(Стр.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого МассивСтр Из МассивУдалитьУЛ Цикл
		
		ОтборУЛ = Новый Структура();
		ОтборУЛ.Вставить("Ссылка", МассивСтр);
		МассивНайдСтрКомплектации = ТЗНоменклатураУпаковочногоЛиста.НайтиСтроки(ОтборУЛ);
		// Убираем номенклатуру с техническим статусом или с пустым значением,
		// что бы не выполнять поиск остатков по таким позициям
		Для Каждого МассивСтр2 Из МассивНайдСтрКомплектации Цикл
			ТЗНоменклатураУпаковочногоЛиста.Удалить(МассивСтр2);
		КонецЦикла;
		
		ОтборУЛ = Новый Структура();
		ОтборУЛ.Вставить("УпаковочныйЛистСсылка", МассивСтр);
		МассивНайдСтрТЗДляДерева = ТЗДляДерева.НайтиСтроки(ОтборУЛ);
		// Убираем строки из общего списка упаковочных листов для отгрузки у которых была выявлена номенклатура
		// с техническим статусом или с пустым значением
		Для Каждого МассивСтр2 Из МассивНайдСтрТЗДляДерева Цикл
			ТЗДляДерева.Удалить(МассивСтр2);
		КонецЦикла;
		
	КонецЦикла;
	
	ТЗНоменклатураУпаковочногоЛиста.Свернуть("Номенклатура");
	
	КомпоновщикНастроек = Объект.КомпоновщикНастроекНоменклатуры;
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	ГруппировкаДетальныеПоля = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныеПоля.Использование = Истина;
	АвтоПоле = ГруппировкаДетальныеПоля.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПоле.Использование = Истина;
	
	ПолеПараметрыДанных				= Новый ПолеКомпоновкиДанных("ПараметрыДанных");
	ПолеСистемныеПоля				= Новый ПолеКомпоновкиДанных("СистемныеПоля");
	
	Для Каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование	= Не (ПолеВыбора.Поле = ПолеПараметрыДанных ИЛИ ПолеВыбора.Поле = ПолеСистемныеПоля);
		ВыбранноеПоле.Поле			= ПолеВыбора.Поле;
	КонецЦикла;
	
	ПараметрОбособленныеТовары = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(
		"ПоказатьОбособленныеТовары");
	Если ПараметрОбособленныеТовары <> Неопределено Тогда
		ПараметрОбособленныеТовары.Значение = Истина;
	КонецЕсли;                   
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Предоплата", СвойствоДоговораПредоплата);
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= ТЗНоменклатураУпаковочногоЛиста.ВыгрузитьКолонку("Номенклатура");
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= Склад;
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;
	
	ТекстЗапросаВесУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
		"Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесНоменклатуры", ТекстЗапросаВесУпаковки);
		
	ТекстЗапросаОбъемУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
		"Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемНоменклатуры", ТекстЗапросаОбъемУпаковки);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "ИСТИНА");	
	
	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, , , ТипГенератора);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ТаблицаКомпоновкаДанных = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьОбъект(ТаблицаКомпоновкаДанных);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСДанными.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	|	ТаблицаСДанными.Номенклатура КАК Номенклатура,
	|	ТаблицаСДанными.Характеристика КАК Характеристика,
	|	ТаблицаСДанными.Доступно КАК Доступно
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаСДанными КАК ТаблицаСДанными
	|ГДЕ
	|	НЕ ТаблицаСДанными.ЗаказНаОтгрузку = Неопределено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.ЗаказНаОтгрузку КАК ЗаказНаОтгрузку,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.Доступно КАК Доступно
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТаблицаСДанными", ТаблицаКомпоновкаДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатВыборки = РезультатЗапроса.Выгрузить();
	
	Объект.Наличие.Загрузить(РезультатВыборки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистТовары.Ссылка КАК Ссылка,
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
		|	УпаковочныйЛистТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЛОЖЬ КАК Проверка
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкиНаУпаковочныеЛисты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Результат = РезультатЗапроса.Выгрузить();
	
	СсылкиНаЗаказы = ТЗУпаковочныеЛисты.ВыгрузитьКолонку("Заказ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка КАК ЗаказКлиентаСсылка,
		|	УпаковочныйЛист.Ссылка КАК УпаковочныйЛистСсылка
		|ИЗ
		|	Документ.ЗаказКлиента.гф_ТоварыВКоробах КАК ЗаказКлиентагф_ТоварыВКоробах
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист КАК УпаковочныйЛист
		|		ПО ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации = УпаковочныйЛист.гф_Комплектация
		|ГДЕ
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкиНаЗаказы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_РезультатЗаказы = РезультатЗапроса.Выгрузить();
	
	Возврат Новый Структура("УпаковочныеЛистыСТаблицейТовары, НаличиеНоменклатурыИзКомпоновкиДанных, ЗаказУпаковочныеЛисты", ТЗ_Результат, РезультатВыборки, ТЗ_РезультатЗаказы);
		
КонецФункции	

Функция ПолучитьРезультатКомпоновкиДанных(Склад, Клиент, СхемаКомпоновкиДанных)
	
	КомпоновщикНастроек = Объект.КомпоновщикНастроек;
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("ТипУпаковки", Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);
	ПараметрыДанных.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	ПараметрыДанных.УстановитьЗначениеПараметра("Склад", Склад);
	ПараметрыДанных.УстановитьЗначениеПараметра("Клиент", Клиент);
	ПараметрыДанных.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	ПараметрыДанных.УстановитьЗначениеПараметра("Предоплата", СвойствоДоговораПредоплата);
	
	Если ОтборПредоплатныхКлиентов = 1 Тогда
		
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос,
			"&ПредоплатныйДоговор", "ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор");
		
	ИначеЕсли ОтборПредоплатныхКлиентов = 2 Тогда
		
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос,
			"&ПредоплатныйДоговор", "Не ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор");
		
	Иначе
		
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос,
			"&ПредоплатныйДоговор", "ИСТИНА");
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос,
			"ДвижениеКМ.Склад = &Склад", "ДвижениеКМ.Склад.*");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос,
			"ЗаказКлиента.Партнер = &Клиент", "ЗаказКлиента.Партнер.*");
	КонецЕсли;
	
	Компоновщик = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = Компоновщик.Выполнить(СхемаКомпоновкиДанных,
		КомпоновщикНастроек.ПолучитьНастройки() , , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	Дерево = Новый ДеревоЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ПроцессорВывода.УстановитьОбъект(Дерево);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Дерево;
	
КонецФункции

Функция ПолучитьРезультатКомпоновкиДанных2(Склад, Клиент, СхемаКомпоновкиДанных, ОтборЗаказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	гф_ДвижениеКодовМаркировкиОрганизацииОстатки.КМ КАК МультиупаковкаКМ,
		|	гф_ДвижениеКодовМаркировкиОрганизацииОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВЫРАЗИТЬ(""Упак."" КАК СТРОКА(5)) КАК ЕдиницаИзмерения,
		|	гф_ДвижениеКодовМаркировкиОрганизацииОстатки.Склад КАК Склад,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	УпаковочныйЛист.гф_Поставка КАК ДокументПоступления,
		|	ВЫБОР
		|		КОГДА ПриобретениеТоваровУслуг.Номер ЕСТЬ NULL
		|				И ТИПЗНАЧЕНИЯ(УпаковочныйЛист.гф_Поставка) = ТИП(Документ.ВводОстатковТоваров)
		|			ТОГДА ВЫРАЗИТЬ(УпаковочныйЛист.гф_Поставка КАК Документ.ВводОстатковТоваров).Номер
		|		ИНАЧЕ ПриобретениеТоваровУслуг.Номер
		|	КОНЕЦ КАК ДокументПоступленияНомер,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(ПриобретениеТоваровУслуг.Дата, &ТекущаяДата, ДЕНЬ) ЕСТЬ NULL
		|				И ТИПЗНАЧЕНИЯ(УпаковочныйЛист.гф_Поставка) = ТИП(Документ.ВводОстатковТоваров)
		|			ТОГДА РАЗНОСТЬДАТ(ВЫРАЗИТЬ(УпаковочныйЛист.гф_Поставка КАК Документ.ВводОстатковТоваров).Дата, &ТекущаяДата, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(ПриобретениеТоваровУслуг.Дата, &ТекущаяДата, ДЕНЬ)
		|	КОНЕЦ КАК КоличествоДнейХранения,
		|	УпаковочныйЛист.гф_Заказ КАК Заказ,
		|	УпаковочныйЛист.Ссылка КАК УпаковочныйЛистСсылка,
		|	УпаковочныйЛист.гф_СостояниеКороба КАК СостояниеКороба,
		|	УпаковочныйЛист.Код КАК УпаковочныйЛистНомер,
		|	УпаковочныйЛист.гф_Агрегация КАК гф_Агрегация,
		|	УпаковочныйЛист.Дата КАК Дата,
		|	УпаковочныйЛист.гф_Комплектация КАК Артикул,
		|	СправочникНоменклатура.ВидНоменклатуры.ОсобенностьУчета КАК ОсобенностьУчета,
		|	УпаковочныйЛист.гф_Заказ.Партнер КАК гф_ЗаказПартнер,
		|	УпаковочныйЛист.гф_Комплектация КАК УпаковочныйЛистКомплектация
		|ПОМЕСТИТЬ УпаковочныйЛистДанные
		|ИЗ
		|	РегистрНакопления.гф_ДвижениеКодовМаркировкиОрганизации.Остатки(
		|			,
		|			Склад = &Склад
		|				И Организация = &Организация) КАК гф_ДвижениеКодовМаркировкиОрганизацииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО гф_ДвижениеКодовМаркировкиОрганизацииОстатки.КМ = ШтрихкодыУпаковокТоваров.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист КАК УпаковочныйЛист
		|		ПО (ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = УпаковочныйЛист.Код)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО (УпаковочныйЛист.гф_Комплектация = ВариантыКомплектацииНоменклатуры.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО (ВариантыКомплектацииНоменклатуры.Владелец = СправочникНоменклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|		ПО (УпаковочныйЛист.гф_Поставка = ПриобретениеТоваровУслуг.Ссылка)
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки = &ТипУпаковки
		|	И НЕ ШтрихкодыУпаковокТоваров.гф_Автодействие = ЗНАЧЕНИЕ(Перечисление.гф_АвтодействияКМ.Подготовлен)
		|	И НЕ УпаковочныйЛист.гф_Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|	И (УпаковочныйЛист.гф_СостояниеКороба.Наименование = ""Полный комплект""
		|			ИЛИ УпаковочныйЛист.гф_СостояниеКороба.Наименование = ""Пересорт""
		|			ИЛИ УпаковочныйЛист.гф_СостояниеКороба.Наименование = ""Не полный""
		|			ИЛИ УпаковочныйЛист.гф_СостояниеКороба.Наименование = ""Не полный и пересорт"")
		|	И НЕ УпаковочныйЛист.гф_Заказ.Партнер ЕСТЬ NULL
		|	И УпаковочныйЛист.гф_Заказ.Проведен
		|	И НЕ УпаковочныйЛист.гф_Заказ.ПометкаУдаления
		|	И НЕ УпаковочныйЛист.гф_Заказ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
		|	И УпаковочныйЛист.гф_Заказ.Партнер = &Клиент
		|	И УпаковочныйЛист.гф_Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистДанные.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
		|	УпаковочныйЛистДанные.МультиупаковкаКМ КАК МультиупаковкаКМ,
		|	УпаковочныйЛистДанные.КоличествоОстаток КАК КоличествоОстаток,
		|	УпаковочныйЛистДанные.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	УпаковочныйЛистДанные.ДокументПоступления КАК ДокументПоступления,
		|	УпаковочныйЛистДанные.ДокументПоступленияНомер КАК ДокументПоступленияНомер,
		|	УпаковочныйЛистДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УпаковочныйЛистДанные.КоличествоДнейХранения КАК КоличествоДнейХранения,
		|	УпаковочныйЛистДанные.Заказ КАК Заказ,
		|	УпаковочныйЛистДанные.СостояниеКороба КАК СостояниеКороба,
		|	УпаковочныйЛистДанные.УпаковочныйЛистНомер КАК УпаковочныйЛистНомер,
		|	УпаковочныйЛистДанные.гф_Агрегация КАК гф_Агрегация,
		|	УпаковочныйЛистДанные.Дата КАК Дата,
		|	УпаковочныйЛистДанные.Артикул КАК Артикул,
		|	СУММА(УпаковочныйЛистТовары.Количество) КАК Количество,
		|	УпаковочныйЛистДанные.УпаковочныйЛистКомплектация КАК УпаковочныйЛистКомплектация,
		|	УпаковочныйЛистДанные.ОсобенностьУчета КАК ОсобенностьУчета
		|ПОМЕСТИТЬ УпаковочныйЛистТоварыКоличество
		|ИЗ
		|	УпаковочныйЛистДанные КАК УпаковочныйЛистДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|		ПО УпаковочныйЛистДанные.УпаковочныйЛистСсылка = УпаковочныйЛистТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	УпаковочныйЛистДанные.МультиупаковкаКМ,
		|	УпаковочныйЛистДанные.КоличествоОстаток,
		|	УпаковочныйЛистДанные.ЗначениеШтрихкода,
		|	УпаковочныйЛистДанные.ДокументПоступления,
		|	УпаковочныйЛистДанные.ДокументПоступленияНомер,
		|	УпаковочныйЛистДанные.ЕдиницаИзмерения,
		|	УпаковочныйЛистДанные.КоличествоДнейХранения,
		|	УпаковочныйЛистДанные.Заказ,
		|	УпаковочныйЛистДанные.УпаковочныйЛистСсылка,
		|	УпаковочныйЛистДанные.СостояниеКороба,
		|	УпаковочныйЛистДанные.УпаковочныйЛистНомер,
		|	УпаковочныйЛистДанные.гф_Агрегация,
		|	УпаковочныйЛистДанные.Дата,
		|	УпаковочныйЛистДанные.Артикул,
		|	УпаковочныйЛистДанные.УпаковочныйЛистКомплектация,
		|	УпаковочныйЛистДанные.ОсобенностьУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистДанные.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
		|	ЗаказКлиента.Партнер КАК Клиент,
		|	ЗаказКлиента.Склад КАК Склад,
		|	ЗаказКлиента.Организация КАК Организация,
		|	ЗаказКлиента.Договор КАК Договор,
		|	ЗаказКлиента.гф_АдресДоставки КАК АдресДоставки,
		|	гф_АдресаДоставки.НомерАдреса КАК НомерАдреса,
		|	ЗаказКлиента.гф_ОтгрузкаПеремещением КАК ОтгрузкаПеремещением,
		|	УпаковочныйЛистДанные.ДокументПоступления КАК ДокументПоступления,
		|	УпаковочныйЛистДанные.ДокументПоступленияНомер КАК ДокументПоступленияНомер,
		|	УпаковочныйЛистДанные.Заказ КАК Заказ,
		|	УпаковочныйЛистДанные.СостояниеКороба КАК СостояниеКороба,
		|	УпаковочныйЛистДанные.КоличествоОстаток КАК КоличествоОстаток,
		|	УпаковочныйЛистДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УпаковочныйЛистДанные.КоличествоДнейХранения КАК КоличествоДнейХранения,
		|	УпаковочныйЛистДанные.МультиупаковкаКМ КАК МультиупаковкаКМ,
		|	УпаковочныйЛистДанные.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	УпаковочныйЛистДанные.гф_Агрегация КАК гф_Агрегация,
		|	УпаковочныйЛистДанные.УпаковочныйЛистНомер КАК УпаковочныйЛистНомер,
		|	УпаковочныйЛистДанные.Артикул КАК Артикул,
		|	"""" КАК ШтрихкодНоменклатуры,
		|	0 КАК КоличествоНоменклатуры,
		|	ЕСТЬNULL(гф_ПричиныБлокировокСрезПоследнихПоДоговору.Заблокирован, ЛОЖЬ) КАК БлокировкиОтгрузок,
		|	УпаковочныйЛистДанные.Количество КАК КоличествоНоменклатурыВУпаковочномЛисте,
		|	ЕСТЬNULL(ЗаказКлиентагф_ТоварыВКоробах.Скидка, 1) КАК Скидка,
		|	ЕСТЬNULL(ЗаказКлиентагф_ТоварыВКоробах.ЦенаКороба, 0) КАК ЦенаУпаковочногоЛиста,
		|	УпаковочныйЛистДанные.УпаковочныйЛистКомплектация КАК УпаковочныйЛистКомплектация,
		|	УпаковочныйЛистДанные.ОсобенностьУчета КАК ОсобенностьУчета
		|ПОМЕСТИТЬ УпаковочныйЛистДанныеЗаказов
		|ИЗ
		|	УпаковочныйЛистТоварыКоличество КАК УпаковочныйЛистДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ПО УпаковочныйЛистДанные.Заказ = ЗаказКлиента.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_АдресаДоставки КАК гф_АдресаДоставки
		|		ПО (ЗаказКлиента.гф_АдресДоставки = гф_АдресаДоставки.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.гф_ТоварыВКоробах КАК ЗаказКлиентагф_ТоварыВКоробах
		|		ПО (ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации = УпаковочныйЛистДанные.Артикул)
		|			И (ЗаказКлиентагф_ТоварыВКоробах.Ссылка = ЗаказКлиента.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(&Период, ) КАК гф_ПричиныБлокировокСрезПоследнихПоДоговору
		|		ПО (ЗаказКлиента.Партнер = гф_ПричиныБлокировокСрезПоследнихПоДоговору.Контрагент)
		|			И (ЗаказКлиента.Договор = гф_ПричиныБлокировокСрезПоследнихПоДоговору.ДоговорКонтрагента)
		|			И (ЗаказКлиента.Организация = гф_ПричиныБлокировокСрезПоследнихПоДоговору.Организация)
		|ГДЕ
		|	НЕ ЗаказКлиента.Номер ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистДанныеЗаказов.Заказ КАК Заказ,
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК ШтрихкодНоменклатуры,
		|	УпаковочныйЛистДанныеЗаказов.Договор КАК Договор
		|ПОМЕСТИТЬ ШтрихкодыНоменклатуры
		|ИЗ
		|	УпаковочныйЛистДанныеЗаказов КАК УпаковочныйЛистДанныеЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО УпаковочныйЛистДанныеЗаказов.гф_Агрегация = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШтрихкодыНоменклатуры.Заказ КАК Заказ,
		|	ШтрихкодыНоменклатуры.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
		|	ШтрихкодыНоменклатуры.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		// |	ВЫБОР
		// |		КОГДА ШтрихкодыУпаковокТоваров.гф_Статус ЕСТЬ NULL
		// |			ТОГДА ""Не пустой""
		// |		ИНАЧЕ ВЫБОР
		// |				КОГДА ШтрихкодыУпаковокТоваров.гф_Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиИСМП.ПустаяСсылка)
		// |					ТОГДА ""Не пустой""
		// |				ИНАЧЕ ШтрихкодыУпаковокТоваров.гф_Статус
		// |			КОНЕЦ
		// |	КОНЕЦ КАК СтатусКМ,
		|	ШтрихкодыУпаковокТоваров.гф_Статус КАК СтатусКМ,
		|	1 КАК КоличествоНоменклатуры,
		|	ШтрихкодыНоменклатуры.Договор КАК Договор
		|ПОМЕСТИТЬ ШтрихкодыНоменклатурыСтатус
		|ИЗ
		|	ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО ШтрихкодыНоменклатуры.ШтрихкодНоменклатуры = ШтрихкодыУпаковокТоваров.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШтрихкодыНоменклатурыСтатус.Заказ КАК Заказ,
		|	ШтрихкодыНоменклатурыСтатус.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
		|	ШтрихкодыНоменклатурыСтатус.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
		|	ШтрихкодыНоменклатурыСтатус.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатурыСтатус.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатурыСтатус.СтатусКМ КАК СтатусКМ,
		|	СУММА(ШтрихкодыНоменклатурыСтатус.КоличествоНоменклатуры) КАК КоличествоНоменклатуры,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	ШтрихкодыНоменклатурыСтатус.Договор КАК Договор,
		|	СправочникСтавкиНДС.Ставка КАК СтавкаНДС,
		|	НЕ ДоговорыКонтрагентовДополнительныеРеквизиты.Значение ЕСТЬ NULL КАК ПредоплатныйДоговор,
		|	СправочникСтавкиНДС.Ссылка КАК СтавкаНДССсылка
		|ПОМЕСТИТЬ ЗаказНоменклатураХарактеристика
		|ИЗ
		|	ШтрихкодыНоменклатурыСтатус КАК ШтрихкодыНоменклатурыСтатус
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО ШтрихкодыНоменклатурыСтатус.Заказ = ЗаказКлиентаТовары.Ссылка
		|			И ШтрихкодыНоменклатурыСтатус.Номенклатура = ЗаказКлиентаТовары.Номенклатура
		|			И ШтрихкодыНоменклатурыСтатус.Характеристика = ЗаказКлиентаТовары.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СправочникСтавкиНДС
		|		ПО (СправочникСтавкиНДС.Ссылка = ЗаказКлиентаТовары.СтавкаНДС)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
		|		ПО ШтрихкодыНоменклатурыСтатус.Договор = ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка
		|			И (ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство = &Предоплата)
		|ГДЕ
		|	ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
		|
		|СГРУППИРОВАТЬ ПО
		|	ШтрихкодыНоменклатурыСтатус.Заказ,
		|	ШтрихкодыНоменклатурыСтатус.УпаковочныйЛистСсылка,
		|	ШтрихкодыНоменклатурыСтатус.ШтрихкодНоменклатуры,
		|	ШтрихкодыНоменклатурыСтатус.Номенклатура,
		|	ШтрихкодыНоменклатурыСтатус.Характеристика,
		|	ШтрихкодыНоменклатурыСтатус.СтатусКМ,
		|	ЗаказКлиентаТовары.Цена,
		|	ШтрихкодыНоменклатурыСтатус.Договор,
		|	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение,
		|	СправочникСтавкиНДС.Ставка,
		|	СправочникСтавкиНДС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛОЖЬ КАК Отгрузить,
		|	УпаковочныйЛистДанныеЗаказов.Клиент КАК Клиент,
		|	УпаковочныйЛистДанныеЗаказов.АдресДоставки КАК АдресДоставки,
		|	УпаковочныйЛистДанныеЗаказов.Склад КАК Склад,
		|	УпаковочныйЛистДанныеЗаказов.ДокументПоступления КАК ДокументПоступления,
		|	УпаковочныйЛистДанныеЗаказов.ДокументПоступленияНомер КАК ДокументПоступленияНомер,
		|	УпаковочныйЛистДанныеЗаказов.Заказ КАК Заказ,
		|	УпаковочныйЛистДанныеЗаказов.ОтгрузкаПеремещением КАК ОтгрузкаПеремещением,
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистСсылка КАК УпаковочныйЛистСсылка,
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистНомер КАК УпаковочныйЛистНомер,
		|	УпаковочныйЛистДанныеЗаказов.СостояниеКороба КАК СостояниеКороба,
		|	УпаковочныйЛистДанныеЗаказов.КоличествоОстаток КАК КоличествоОстаток,
		|	УпаковочныйЛистДанныеЗаказов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УпаковочныйЛистДанныеЗаказов.КоличествоДнейХранения КАК КоличествоДнейХранения,
		|	ЗаказНоменклатураХарактеристика.СтатусКМ КАК СтатусКМ,
		|	УпаковочныйЛистДанныеЗаказов.БлокировкиОтгрузок КАК БлокировкиОтгрузок,
		|	УпаковочныйЛистДанныеЗаказов.Организация КАК Организация,
		|	УпаковочныйЛистДанныеЗаказов.Артикул КАК Артикул,
		|	УпаковочныйЛистДанныеЗаказов.Договор КАК Договор,
		|	УпаковочныйЛистДанныеЗаказов.НомерАдреса КАК НомерАдреса,
		|	0 КАК ДействующийЛимит,
		|	ЛОЖЬ КАК Блокировка,
		|	"""" КАК УИСтрокиДереваЗначений,
		|	ИСТИНА КАК ТоварыВКоробках,
		|	ИСТИНА КАК Проверка,
		|	ЗаказНоменклатураХарактеристика.СтавкаНДС КАК СтавкаНДС,
		|	УпаковочныйЛистДанныеЗаказов.КоличествоНоменклатурыВУпаковочномЛисте КАК КоличествоНоменклатуры,
		|	УпаковочныйЛистДанныеЗаказов.ЦенаУпаковочногоЛиста * УпаковочныйЛистДанныеЗаказов.КоличествоОстаток * (1 + ЗаказНоменклатураХарактеристика.СтавкаНДС / 100) * (1 - УпаковочныйЛистДанныеЗаказов.Скидка / 100) КАК Стоимость,
		|	ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор КАК ПредоплатныйДоговор,
		|	УпаковочныйЛистДанныеЗаказов.Скидка КАК Скидка,
		|	УпаковочныйЛистДанныеЗаказов.ЦенаУпаковочногоЛиста КАК Цена,
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистКомплектация КАК УпаковочныйЛистКомплектация,
		|	УпаковочныйЛистДанныеЗаказов.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ЗаказНоменклатураХарактеристика.СтавкаНДССсылка КАК СтавкаНДССсылка
		|ИЗ
		|	УпаковочныйЛистДанныеЗаказов КАК УпаковочныйЛистДанныеЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказНоменклатураХарактеристика КАК ЗаказНоменклатураХарактеристика
		|		ПО УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистСсылка = ЗаказНоменклатураХарактеристика.УпаковочныйЛистСсылка
		|ГДЕ
		|	&ПредоплатныйДоговор
		|
		|СГРУППИРОВАТЬ ПО
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистСсылка,
		|	УпаковочныйЛистДанныеЗаказов.Клиент,
		|	УпаковочныйЛистДанныеЗаказов.Склад,
		|	УпаковочныйЛистДанныеЗаказов.ДокументПоступления,
		|	УпаковочныйЛистДанныеЗаказов.Заказ,
		|	УпаковочныйЛистДанныеЗаказов.СостояниеКороба,
		|	УпаковочныйЛистДанныеЗаказов.КоличествоОстаток,
		|	УпаковочныйЛистДанныеЗаказов.АдресДоставки,
		|	УпаковочныйЛистДанныеЗаказов.ДокументПоступленияНомер,
		|	УпаковочныйЛистДанныеЗаказов.ОтгрузкаПеремещением,
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистНомер,
		|	УпаковочныйЛистДанныеЗаказов.ЕдиницаИзмерения,
		|	УпаковочныйЛистДанныеЗаказов.КоличествоДнейХранения,
		|	ЗаказНоменклатураХарактеристика.СтатусКМ,
		|	УпаковочныйЛистДанныеЗаказов.Организация,
		|	УпаковочныйЛистДанныеЗаказов.Артикул,
		|	УпаковочныйЛистДанныеЗаказов.Договор,
		|	УпаковочныйЛистДанныеЗаказов.НомерАдреса,
		|	ЗаказНоменклатураХарактеристика.СтавкаНДС,
		|	УпаковочныйЛистДанныеЗаказов.КоличествоНоменклатурыВУпаковочномЛисте,
		|	УпаковочныйЛистДанныеЗаказов.БлокировкиОтгрузок,
		|	УпаковочныйЛистДанныеЗаказов.ЦенаУпаковочногоЛиста * УпаковочныйЛистДанныеЗаказов.КоличествоОстаток * (1 + ЗаказНоменклатураХарактеристика.СтавкаНДС / 100) * (1 - УпаковочныйЛистДанныеЗаказов.Скидка / 100),
		|	ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор,
		|	УпаковочныйЛистДанныеЗаказов.ЦенаУпаковочногоЛиста,
		|	УпаковочныйЛистДанныеЗаказов.Скидка,
		|	УпаковочныйЛистДанныеЗаказов.УпаковочныйЛистКомплектация,
		|	УпаковочныйЛистДанныеЗаказов.ОсобенностьУчета,
		|	ЗаказНоменклатураХарактеристика.СтавкаНДССсылка";
	
	Запрос.УстановитьПараметр("Заказ", ОтборЗаказ);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Организация", Склад.гф_Организация);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Предоплата", СвойствоДоговораПредоплата);
	// Запрос.УстановитьПараметр("ПредоплатныйДоговор", ПредоплатныйДоговор);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТипУпаковки", Перечисления.ТипыУпаковок.МультитоварнаяУпаковка);
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"И УпаковочныйЛист.гф_Заказ.Партнер = &Клиент", "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтборЗаказ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"И УпаковочныйЛист.гф_Заказ = &Заказ", "");
	КонецЕсли;
	
	Если ОтборПредоплатныхКлиентов = 1 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ПредоплатныйДоговор", "ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор");
	ИначеЕсли ОтборПредоплатныхКлиентов = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ПредоплатныйДоговор", "Не ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ПредоплатныйДоговор", "ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗРезультат = РезультатЗапроса.Выгрузить();
	
	Возврат ТЗРезультат;
	
КонецФункции

Процедура ПроверкаДоступностиНоменклатуры(Дерево, СтруктураС_ТЗ)
	
	НаличиеНоменклатурыИзКомпоновкиДанных = СтруктураС_ТЗ.НаличиеНоменклатурыИзКомпоновкиДанных;
	
	УпаковочныеЛистыСТаблицейТовары = СтруктураС_ТЗ.УпаковочныеЛистыСТаблицейТовары;
	
	// ++ Галфинд Волков 2024/01/18
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументТовары.Ссылка КАК ДокументОтгрузки
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.КодСтроки = 0
		|	И ДокументТовары.Ссылка В иерархии (&Распоряжение)";
	
	Запрос.УстановитьПараметр("Распоряжение", Объект.СписокЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблСписокЗаказовСПустымКодомСтроки = РезультатЗапроса.Выгрузить();
	// -- Галфинд Волков 2024/01/18
	
	// ++ Галфинд Волков 2023/12/18
	ЗаказУпаковочныеЛисты = СтруктураС_ТЗ.ЗаказУпаковочныеЛисты;
	// -- Галфинд Волков 2023/12/18
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
				Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
					
					МассивНоменклатурыПоЗаказу = НаличиеНоменклатурыИзКомпоновкиДанных.НайтиСтроки(Новый Структура("ЗаказНаОтгрузку", Строка_ТТ.Заказ));
					
					// ++ Галфинд Волков 2024/01/18
					//// ++ Галфинд Волков 2023/12/18
					//// ЗаполнитьРезервыНаСервере(Строка_Т.Заказ, Строка_Т.УпаковочныйЛистСсылка, УпаковочныеЛистыСТаблицейТовары, МассивНоменклатурыПоЗаказу);
					//ЗаполнитьРезервыНаСервере(Строка_Т.Заказ, Строка_Т.УпаковочныйЛистСсылка, УпаковочныеЛистыСТаблицейТовары, МассивНоменклатурыПоЗаказу, ЗаказУпаковочныеЛисты);
					//// -- Галфинд Волков 2023/12/18
					
					МассивНаличиеЗаказаСПустымКодомСтроки = ТаблСписокЗаказовСПустымКодомСтроки.НайтиСтроки(Новый Структура("ДокументОтгрузки", Строка_ТТ.Заказ));
					
					ЗаполнитьРезервыНаСервере(Строка_Т.Заказ, Строка_Т.УпаковочныйЛистСсылка, УпаковочныеЛистыСТаблицейТовары,
					МассивНоменклатурыПоЗаказу, ЗаказУпаковочныеЛисты, МассивНаличиеЗаказаСПустымКодомСтроки);
					// -- Галфинд Волков 2024/01/18
					
					ПоступленияНомер = Строка_Т.ДокументПоступленияНомер;
					
				КонецЦикла;
				Строка_ТТ.ДокументПоступленияНомер = ПоступленияНомер;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаДоступностиНоменклатуры2(Дерево, СтруктураС_ТЗ, ДоступностьУпаковочныхЛистов)
	
	НаличиеНоменклатуры = СтруктураС_ТЗ.НаличиеНоменклатурыИзКомпоновкиДанных;
	
	УпаковочныеЛистыСТаблицейТовары = СтруктураС_ТЗ.УпаковочныеЛистыСТаблицейТовары;
	
	ЗаказУпаковочныеЛисты = СтруктураС_ТЗ.ЗаказУпаковочныеЛисты;
		
	МассивСсылокНаЗаказы = Дерево.ВыгрузитьКолонку("Заказ");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка КАК ЗаказКлиентаСсылка,
		|	ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации КАК ВариантКомплектации,
		|	СУММА(ЗаказКлиентагф_ТоварыВКоробах.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказКлиента.гф_ТоварыВКоробах КАК ЗаказКлиентагф_ТоварыВКоробах
		|ГДЕ
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка,
		|	ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиентаСсылка,
		|	ВариантКомплектации,
		|	Количество";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСсылокНаЗаказы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаказВариантыКомплектации = РезультатЗапроса.Выгрузить();
	
	МассивУдалитьУЛ = Новый Массив;
	
	Для Каждого СтрокаУпковочногоЛиста Из Дерево Цикл
		
		УЛ = Ложь;
		
		ОтборУЛ = Новый Структура();
		ОтборУЛ.Вставить("ЗаказКлиентаСсылка", СтрокаУпковочногоЛиста.Заказ);
		ОтборУЛ.Вставить("ВариантКомплектации", СтрокаУпковочногоЛиста.УпаковочныйЛистКомплектация);
		МассивНайдСтрКомплектации = ЗаказВариантыКомплектации.НайтиСтроки(ОтборУЛ);
		
		Для Каждого МассивСтр Из МассивНайдСтрКомплектации Цикл
			
			Если МассивСтр.Количество > 0 Тогда
				
				МассивСтр.Количество = МассивСтр.Количество - 1;
				УЛ = Истина;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;

		Если Не УЛ Тогда
			МассивУдалитьУЛ.Добавить(СтрокаУпковочногоЛиста);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого МассивСтр Из МассивУдалитьУЛ Цикл
		
		Дерево.Удалить(МассивСтр);
		
	КонецЦикла;
	
	МассивСсылокНаУпаковочныеЛисты = Дерево.ВыгрузитьКолонку("УпаковочныйЛистСсылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УпаковочныйЛистТовары.Ссылка КАК УпаковочныйЛист,
		|	УпаковочныйЛистТовары.Номенклатура КАК Номенклатура,
		|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
		|	УпаковочныйЛистТовары.Ссылка.гф_Агрегация КАК гф_Агрегация,
		|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ ШтрихкодыНоменклатуры
		|ИЗ
		|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
		|		ПО УпаковочныйЛистТовары.Ссылка.гф_Агрегация = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
		|ГДЕ
		|	УпаковочныйЛистТовары.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И УпаковочныйЛистТовары.Ссылка.гф_Комплектация.Владелец.ВидНоменклатуры.ОсобенностьУчета = &ОсобенностьУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШтрихкодыНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодНоменклатуры,
		|	ШтрихкодыУпаковокТоваров.гф_Статус КАК СтатусКМ
		|ИЗ
		|	ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО ШтрихкодыНоменклатуры.Штрихкод = ШтрихкодыУпаковокТоваров.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСсылокНаУпаковочныеЛисты);
	Запрос.УстановитьПараметр("ОсобенностьУчета", Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаказВариантыКомплектации2 = РезультатЗапроса.Выгрузить();

    МассивСтатусКМ = Новый Массив;
	
	Для Каждого СтрокаУпковочногоЛиста Из ЗаказВариантыКомплектации2 Цикл
		
		// Если Не СтрокаУпковочногоЛиста.СтатусКМ = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот Тогда
		Если Не СтрокаУпковочногоЛиста.СтатусКМ = Перечисления.гф_СтатусыКМ_в_ШК.ВОбороте Тогда
			МассивСтатусКМ.Добавить(СтрокаУпковочногоЛиста);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаУпковочногоЛиста Из МассивСтатусКМ Цикл
		
		ОтборУЛ = Новый Структура();
		ОтборУЛ.Вставить("УпаковочныйЛистСсылка", СтрокаУпковочногоЛиста.УпаковочныйЛист);
		// ОтборУЛ.Вставить("СтатусКМ", СтрокаУпковочногоЛиста.УпаковочныйЛистКомплектация);
		МассивНайдСтрСтатусКМ = Дерево.НайтиСтроки(ОтборУЛ);
		
		Для Каждого СтрокаМассива Из МассивНайдСтрСтатусКМ Цикл
			
			Если Не СтрокаМассива.СтатусКМ = Перечисления.гф_СтатусыКМ_в_ШК.Эмитирован Тогда
				СтрокаМассива.СтатусКМ = Перечисления.гф_СтатусыКМ_в_ШК.Эмитирован;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ПолучитьБлокировки(Дерево)
	
	Если Объект.ТоварыВКоробках Тогда
	Для Каждого Строка Из Дерево.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				Если Строка_Т.БлокировкиОтгрузок Тогда
					Строка_Т.Блокировка = "Да";
				Иначе
					Строка_Т.Блокировка = "Нет";
				КонецЕсли;
				
			КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
Иначе
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				Если Строка_Т.БлокировкиОтгрузок Тогда
					Строка_Т.Блокировка = "Да";
				Иначе
					Строка_Т.Блокировка = "Нет";
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеСтрокСУпаковочнымиЛистамиСверхДоступныхОстатков(Дерево)
	
	НеДоступныеУпаковочныеЛисты = Объект.ДоступностьУпаковочныхЛистов.НайтиСтроки(Новый Структура("Проверка", Ложь));
	
	// ++ Галфинд Волков 2023/12/18
	Товары = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	К.УпаковочныйЛист КАК УпаковочныйЛист,
	                |	К.Проверка КАК Проверка
	                |ПОМЕСТИТЬ ТЧ
	                |ИЗ
	                |	&ТЗ КАК К
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТЧ.УпаковочныйЛист КАК УпаковочныйЛист,
	                |	ТЧ.Проверка КАК Проверка
	                |ИЗ
	                |	ТЧ КАК ТЧ
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ТЧ.УпаковочныйЛист,
	                |	ТЧ.Проверка";
	Запрос.УстановитьПараметр("ТЗ", Объект.ДоступностьУпаковочныхЛистов.Выгрузить());
	Объект.ДоступностьУпаковочныхЛистов.Загрузить(Запрос.Выполнить().Выгрузить());
	// -- Галфинд Волков 2023/12/18
	
	Если НеДоступныеУпаковочныеЛисты.Количество() > 0 Тогда
		
		Для Каждого Строка Из Дерево.Строки Цикл
			Для Каждого Строка_Н Из Строка.Строки Цикл
				
				ТЗ = Новый ТаблицаЗначений;
				ТЗ.Колонки.Добавить("УпаковочныйЛистСсылка");
				
				Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
				Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
					
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока.УпаковочныйЛистСсылка = Строка_Т.УпаковочныйЛистСсылка;
					
				КонецЦикла;
				КонецЦикла;
				Для Каждого СтрокаТЗ Из ТЗ Цикл
					
					НайденныйОбъект = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("УпаковочныйЛистСсылка",
										СтрокаТЗ.УпаковочныйЛистСсылка));
					
					// Не важно сколько строк по отобранному упаковочному листу, важно что строки найдены, что бы проверить доступность упаковочного листа
					Если НайденныйОбъект.Количество() > 0 Тогда
						
						НайденныеСтрокиДоступностьУЛ = Объект.ДоступностьУпаковочныхЛистов.НайтиСтроки(Новый Структура("УпаковочныйЛист",
														СтрокаТЗ.УпаковочныйЛистСсылка));
						
						Для Каждого СтрокаДоступность Из НайденныеСтрокиДоступностьУЛ Цикл
							
							Если Не СтрокаДоступность.Проверка Тогда
								
								Строка_ТТ.Строки.Удалить(НайденныйОбъект[0]);
								
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалениеСтрокСУпаковочнымиЛистамиСверхДоступныхОстатков2(ТЗДляДерева, ДоступностьУпаковочныхЛистов)
	
	НеДоступныеУпаковочныеЛисты = ДоступностьУпаковочныхЛистов.НайтиСтроки(Новый Структура("Проверка", Ложь));
		
	Если НеДоступныеУпаковочныеЛисты.Количество() > 0 Тогда
		
		Для Каждого Строка Из НеДоступныеУпаковочныеЛисты Цикл
			
			НайденныеСтрокиДоступностьУЛ = ТЗДляДерева.НайтиСтроки(Новый Структура("УпаковочныйЛистСсылка", Строка.УпаковочныйЛист));
			
			Для Каждого СтрокаН Из НайденныеСтрокиДоступностьУЛ Цикл
				ТЗДляДерева.Удалить(СтрокаН);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСтрокиБезУпаковочногоЛиста(ДеревоЗначений)
	
	СпЗнСтрока_Н = Новый ТаблицаЗначений;
	СпЗнСтрока_Н.Колонки.Добавить("Клиент");
	СпЗнСтрока_Н.Колонки.Добавить("АдресДоставки");
	СпЗнСтрока_Н.Колонки.Добавить("Заказ");
	СпЗнСтрока_Н.Колонки.Добавить("ИндексСтроки");
	СпЗнСтрока_Н.Колонки.Добавить("УИ");
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			ИндексСтроки = Неопределено;
			
			Если Строка_Н.Уровень() = 1 И Строка_Н.Строки.Количество() = 0 Тогда
				ИндексСтроки = Строка.Строки.Индекс(Строка_Н);
			КонецЕсли;
			
			Если Не ИндексСтроки = Неопределено Тогда
				
				Стр = СпЗнСтрока_Н.Добавить();
				Стр.Заказ = Строка_Н.Заказ;
				Стр.ИндексСтроки = ИндексСтроки;
				
				УИ = Новый УникальныйИдентификатор;
				Строка_Н.УИСтрокиДереваЗначений = УИ;
				Стр.УИ = УИ;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Счетчик = Строка.Строки.Количество() - 1;
			Пока Счетчик >= 0 Цикл
				
				Для Каждого СтрокаСпЗнСтрока_Н Из СпЗнСтрока_Н Цикл
					
					Если Строка.Строки[Счетчик].Заказ = СтрокаСпЗнСтрока_Н.Заказ 
						// ++ Галфинд ВолковЕВ 18.07.2023 Бывает несколько строк с одним и тем же заказом но с разными документами поступления
						// и в одной строке есть упаковочные листы, а в другой нужно удалить. Необходим однозначный поиск этой строки
						И Строка.Строки[Счетчик].УИСтрокиДереваЗначений = СтрокаСпЗнСтрока_Н.УИ Тогда
						// -- Галфинд ВолковЕВ 18.07.2023
						
						// ++ Галфинд ВолковЕВ 18.07.2023
						// Строка.Строки.Удалить(СтрокаСпЗнСтрока_Н.ИндексСтроки);
						Строка.Строки.Удалить(Строка.Строки[Счетчик]);
						// -- Галфинд ВолковЕВ 18.07.2023
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Счетчик = Счетчик - 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СпЗнСтрока_Н.Очистить();
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		ИндексСтроки = Неопределено;
		
		Если Строка.Уровень() = 0 И Строка.Строки.Количество() = 0 Тогда
			ИндексСтроки = ДеревоЗначений.Строки.Индекс(Строка);
		КонецЕсли;
		
		Если Не ИндексСтроки = Неопределено Тогда
			
			Стр = СпЗнСтрока_Н.Добавить();
			Стр.Клиент = Строка.Клиент;
			Стр.АдресДоставки = Строка.АдресДоставки;
			Стр.ИндексСтроки = ИндексСтроки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Счетчик = ДеревоЗначений.Строки.Количество() - 1;
	
	Пока Счетчик >= 0 Цикл
		
		Для Каждого СтрокаСпЗнСтрока_Н Из СпЗнСтрока_Н Цикл
			
			Если ДеревоЗначений.Строки[Счетчик].Клиент = СтрокаСпЗнСтрока_Н.Клиент
				И ДеревоЗначений.Строки[Счетчик].АдресДоставки = СтрокаСпЗнСтрока_Н.АдресДоставки Тогда
				
				ДеревоЗначений.Строки.Удалить(СтрокаСпЗнСтрока_Н.ИндексСтроки);
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Счетчик = Счетчик - 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьЛимиты(ДеревоЗначений)
	
	АктуальнаяДата = ТекущаяДата();
	
	ТабСписокКонтрагенты = Новый ТаблицаЗначений;
	ТабСписокКонтрагенты.Колонки.Добавить("Клиент");
	
	СписокЗаказы = Новый СписокЗначений;
	
	ТЗКлиентЗаказ = Новый ТаблицаЗначений;
	ТЗКлиентЗаказ.Колонки.Добавить("Клиент");
	ТЗКлиентЗаказ.Колонки.Добавить("Заказ");
	ТЗКлиентЗаказ.Колонки.Добавить("Организация");
	ТЗКлиентЗаказ.Колонки.Добавить("Сумма");
	
	// Получаем список всех контрагентов из отбора
	Если Объект.ТоварыВКоробках Тогда
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				СтрКонтр = ТабСписокКонтрагенты.Добавить();
				СтрКонтр.Клиент = Строка_Т.Клиент;
				
				СписокЗаказы.Добавить(Строка_Т.Заказ);
				
				СтрКЗ = ТЗКлиентЗаказ.Добавить();
				СтрКЗ.Клиент 		= Строка_Т.Клиент;
				СтрКЗ.Заказ 		= Строка_Т.Заказ;
				СтрКЗ.Организация 	= Строка_Т.Организация;
				СтрКЗ.Сумма 		= 0;
				
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Иначе
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				СтрКонтр = ТабСписокКонтрагенты.Добавить();
				СтрКонтр.Клиент = Строка_Т.Клиент;
				
				СписокЗаказы.Добавить(Строка_Т.Заказ);
				
				СтрКЗ = ТЗКлиентЗаказ.Добавить();
				СтрКЗ.Клиент 		= Строка_Т.Клиент;
				СтрКЗ.Заказ 		= Строка_Т.Заказ;
				СтрКЗ.Организация 	= Строка_Т.Организация;
				СтрКЗ.Сумма 		= 0;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
	СписокКонтрагенты = Новый СписокЗначений;
	ТабСписокКонтрагенты.Свернуть("Клиент");
	СписокКонтрагенты.ЗагрузитьЗначения(ТабСписокКонтрагенты.ВыгрузитьКолонку("Клиент"));
	
	// Получаем уникальный список по условиям
	ТЗКлиентЗаказ.Свернуть("Клиент, Заказ, Организация", "Сумма");
	
	// Получаем все возможные лимиты для указанного в параметре списка контрагентов из регистра.
	// Лимиты должны быть активные.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	гф_ЛимитыКонтрагентовСрезПоследних.Период КАК Период,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Партнер КАК Партнер,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Организация КАК Организация,
		|	гф_ЛимитыКонтрагентовСрезПоследних.ВидЛимита КАК ВидЛимита,
		|	гф_ВидыЛимитов.ТипЛимита КАК ТипЛимита,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Статус КАК Статус,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.гф_ЛимитыКонтрагентов.СрезПоследних(
		|			&Период,
		|			Партнер В (&Партнер)
		|				И Организация В (&Организация)) КАК гф_ЛимитыКонтрагентовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_ВидыЛимитов КАК гф_ВидыЛимитов
		|		ПО гф_ЛимитыКонтрагентовСрезПоследних.ВидЛимита = гф_ВидыЛимитов.Ссылка
		|ГДЕ
		|	гф_ЛимитыКонтрагентовСрезПоследних.Статус.Активный = ИСТИНА
		|	И гф_ЛимитыКонтрагентовСрезПоследних.Сумма <> 0";
	
	Запрос.УстановитьПараметр("Партнер", СписокКонтрагенты);
	Запрос.УстановитьПараметр("Период", АктуальнаяДата);
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаВидЛимитаПоКонтрагентам = РезультатЗапроса.Выгрузить();
	
	// Основная таблица для работы с лимитами
	ТЗЛимит = Новый ТаблицаЗначений;
	ТЗЛимит.Колонки.Добавить("Период");
	ТЗЛимит.Колонки.Добавить("Партнер");
	ТЗЛимит.Колонки.Добавить("Организация");
	ТЗЛимит.Колонки.Добавить("ВидЛимита");
	ТЗЛимит.Колонки.Добавить("ТипЛимита");
	ТЗЛимит.Колонки.Добавить("Статус");
	ТЗЛимит.Колонки.Добавить("Сумма");
	
	// Получаем актуальные лимиты по периоду с учетом вида лимита и статуса
	Для Каждого Строка Из ТаблицаВидЛимитаПоКонтрагентам Цикл
		
		Если ТЗЛимит.Количество() = 0 Тогда
			Стр = ТЗЛимит.Добавить();
			Стр.Период 			= Строка.Период;
			Стр.Партнер 		= Строка.Партнер;
			Стр.Организация 	= Строка.Организация;
			Стр.ВидЛимита 		= Строка.ВидЛимита;
			Стр.ТипЛимита 		= Строка.ТипЛимита;
			Стр.Статус 			= Строка.Статус;
			Стр.Сумма 			= Строка.Сумма;
		Иначе
			
			НайденЛимит = Ложь;
			
			Для Каждого СтрокаТЗЛимит Из ТЗЛимит Цикл
				
				Если СтрокаТЗЛимит.Партнер = Строка.Партнер
					И СтрокаТЗЛимит.Организация = Строка.Организация
					И СтрокаТЗЛимит.ВидЛимита = Строка.ВидЛимита Тогда
					
					Если СтрокаТЗЛимит.Период < Строка.Период Тогда
						СтрокаТЗЛимит.Период 	= Строка.Период;
						СтрокаТЗЛимит.Статус 	= Строка.Статус;
						СтрокаТЗЛимит.Сумма 	= Строка.Сумма;
						НайденЛимит = Истина;
						Прервать;
					КонецЕсли;
					
					НайденЛимит = Истина;
					Прервать;
					
				Иначе
					НайденЛимит = Ложь;
				КонецЕсли;
				
			КонецЦикла; 
			
			Если Не НайденЛимит Тогда
				Стр = ТЗЛимит.Добавить();
				Стр.Период 			= Строка.Период;
				Стр.Партнер 		= Строка.Партнер;
				Стр.Организация 	= Строка.Организация;
				Стр.ВидЛимита 		= Строка.ВидЛимита;
				Стр.ТипЛимита 		= Строка.ТипЛимита;
				Стр.Статус 			= Строка.Статус;
				Стр.Сумма 			= Строка.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Получение сумм по расчетам с контрагентами. В договоре обязательно должен быть заполнен "Сезон"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта КАК Валюта,
		|	РасчетыСКлиентамиОстатки.УдалитьЗаказКлиента КАК УдалитьЗаказКлиента,
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0) КАК КОплатеОстаток,
		|	РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток КАК ОплачиваетсяОстаток,
		|	РасчетыСКлиентамиОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
		|	РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОтгружаетсяОстаток,
		|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
		|	ДоговорыКонтрагентов.гф_Сезон КАК гф_Сезон,
		|	КлючиАналитикиУчетаПоПартнерам.Партнер КАК Партнер
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки КАК РасчетыСКлиентамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		|		ПО (КлючиАналитикиУчетаПоПартнерам.Ссылка = РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО (КлючиАналитикиУчетаПоПартнерам.Договор = ДоговорыКонтрагентов.Ссылка)
		|ГДЕ
		|	КлючиАналитикиУчетаПоПартнерам.Партнер В(&Партнер)
		|	И КлючиАналитикиУчетаПоПартнерам.Организация В(&Организация)
		|	И НЕ ДоговорыКонтрагентов.гф_Сезон = ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОстатки.ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта,
		|	РасчетыСКлиентамиОстатки.УдалитьЗаказКлиента,
		|	РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток,
		|	РасчетыСКлиентамиОстатки.КОтгрузкеОстаток,
		|	РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток,
		|	КлючиАналитикиУчетаПоПартнерам.Организация,
		|	ДоговорыКонтрагентов.гф_Сезон,
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0),
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0),
		|	КлючиАналитикиУчетаПоПартнерам.Партнер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партнер";
	
	Запрос.УстановитьПараметр("Партнер", СписокКонтрагенты);
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	
	ТЗЛимит.Колонки.Добавить("НайденВТаблицеСЛимитами");
	ТЗЛимит.Колонки.Добавить("АвансОтКонтрагента");
	ТЗЛимит.Колонки.Добавить("ДолгКонтрагентаПередОрганизацией");
	ТЗЛимит.ЗаполнитьЗначения(Ложь, "НайденВТаблицеСЛимитами");
	ТЗЛимит.ЗаполнитьЗначения(0, "АвансОтКонтрагента");
	ТЗЛимит.ЗаполнитьЗначения(0, "ДолгКонтрагентаПередОрганизацией");
	
	// Получение всех блокировок контрагента, не путать с блокировками лимитов на суммы лимитов.
	// Данные запроса в таблице "ТаблицаБлокировок" используются как для сравнения типа лимита при расчете суммы лимита,
	// так и при сравнении типа блокировки контрагента с типом документов блокирующих отгрузку.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	гф_ПричиныБлокировокСрезПоследних.Период КАК Период,
		|	гф_ПричиныБлокировокСрезПоследних.Партнер КАК Партнер,
		|	гф_ПричиныБлокировокСрезПоследних.Организация КАК Организация,
		|	гф_ПричиныБлокировокСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	гф_ПричиныБлокировокСрезПоследних.ВидБлокировки КАК ВидБлокировки,
		|	гф_БлокировкаРазблокировкаОтгрузок.Исключения КАК Исключения,
		|	гф_БлокировкаРазблокировкаОтгрузок.ДействуетДо КАК ДействуетДо,
		|	гф_ПричиныБлокировокСрезПоследних.Заблокирован КАК Заблокирован,
		|	Ложь КАК УчитыватьВидБлокировки
		|ИЗ
		|	РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(
		|			&Период,
		|			Организация В (&Организация)
		|				И Партнер В (&Партнер)) КАК гф_ПричиныБлокировокСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гф_БлокировкаРазблокировкаОтгрузок КАК гф_БлокировкаРазблокировкаОтгрузок
		|		ПО гф_ПричиныБлокировокСрезПоследних.Регистратор = гф_БлокировкаРазблокировкаОтгрузок.Ссылка
		|ГДЕ
		|	гф_ПричиныБлокировокСрезПоследних.Заблокирован";
		
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	Запрос.УстановитьПараметр("Партнер", СписокКонтрагенты);
	Запрос.УстановитьПараметр("Период", АктуальнаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаБлокировок = РезультатЗапроса.Выгрузить();
	
	// Получение всех блокировок всех контрагентов.
	ТЗВидБлокировкиДляЛимитов = ТаблицаБлокировок.Скопировать( ,"Партнер, ВидБлокировки");
	ТЗВидБлокировкиДляЛимитов.Свернуть("Партнер, ВидБлокировки");
	
	// Проверка лимита на установленный "Тип лимита" в "Виде блокировки" в котором есть этот тип лимита по контрагенту.
	МассивУдалитьСтроки = Новый Массив;
	Для Каждого Строка_ЛимитыТЗ Из ТЗЛимит Цикл
		Для Каждого Строка_ВидБлокировки Из ТЗВидБлокировкиДляЛимитов Цикл
			
			Если Строка_ЛимитыТЗ.Партнер = Строка_ВидБлокировки.Партнер Тогда
				ПРи = Строка_ВидБлокировки.ВидБлокировки.БлокируемыТипыЛимитов.Найти(Строка_ЛимитыТЗ.ТипЛимита, "ТипЛимита");
				
				Если Не ПРи = Неопределено И Строка_ЛимитыТЗ.ТипЛимита = При.ТипЛимита Тогда
					МассивУдалитьСтроки.Добавить(Строка_ЛимитыТЗ);
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		ТЗЛимит.Удалить(УдалитьСтроку);
	КонецЦикла;
	
	// vvv Галфинд \ Sakovich 05.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eecb494788f468
	// для учета блокировок лимитов по типу лимита с учетом того, что заблокирваны могут быть все лимиты
	// в целом по партнеру или по отдельным организациям или только по отдельным договорам - переопредилил 
	// таблицу доступных лимитов:
	ТаблицыПоЛимитам = ПолучитьЛимитыБлокировкиПоТипамЛимтов(Объект.СкладОрганизация, СписокКонтрагенты, АктуальнаяДата);
	ТЗЛимит = ТаблицыПоЛимитам[6].Выгрузить();
	БлокировкиПоДоговорам = ТаблицыПоЛимитам[7].Выгрузить();
	ТЗЛимит.Колонки.Добавить("НайденВТаблицеСЛимитами");
	ТЗЛимит.Колонки.Добавить("АвансОтКонтрагента");
	ТЗЛимит.Колонки.Добавить("ДолгКонтрагентаПередОрганизацией");
	ТЗЛимит.ЗаполнитьЗначения(Ложь, "НайденВТаблицеСЛимитами");
	ТЗЛимит.ЗаполнитьЗначения(0, "АвансОтКонтрагента");
	ТЗЛимит.ЗаполнитьЗначения(0, "ДолгКонтрагентаПередОрганизацией");
	// ^^^ Галфинд \ Sakovich 05.03.2024
	
	// Если лимиты были установлены в регистре для контрагента, то заполним данные по расчетам с контрагентом.		
	Если ТЗЛимит.Количество() > 0 Тогда
		
		Для Каждого СтрВыборка Из Выборка Цикл
			
			Для Каждого Строка_ЛимитыТЗ Из ТЗЛимит Цикл
				
				Если Строка_ЛимитыТЗ.Партнер = СтрВыборка.АналитикаУчетаПоПартнерам.Партнер Тогда
					
					// Флаг для последующего повторного цикла по тем контрагентам, по которым есть остатки но их нет в таблице полученной
					// из регистра с лимитами (по контрагенту лимит не устанавливали). Поиск уже будет с флагом Ложь.
					Строка_ЛимитыТЗ.НайденВТаблицеСЛимитами = Истина;
					
					Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
						Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией = Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией + СтрВыборка.СуммаОстаток;
					Иначе
						Строка_ЛимитыТЗ.АвансОтКонтрагента = Строка_ЛимитыТЗ.АвансОтКонтрагента + СтрВыборка.СуммаОстаток * (-1);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Повторный обход для добавление суммы по лимиту из остатков контрагента у которого лимиты
	// не были установлены в регистре гф_ЛимитыКонтрагентов.
	Для Каждого СтрВыборка Из Выборка Цикл
		
		НайденныеСтрокиТЗЛимит = ТЗЛимит.НайтиСтроки(Новый Структура("Партнер, Организация, НайденВТаблицеСЛимитами",
			СтрВыборка.АналитикаУчетаПоПартнерам.Партнер, СтрВыборка.Организация, Ложь));
		
		Если НайденныеСтрокиТЗЛимит.Количество() = 1 Тогда
			
			Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
				НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией =
					НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией + СтрВыборка.СуммаОстаток;
			Иначе
				НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента =
					НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента + СтрВыборка.СуммаОстаток * (-1);
			КонецЕсли;
			
		ИначеЕсли НайденныеСтрокиТЗЛимит.Количество() = 0 Тогда
			
			НайденныеСтрокиТЗЛимит = ТЗЛимит.НайтиСтроки(Новый Структура("Партнер, Организация",
				СтрВыборка.АналитикаУчетаПоПартнерам.Партнер, СтрВыборка.Организация));
			
			Если НайденныеСтрокиТЗЛимит.Количество() = 0 Тогда
				// В любом случае добаляем строку, даже если нет лимита и сумма расчетов с котрагентом равна нулю.
				// Данные дальше будут записываться по непроведенным реализациям и ордерам со статусами (КОтбору, Преверен)
				// не делающие движений по регситрам расчета с контрагентом.
				Стр = ТЗЛимит.Добавить();
				Стр.Партнер 							= СтрВыборка.АналитикаУчетаПоПартнерам.Партнер;
				Стр.Организация 						= СтрВыборка.Организация;
				Стр.Сумма 								= 0;
				Стр.АвансОтКонтрагента 					= 0;
				Стр.ДолгКонтрагентаПередОрганизацией 	= 0;
				Стр.НайденВТаблицеСЛимитами 			= Ложь;
				
				Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
					Стр.ДолгКонтрагентаПередОрганизацией = СтрВыборка.СуммаОстаток;
				Иначе
					Стр.АвансОтКонтрагента = СтрВыборка.СуммаОстаток * (-1);
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Мало вероятная ситуация когда несколько строк, так таблица сворачивается после выгрузки из результата запроса.
			Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
				НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией = НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией + СтрВыборка.СуммаОстаток;
			Иначе
				НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента = НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента + СтрВыборка.СуммаОстаток * (-1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Получение суммы по не проведенным реализациям для расчета суммы лимита с учетом таких документов
	// не отразивших суммы в регистре расчета с контрагентом.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента В(&ЗаказКлиента)
	|	И РеализацияТоваровУслуг.Проведен = ЛОЖЬ
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", СписокЗаказы);
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗКлиентЗаказ.Колонки.Добавить("АвансОтКонтрагента");
	ТЗКлиентЗаказ.Колонки.Добавить("ДолгКонтрагентаПередОрганизацией");
	ТЗКлиентЗаказ.ЗаполнитьЗначения(0, "АвансОтКонтрагента");
	ТЗКлиентЗаказ.ЗаполнитьЗначения(0, "ДолгКонтрагентаПередОрганизацией");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для Каждого Строка_Заказ Из ТЗКлиентЗаказ Цикл
			
			Если Строка_Заказ.Заказ = ВыборкаДетальныеЗаписи.ЗаказКлиента Тогда
				
				Строка_Заказ.Сумма = Строка_Заказ.Сумма - ВыборкаДетальныеЗаписи.СуммаДокумента;
				Строка_Заказ.ДолгКонтрагентаПередОрганизацией = Строка_Заказ.ДолгКонтрагентаПередОрганизацией + ВыборкаДетальныеЗаписи.СуммаДокумента;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Строка_ЛимитыТЗ Из ТЗЛимит Цикл
		Для Каждого Строка_Заказ Из ТЗКлиентЗаказ Цикл
			
			Если Строка_ЛимитыТЗ.Партнер = Строка_Заказ.Клиент
				И Строка_ЛимитыТЗ.Организация = Строка_Заказ.Организация Тогда
				
				Строка_ЛимитыТЗ.АвансОтКонтрагента = Строка_ЛимитыТЗ.АвансОтКонтрагента + Строка_Заказ.АвансОтКонтрагента;
				Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией = Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией 
					+ Строка_Заказ.ДолгКонтрагентаПередОрганизацией;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ТЗЛимитыКонтрагентов = РеквизитФормыВЗначение("ЛимитыКонтрагентов");
	ТЗЛимитыКонтрагентов.Очистить();
	
	Для Каждого Строка_Лимиты Из ТЗЛимит Цикл
		
		НайденЛимит = Ложь;
		Если Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий Тогда	
			Если ТЗЛимитыКонтрагентов.Количество() = 0 Тогда
				Стр = ТЗЛимитыКонтрагентов.Добавить();
				Стр.Период 			= Строка_Лимиты.Период;
				Стр.Партнер 		= Строка_Лимиты.Партнер;
				Стр.Организация 	= Строка_Лимиты.Организация;
				Стр.Статус 			= Строка_Лимиты.Статус;
				
				Стр.Сумма = Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
			Иначе
				Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
					
					Если Строка_ЛимитыТЗ.Партнер = Строка_Лимиты.Партнер
						И Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий
						И Строка_ЛимитыТЗ.Организация = Строка_Лимиты.Организация Тогда
						
						Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма + Строка_Лимиты.Сумма;
						НайденЛимит = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не НайденЛимит Тогда
					Стр = ТЗЛимитыКонтрагентов.Добавить();
					Стр.Период 			= Строка_Лимиты.Период;
					Стр.Партнер 		= Строка_Лимиты.Партнер;
					Стр.Организация 	= Строка_Лимиты.Организация;
					Стр.Статус 			= Строка_Лимиты.Статус;
					Стр.Сумма 			= Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
				КонецЕсли;
				
			КонецЕсли;
		ИначеЕсли Не Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий И Не Строка_Лимиты.Статус = Неопределено
			И (Строка_Лимиты.АвансОтКонтрагента > 0 Или Строка_Лимиты.АвансОтКонтрагента > 0) Тогда
			
			Если ТЗЛимитыКонтрагентов.Количество() = 0 Тогда
				Стр = ТЗЛимитыКонтрагентов.Добавить();
				Стр.Период 				= Строка_Лимиты.Период;
				Стр.Партнер 			= Строка_Лимиты.Партнер;
				Стр.Организация 		= Строка_Лимиты.Организация;
				Стр.Статус 				= Справочники.гф_СтатусыЛимитов.Действующий;
				Стр.Сумма 				= Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
			Иначе
				Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
					
					Если Строка_ЛимитыТЗ.Партнер = Строка_Лимиты.Партнер
						И Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий
						И Строка_ЛимитыТЗ.Организация = Строка_Лимиты.Организация Тогда
						
						Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма + Строка_Лимиты.СуммаВзаиморасчетов;
						НайденЛимит = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не НайденЛимит Тогда
					Стр = ТЗЛимитыКонтрагентов.Добавить();
					Стр.Период 			= Строка_Лимиты.Период;
					Стр.Партнер 		= Строка_Лимиты.Партнер;
					Стр.Организация 	= Строка_Лимиты.Организация;
					Стр.Статус 			= Справочники.гф_СтатусыЛимитов.Действующий;
					Стр.Сумма 			= Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Строка_Лимиты.Статус = Неопределено
			И (Строка_Лимиты.АвансОтКонтрагента > 0 Или Строка_Лимиты.ДолгКонтрагентаПередОрганизацией > 0) Тогда
			
			Если ТЗЛимитыКонтрагентов.Количество() = 0 Тогда
				Стр = ТЗЛимитыКонтрагентов.Добавить();
				Стр.Партнер = Строка_Лимиты.Партнер;
				Стр.Организация = Строка_Лимиты.Организация;
				Стр.Сумма = Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
			Иначе
				Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
					
					Если Строка_ЛимитыТЗ.Партнер = Строка_Лимиты.Партнер
						И Строка_Лимиты.Статус = Неопределено
						И Строка_ЛимитыТЗ.Организация = Строка_Лимиты.Организация Тогда
						
						Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
						НайденЛимит = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не НайденЛимит Тогда
					Стр = ТЗЛимитыКонтрагентов.Добавить();
					Стр.Партнер = Строка_Лимиты.Партнер;
					Стр.Организация = Строка_Лимиты.Организация;
					Стр.Сумма = Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
				КонецЕсли;
				
			КонецЕсли;
				
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	// В этом запросе мы не отбираем конретно суммы документов в статусе который не отражает движения суммы
	// для расчета с контрагентом по организации, так как в ордере нет такого реквизита и сумма долга
	// вычисляется по всем найденным ордерам контрагента. 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходныйОрдерНаТовары.гф_СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	РасходныйОрдерНаТовары.Получатель КАК Получатель,
		|	РасходныйОрдерНаТовары.Склад.гф_Организация КАК СкладОрганизация,
		|	РасходныйОрдерНаТовары.Статус КАК Статус,
		|	РеализацияТоваровУслуг.гф_РасходныйОрдер КАК РасходныйОрдерРеализация
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.гф_РасходныйОрдер = РасходныйОрдерНаТовары.Ссылка)
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен = &Проведен
		|	И РасходныйОрдерНаТовары.ПометкаУдаления = &ПометкаУдаления
		|	И (РасходныйОрдерНаТовары.Статус = &СтатусКОтбору
		|			ИЛИ РасходныйОрдерНаТовары.Статус = &СтатусПроверен
		|			ИЛИ РасходныйОрдерНаТовары.Статус = &СтатусКОтгрузке
		|			ИЛИ РасходныйОрдерНаТовары.Статус = &СтатусОтгружен)
		|	И РасходныйОрдерНаТовары.Получатель В(&Получатель)
		|	И РасходныйОрдерНаТовары.Склад.гф_Организация = &Организация";
	
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Запрос.УстановитьПараметр("Проведен", Истина);
	// Изменение связано с тем, что теперь первоначально Ордер создается в статусе КОтбору
	Запрос.УстановитьПараметр("СтатусКОтбору", Перечисления.СтатусыРасходныхОрдеров.КОтбору);
	// Ордер может быть переведен в следующий статус, который не делает движений по расчетам с контрагентами
	Запрос.УстановитьПараметр("СтатусПроверен", Перечисления.СтатусыРасходныхОрдеров.Проверен);
	
	
	Запрос.УстановитьПараметр("СтатусКОтгрузке", Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	Запрос.УстановитьПараметр("СтатусОтгружен", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	Запрос.УстановитьПараметр("Получатель", СписокКонтрагенты);
	
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДет = РезультатЗапроса.Выгрузить();
	
	ВыборкаДет.Свернуть("Получатель, СкладОрганизация, Статус, РасходныйОрдерРеализация", "СуммаНоменклатуры");
	
	// Если лимита нет совсем, который действует без блокировки типа лимита, будет в итоге лимит ноль если
	// не было расчетов по авансам и платежам!
	// Если у контрагента долг по оплате то сумма с минусом, если переплата то больше нуля.
	Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
		
		Для Каждого СтрокаВыборка Из ВыборкаДет Цикл
			
			Если Строка_ЛимитыТЗ.Партнер = СтрокаВыборка.Получатель Тогда
				//И Строка_ЛимитыТЗ.Организация = СтрокаВыборка.СкладОрганизация Тогда
				
				Если СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору
					Или (СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен
					И Не ЗначениеЗаполнено(СтрокаВыборка.РасходныйОрдерРеализация))
					
					Или (СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке
					И Не ЗначениеЗаполнено(СтрокаВыборка.РасходныйОрдерРеализация))
					
					Или (СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
					И Не ЗначениеЗаполнено(СтрокаВыборка.РасходныйОрдерРеализация)) Тогда
					
					Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма - СтрокаВыборка.СуммаНоменклатуры;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	// Получение всех блокировок по виду блокировак самого контрагента, не путать с блокировками лимитов.
	ТЗВидБлокировки = ТаблицаБлокировок.Скопировать( ,"ВидБлокировки");
	ТЗВидБлокировки.Свернуть("ВидБлокировки");
	
	// Получение видов блокировок для типов документов, при определенных типах блокировки не учитываются.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗВидБлокировки.ВидБлокировки КАК Ссылка
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	&ТЗВидБлокировки КАК ТЗВидБлокировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гф_ВидыБлокировокБлокируемыТипыДокументов.Ссылка КАК Ссылка,
		|	гф_ВидыБлокировокБлокируемыТипыДокументов.ТипДокументов КАК ТипДокументов
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_ВидыБлокировок.БлокируемыТипыДокументов КАК гф_ВидыБлокировокБлокируемыТипыДокументов
		|		ПО ВТ_1.Ссылка = гф_ВидыБлокировокБлокируемыТипыДокументов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_2.Ссылка КАК Ссылка,
		|	ВТ_2.ТипДокументов КАК ТипДокументов
		|ИЗ
		|	ВТ_2 КАК ВТ_2";
	
	Запрос.УстановитьПараметр("ТЗВидБлокировки", ТЗВидБлокировки);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаВидовБлокировок = РезультатЗапроса.Выгрузить();	
	
	БлокировкиКонтрагентовТЗ = РеквизитФормыВЗначение("БлокировокиКонтрагентов");
	БлокировкиКонтрагентовТЗ.Очистить();
	
	Для Каждого Строка Из ТаблицаБлокировок Цикл
		
		НайденнаяСтрока = ТаблицаВидовБлокировок.Найти(Строка.ВидБлокировки, "Ссылка");
		
		Если Не НайденнаяСтрока = Неопределено
			И (НайденнаяСтрока.ТипДокументов = Перечисления.гф_ТипыБлокируемыхДокументов.РеализацияТоваровУслуг
			Или НайденнаяСтрока.ТипДокументов = Перечисления.гф_ТипыБлокируемыхДокументов.РасходныйОрдерНаТовары) Тогда
			
			 Строка.УчитыватьВидБлокировки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивУдалитьСтроки = Новый Массив;
	Для Каждого Строка Из ТаблицаБлокировок Цикл
		
		Если Не Строка.УчитыватьВидБлокировки Тогда
			МассивУдалитьСтроки.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		ТаблицаБлокировок.Удалить(УдалитьСтроку);
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаБлокировок Цикл
		
		// ++ Галфинд ВолковЕВ 18.09.2023
		// Если Строка.Заблокирован Тогда
		Если (Строка.Заблокирован И Не Строка.Исключения)
			// Или (Строка.Заблокирован И Строка.Исключения И КонецДня(Строка.ДействуетДо) < НачалоДня(АктуальнаяДата)) Тогда
			Или (Строка.Заблокирован И Строка.Исключения И Строка.ДействуетДо - 1 < АктуальнаяДата) Тогда
		// -- Галфинд ВолковЕВ 18.09.2023
		
		    // ++ Галфинд ВолковЕВ 2024/01/24
			//Совпадение = Ложь;
			// -- Галфинд ВолковЕВ 2024/01/24
			Если БлокировкиКонтрагентовТЗ.Количество() = 0 Тогда
				Стр = БлокировкиКонтрагентовТЗ.Добавить();
				Стр.Период 					= Строка.Период;
				Стр.Партнер 				= Строка.Партнер;
				Стр.Организация 			= Строка.Организация;
				Стр.ДоговорКонтрагента 		= Строка.ДоговорКонтрагента;
				Стр.Заблокирован 			= Строка.Заблокирован;
				Стр.ВидБлокировки 			= Строка.ВидБлокировки;
			Иначе
				
				// ++ Галфинд ВолковЕВ 2024/01/24
				//Для Каждого Строка_БлокировкиТЗ Из БлокировкиКонтрагентовТЗ Цикл
				//	
				//	Если Строка_БлокировкиТЗ.Партнер = Строка.Партнер
				//		И Строка_БлокировкиТЗ.Организация = Строка.Организация
				//		И Строка_БлокировкиТЗ.ДоговорКонтрагента = Строка.ДоговорКонтрагента Тогда
				//		
				//		Совпадение = Истина;
				//		
				//	КонецЕсли;
				//	
				//КонецЦикла;
				
				//Если Не Совпадение Тогда
				//	
				//	Стр = БлокировкиКонтрагентовТЗ.Добавить();
				//	Стр.Период = Строка.Период;
				//	Стр.Партнер = Строка.Партнер;
				//	Стр.Организация = Строка.Организация;
				//	Стр.ДоговорКонтрагента = Строка.ДоговорКонтрагента;
				//	Стр.Заблокирован = Строка.Заблокирован;
				//	Стр.ВидБлокировки = Строка.ВидБлокировки;
				//	
				//КонецЕсли;
				НайденныеСтроки = БлокировкиКонтрагентовТЗ.НайтиСтроки(Новый Структура("Партнер, Организация, ДоговорКонтрагента",
					Строка.Партнер, Строка.Организация, Строка.ДоговорКонтрагента));
				
				Если Не НайденныеСтроки.Количество() > 0 Тогда
					Стр = БлокировкиКонтрагентовТЗ.Добавить();
					Стр.Период 				= Строка.Период;
					Стр.Партнер 			= Строка.Партнер;
					Стр.Организация 		= Строка.Организация;
					Стр.ДоговорКонтрагента 	= Строка.ДоговорКонтрагента;
					Стр.Заблокирован 		= Строка.Заблокирован;
					Стр.ВидБлокировки 		= Строка.ВидБлокировки;
				КонецЕсли;
				// -- Галфинд ВолковЕВ 2024/01/24
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ТоварыВКоробках Тогда
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				// Лимитов может не быть, а сумма отгруженных товаров по Ордеру в статусе КОтгрузке и Прверен, а так же
				// реализация которая не проведена будет отражаться и выводиться с минусом в итоговой таблице на форме обработки.
				
				Для Каждого Строка_Лимиты Из ТЗЛимитыКонтрагентов Цикл
					Если Строка_Т.Клиент = Строка_Лимиты.Партнер И Строка_Т.Организация = Строка_Лимиты.Организация Тогда
						// vvv Галфинд \ Sakovich 05.03.2024
						// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eecb494788f468
						//Строка_Т.ДействующийЛимит = Строка_Лимиты.Сумма;
						стрПоиска = Новый Структура("Организация, Партнер, БлокировкаПоДоговору", 
						Строка_Т["Организация"], Строка_Т["Клиент"],  Строка_Т["Договор"]);
						мСтрокБлокировкиПоДоговорам = БлокировкиПоДоговорам.НайтиСтроки(стрПоиска);
						СуммаСБлокомПоДоговору = БлокировкиПоДоговорам.Скопировать(мСтрокБлокировкиПоДоговорам).Итог("Сумма");
						Строка_Т.ДействующийЛимит = Строка_Лимиты.Сумма - СуммаСБлокомПоДоговору;
						// ^^^ Галфинд \ Sakovich 05.03.2024
						Прервать;
						
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Строка_Блокировки Из БлокировкиКонтрагентовТЗ Цикл
					
					Если Строка_Т.Клиент = Строка_Блокировки.Партнер 
						И Не ЗначениеЗаполнено(Строка_Блокировки.Организация)
						И Не ЗначениеЗаполнено(Строка_Блокировки.ДоговорКонтрагента) Тогда
							
						Строка_Т.БлокировкиОтгрузок = Истина;
						
					ИначеЕсли Строка_Т.Клиент = Строка_Блокировки.Партнер 
						И Строка_Т.Организация = Строка_Блокировки.Организация
						И Строка_Т.Договор = Строка_Блокировки.ДоговорКонтрагента Тогда
						
						Строка_Т.БлокировкиОтгрузок = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
Иначе
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				// Лимитов может не быть, а сумма отгруженных товаров по Ордеру в статусе КОтгрузке и Прверен, а так же
				// реализация которая не проведена будет отражаться и выводиться с минусом в итоговой таблице на форме обработки.
				
				Для Каждого Строка_Лимиты Из ТЗЛимитыКонтрагентов Цикл
					Если Строка_Т.Клиент = Строка_Лимиты.Партнер И Строка_Т.Организация = Строка_Лимиты.Организация Тогда
						// vvv Галфинд \ Sakovich 05.03.2024
						// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eecb494788f468
						//Строка_Т.ДействующийЛимит = Строка_Лимиты.Сумма;
						стрПоиска = Новый Структура("Организация, Партнер, БлокировкаПоДоговору", 
						Строка_Т["Организация"], Строка_Т["Клиент"],  Строка_Т["Договор"]);
						мСтрокБлокировкиПоДоговорам = БлокировкиПоДоговорам.НайтиСтроки(стрПоиска);
						СуммаСБлокомПоДоговору = БлокировкиПоДоговорам.Скопировать(мСтрокБлокировкиПоДоговорам).Итог("Сумма");
						Строка_Т.ДействующийЛимит = Строка_Лимиты.Сумма - СуммаСБлокомПоДоговору;
						// ^^^ Галфинд \ Sakovich 05.03.2024
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Строка_Блокировки Из БлокировкиКонтрагентовТЗ Цикл
					
					Если Строка_Т.Клиент = Строка_Блокировки.Партнер 
						И Не ЗначениеЗаполнено(Строка_Блокировки.Организация)
						И Не ЗначениеЗаполнено(Строка_Блокировки.ДоговорКонтрагента) Тогда
							
						Строка_Т.БлокировкиОтгрузок = Истина;
						
					ИначеЕсли Строка_Т.Клиент = Строка_Блокировки.Партнер 
						И Строка_Т.Организация = Строка_Блокировки.Организация
						И Строка_Т.Договор = Строка_Блокировки.ДоговорКонтрагента Тогда
						
						Строка_Т.БлокировкиОтгрузок = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьЛимиты2(ТЗДляДерева)
	
	АктуальнаяДата = ТекущаяДата();
		
	ТабСписокКонтрагенты = ТЗДляДерева.Скопировать( ,"Клиент");
	ТабСписокКонтрагенты.Свернуть("Клиент");
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокКонтрагентов.ЗагрузитьЗначения(ТабСписокКонтрагенты.ВыгрузитьКолонку("Клиент"));
	
	// Получаем уникальный список по условиям
	ТЗКлиентЗаказ = ТЗДляДерева.Скопировать( ,"Клиент, Заказ, Организация");
	ТЗКлиентЗаказ.Колонки.Добавить("Сумма");
	ТЗКлиентЗаказ.Свернуть("Клиент, Заказ, Организация", "Сумма");
	
	СписокЗаказы = ТЗКлиентЗаказ.Скопировать( ,"Заказ");
	СписокЗаказы.Свернуть("Заказ");
	
	// Получаем все возможные лимиты для указанного в параметре списка контрагентов из регистра.
	// Лимиты должны быть активные.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	гф_ЛимитыКонтрагентовСрезПоследних.Период КАК Период,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Партнер КАК Партнер,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Организация КАК Организация,
		|	гф_ЛимитыКонтрагентовСрезПоследних.ВидЛимита КАК ВидЛимита,
		|	гф_ВидыЛимитов.ТипЛимита КАК ТипЛимита,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Статус КАК Статус,
		|	гф_ЛимитыКонтрагентовСрезПоследних.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.гф_ЛимитыКонтрагентов.СрезПоследних(
		|			&Период,
		|			Партнер В (&Партнер)
		|				И Организация В (&Организация)) КАК гф_ЛимитыКонтрагентовСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_ВидыЛимитов КАК гф_ВидыЛимитов
		|		ПО гф_ЛимитыКонтрагентовСрезПоследних.ВидЛимита = гф_ВидыЛимитов.Ссылка
		|ГДЕ
		|	гф_ЛимитыКонтрагентовСрезПоследних.Статус.Активный = ИСТИНА
		|	И гф_ЛимитыКонтрагентовСрезПоследних.Сумма <> 0";
	
	Запрос.УстановитьПараметр("Партнер", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Период", АктуальнаяДата);
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаВидЛимитаПоКонтрагентам = РезультатЗапроса.Выгрузить();
	
	// Основная таблица для работы с лимитами
	ТЗЛимит = Новый ТаблицаЗначений;
	ТЗЛимит.Колонки.Добавить("Период");
	ТЗЛимит.Колонки.Добавить("Партнер");
	ТЗЛимит.Колонки.Добавить("Организация");
	ТЗЛимит.Колонки.Добавить("ВидЛимита");
	ТЗЛимит.Колонки.Добавить("ТипЛимита");
	ТЗЛимит.Колонки.Добавить("Статус");
	ТЗЛимит.Колонки.Добавить("Сумма");
	
	// Получаем актуальные лимиты по периоду с учетом вида лимита и статуса
	Для Каждого Строка Из ТаблицаВидЛимитаПоКонтрагентам Цикл
		
		Если ТЗЛимит.Количество() = 0 Тогда
			Стр = ТЗЛимит.Добавить();
			Стр.Период 			= Строка.Период;
			Стр.Партнер 		= Строка.Партнер;
			Стр.Организация 	= Строка.Организация;
			Стр.ВидЛимита 		= Строка.ВидЛимита;
			Стр.ТипЛимита 		= Строка.ТипЛимита;
			Стр.Статус 			= Строка.Статус;
			Стр.Сумма 			= Строка.Сумма;
		Иначе
			
			НайденЛимит = Ложь;
			
			Для Каждого СтрокаТЗЛимит Из ТЗЛимит Цикл
				
				Если СтрокаТЗЛимит.Партнер = Строка.Партнер
					И СтрокаТЗЛимит.Организация = Строка.Организация
					И СтрокаТЗЛимит.ВидЛимита = Строка.ВидЛимита Тогда
					
					Если СтрокаТЗЛимит.Период < Строка.Период Тогда
						СтрокаТЗЛимит.Период 	= Строка.Период;
						СтрокаТЗЛимит.Статус 	= Строка.Статус;
						СтрокаТЗЛимит.Сумма 	= Строка.Сумма;
						НайденЛимит = Истина;
						Прервать;
					КонецЕсли;
					
					НайденЛимит = Истина;
					Прервать;
					
				Иначе
					НайденЛимит = Ложь;
				КонецЕсли;
				
			КонецЦикла; 
			
			Если Не НайденЛимит Тогда
				Стр = ТЗЛимит.Добавить();
				Стр.Период 			= Строка.Период;
				Стр.Партнер 		= Строка.Партнер;
				Стр.Организация 	= Строка.Организация;
				Стр.ВидЛимита 		= Строка.ВидЛимита;
				Стр.ТипЛимита 		= Строка.ТипЛимита;
				Стр.Статус 			= Строка.Статус;
				Стр.Сумма 			= Строка.Сумма;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Получение сумм по расчетам с контрагентами. В договоре обязательно должен быть заполнен "Сезон"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта КАК Валюта,
		|	РасчетыСКлиентамиОстатки.УдалитьЗаказКлиента КАК УдалитьЗаказКлиента,
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0) КАК КОплатеОстаток,
		|	РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток КАК ОплачиваетсяОстаток,
		|	РасчетыСКлиентамиОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
		|	РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОтгружаетсяОстаток,
		|	КлючиАналитикиУчетаПоПартнерам.Организация КАК Организация,
		|	ДоговорыКонтрагентов.гф_Сезон КАК гф_Сезон,
		|	КлючиАналитикиУчетаПоПартнерам.Партнер КАК Партнер
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки КАК РасчетыСКлиентамиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		|		ПО (КлючиАналитикиУчетаПоПартнерам.Ссылка = РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО (КлючиАналитикиУчетаПоПартнерам.Договор = ДоговорыКонтрагентов.Ссылка)
		|ГДЕ
		|	КлючиАналитикиУчетаПоПартнерам.Партнер В(&Партнер)
		|	И КлючиАналитикиУчетаПоПартнерам.Организация В(&Организация)
		|	И НЕ ДоговорыКонтрагентов.гф_Сезон = ЗНАЧЕНИЕ(Справочник.КоллекцииНоменклатуры.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОстатки.ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта,
		|	РасчетыСКлиентамиОстатки.УдалитьЗаказКлиента,
		|	РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток,
		|	РасчетыСКлиентамиОстатки.КОтгрузкеОстаток,
		|	РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток,
		|	КлючиАналитикиУчетаПоПартнерам.Организация,
		|	ДоговорыКонтрагентов.гф_Сезон,
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.СуммаОстаток, 0),
		|	ЕСТЬNULL(РасчетыСКлиентамиОстатки.КОплатеОстаток, 0),
		|	КлючиАналитикиУчетаПоПартнерам.Партнер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Партнер";
	
	Запрос.УстановитьПараметр("Партнер", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выгрузить();
	
	ТЗЛимит.Колонки.Добавить("НайденВТаблицеСЛимитами");
	ТЗЛимит.Колонки.Добавить("АвансОтКонтрагента");
	ТЗЛимит.Колонки.Добавить("ДолгКонтрагентаПередОрганизацией");
	ТЗЛимит.ЗаполнитьЗначения(Ложь, "НайденВТаблицеСЛимитами");
	ТЗЛимит.ЗаполнитьЗначения(0, "АвансОтКонтрагента");
	ТЗЛимит.ЗаполнитьЗначения(0, "ДолгКонтрагентаПередОрганизацией");
	
	// Получение всех блокировок контрагента, не путать с блокировками лимитов на суммы лимитов.
	// Данные запроса в таблице "ТаблицаБлокировок" используются как для сравнения типа лимита при расчете суммы лимита,
	// так и при сравнении типа блокировки контрагента с типом документов блокирующих отгрузку.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	гф_ПричиныБлокировокСрезПоследних.Период КАК Период,
		|	гф_ПричиныБлокировокСрезПоследних.Партнер КАК Партнер,
		|	гф_ПричиныБлокировокСрезПоследних.Организация КАК Организация,
		|	гф_ПричиныБлокировокСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	гф_ПричиныБлокировокСрезПоследних.ВидБлокировки КАК ВидБлокировки,
		|	гф_БлокировкаРазблокировкаОтгрузок.Исключения КАК Исключения,
		|	гф_БлокировкаРазблокировкаОтгрузок.ДействуетДо КАК ДействуетДо,
		|	гф_ПричиныБлокировокСрезПоследних.Заблокирован КАК Заблокирован,
		|	Ложь КАК УчитыватьВидБлокировки
		|ИЗ
		|	РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(
		|			&Период,
		|			Организация В (&Организация)
		|				И Партнер В (&Партнер)) КАК гф_ПричиныБлокировокСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гф_БлокировкаРазблокировкаОтгрузок КАК гф_БлокировкаРазблокировкаОтгрузок
		|		ПО гф_ПричиныБлокировокСрезПоследних.Регистратор = гф_БлокировкаРазблокировкаОтгрузок.Ссылка
		|ГДЕ
		|	гф_ПричиныБлокировокСрезПоследних.Заблокирован";
		
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	Запрос.УстановитьПараметр("Партнер", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Период", АктуальнаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаБлокировок = РезультатЗапроса.Выгрузить();
	
	// Получение всех блокировок всех контрагентов.
	ТЗВидБлокировкиДляЛимитов = ТаблицаБлокировок.Скопировать( ,"Партнер, ВидБлокировки");
	ТЗВидБлокировкиДляЛимитов.Свернуть("Партнер, ВидБлокировки");
	
	// Проверка лимита на установленный "Тип лимита" в "Виде блокировки" в котором есть этот тип лимита по контрагенту.
	МассивУдалитьСтроки = Новый Массив;
	Для Каждого Строка_ЛимитыТЗ Из ТЗЛимит Цикл
		Для Каждого Строка_ВидБлокировки Из ТЗВидБлокировкиДляЛимитов Цикл
			
			Если Строка_ЛимитыТЗ.Партнер = Строка_ВидБлокировки.Партнер Тогда
				ПРи = Строка_ВидБлокировки.ВидБлокировки.БлокируемыТипыЛимитов.Найти(Строка_ЛимитыТЗ.ТипЛимита, "ТипЛимита");
				
				Если Не ПРи = Неопределено И Строка_ЛимитыТЗ.ТипЛимита = При.ТипЛимита Тогда
					МассивУдалитьСтроки.Добавить(Строка_ЛимитыТЗ);
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		ТЗЛимит.Удалить(УдалитьСтроку);
	КонецЦикла;
	
	// vvv Галфинд \ Sakovich 05.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eecb494788f468
	// для учета блокировок лимитов по типу лимита с учетом того, что заблокирваны могут быть все лимиты
	// в целом по партнеру или по отдельным организациям или только по отдельным договорам - переопредилил 
	// таблицу доступных лимитов:
	ТаблицыПоЛимитам = ПолучитьЛимитыБлокировкиПоТипамЛимтов(Объект.СкладОрганизация, СписокКонтрагентов, АктуальнаяДата);
	ТЗЛимит = ТаблицыПоЛимитам[6].Выгрузить();
	БлокировкиПоДоговорам = ТаблицыПоЛимитам[7].Выгрузить();
	ТЗЛимит.Колонки.Добавить("НайденВТаблицеСЛимитами");
	ТЗЛимит.Колонки.Добавить("АвансОтКонтрагента");
	ТЗЛимит.Колонки.Добавить("ДолгКонтрагентаПередОрганизацией");
	ТЗЛимит.ЗаполнитьЗначения(Ложь, "НайденВТаблицеСЛимитами");
	ТЗЛимит.ЗаполнитьЗначения(0, "АвансОтКонтрагента");
	ТЗЛимит.ЗаполнитьЗначения(0, "ДолгКонтрагентаПередОрганизацией");
	// ^^^ Галфинд \ Sakovich 05.03.2024
	
	// Если лимиты были установлены в регистре для контрагента, то заполним данные по расчетам с контрагентом.		
	Если ТЗЛимит.Количество() > 0 Тогда
		
		Для Каждого СтрВыборка Из Выборка Цикл
			
			Для Каждого Строка_ЛимитыТЗ Из ТЗЛимит Цикл
				
				Если Строка_ЛимитыТЗ.Партнер = СтрВыборка.АналитикаУчетаПоПартнерам.Партнер Тогда
					
					// Флаг для последующего повторного цикла по тем контрагентам, по которым есть остатки но их нет в таблице полученной
					// из регистра с лимитами (по контрагенту лимит не устанавливали). Поиск уже будет с флагом Ложь.
					Строка_ЛимитыТЗ.НайденВТаблицеСЛимитами = Истина;
					
					Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
						Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией = Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией + СтрВыборка.СуммаОстаток;
					Иначе
						Строка_ЛимитыТЗ.АвансОтКонтрагента = Строка_ЛимитыТЗ.АвансОтКонтрагента + СтрВыборка.СуммаОстаток * (-1);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Повторный обход для добавление суммы по лимиту из остатков контрагента у которого лимиты
	// не были установлены в регистре гф_ЛимитыКонтрагентов.
	Для Каждого СтрВыборка Из Выборка Цикл
		
		НайденныеСтрокиТЗЛимит = ТЗЛимит.НайтиСтроки(Новый Структура("Партнер, Организация, НайденВТаблицеСЛимитами",
			СтрВыборка.АналитикаУчетаПоПартнерам.Партнер, СтрВыборка.Организация, Ложь));
		
		Если НайденныеСтрокиТЗЛимит.Количество() = 1 Тогда
			
			Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
				НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией =
					НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией + СтрВыборка.СуммаОстаток;
			Иначе
				НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента =
					НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента + СтрВыборка.СуммаОстаток * (-1);
			КонецЕсли;
			
		ИначеЕсли НайденныеСтрокиТЗЛимит.Количество() = 0 Тогда
			
			НайденныеСтрокиТЗЛимит = ТЗЛимит.НайтиСтроки(Новый Структура("Партнер, Организация",
				СтрВыборка.АналитикаУчетаПоПартнерам.Партнер, СтрВыборка.Организация));
			
			Если НайденныеСтрокиТЗЛимит.Количество() = 0 Тогда
				// В любом случае добаляем строку, даже если нет лимита и сумма расчетов с котрагентом равна нулю.
				// Данные дальше будут записываться по непроведенным реализациям и ордерам со статусами (КОтбору, Преверен)
				// не делающие движений по регситрам расчета с контрагентом.
				Стр = ТЗЛимит.Добавить();
				Стр.Партнер 							= СтрВыборка.АналитикаУчетаПоПартнерам.Партнер;
				Стр.Организация 						= СтрВыборка.Организация;
				Стр.Сумма 								= 0;
				Стр.АвансОтКонтрагента 					= 0;
				Стр.ДолгКонтрагентаПередОрганизацией 	= 0;
				Стр.НайденВТаблицеСЛимитами 			= Ложь;
				
				Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
					Стр.ДолгКонтрагентаПередОрганизацией = СтрВыборка.СуммаОстаток;
				Иначе
					Стр.АвансОтКонтрагента = СтрВыборка.СуммаОстаток * (-1);
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Мало вероятная ситуация когда несколько строк, так таблица сворачивается после выгрузки из результата запроса.
			Если Не СтрВыборка.СуммаОстаток = 0 И СтрВыборка.СуммаОстаток > 0 Тогда
				НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией = НайденныеСтрокиТЗЛимит[0].ДолгКонтрагентаПередОрганизацией + СтрВыборка.СуммаОстаток;
			Иначе
				НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента = НайденныеСтрокиТЗЛимит[0].АвансОтКонтрагента + СтрВыборка.СуммаОстаток * (-1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Получение суммы по не проведенным реализациям для расчета суммы лимита с учетом таких документов
	// не отразивших суммы в регистре расчета с контрагентом.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.ЗаказКлиента В(&ЗаказКлиента)
	|	И РеализацияТоваровУслуг.Проведен = ЛОЖЬ
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И РеализацияТоваровУслуг.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", СписокЗаказы);
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗКлиентЗаказ.Колонки.Добавить("АвансОтКонтрагента");
	ТЗКлиентЗаказ.Колонки.Добавить("ДолгКонтрагентаПередОрганизацией");
	ТЗКлиентЗаказ.ЗаполнитьЗначения(0, "АвансОтКонтрагента");
	ТЗКлиентЗаказ.ЗаполнитьЗначения(0, "ДолгКонтрагентаПередОрганизацией");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для Каждого Строка_Заказ Из ТЗКлиентЗаказ Цикл
			
			Если Строка_Заказ.Заказ = ВыборкаДетальныеЗаписи.ЗаказКлиента Тогда
				
				Строка_Заказ.Сумма = Строка_Заказ.Сумма - ВыборкаДетальныеЗаписи.СуммаДокумента;
				Строка_Заказ.ДолгКонтрагентаПередОрганизацией = Строка_Заказ.ДолгКонтрагентаПередОрганизацией + ВыборкаДетальныеЗаписи.СуммаДокумента;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Строка_ЛимитыТЗ Из ТЗЛимит Цикл
		Для Каждого Строка_Заказ Из ТЗКлиентЗаказ Цикл
			
			Если Строка_ЛимитыТЗ.Партнер = Строка_Заказ.Клиент
				И Строка_ЛимитыТЗ.Организация = Строка_Заказ.Организация Тогда
				
				Строка_ЛимитыТЗ.АвансОтКонтрагента = Строка_ЛимитыТЗ.АвансОтКонтрагента + Строка_Заказ.АвансОтКонтрагента;
				Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией = Строка_ЛимитыТЗ.ДолгКонтрагентаПередОрганизацией 
					+ Строка_Заказ.ДолгКонтрагентаПередОрганизацией;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ТЗЛимитыКонтрагентов = РеквизитФормыВЗначение("ЛимитыКонтрагентов");
	ТЗЛимитыКонтрагентов.Очистить();
	
	Для Каждого Строка_Лимиты Из ТЗЛимит Цикл
		
		НайденЛимит = Ложь;
		Если Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий Тогда	
			Если ТЗЛимитыКонтрагентов.Количество() = 0 Тогда
				Стр = ТЗЛимитыКонтрагентов.Добавить();
				Стр.Период 			= Строка_Лимиты.Период;
				Стр.Партнер 		= Строка_Лимиты.Партнер;
				Стр.Организация 	= Строка_Лимиты.Организация;
				Стр.Статус 			= Строка_Лимиты.Статус;
				
				Стр.Сумма = Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
			Иначе
				Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
					
					Если Строка_ЛимитыТЗ.Партнер = Строка_Лимиты.Партнер
						И Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий
						И Строка_ЛимитыТЗ.Организация = Строка_Лимиты.Организация Тогда
						
						Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма + Строка_Лимиты.Сумма;
						НайденЛимит = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не НайденЛимит Тогда
					Стр = ТЗЛимитыКонтрагентов.Добавить();
					Стр.Период 			= Строка_Лимиты.Период;
					Стр.Партнер 		= Строка_Лимиты.Партнер;
					Стр.Организация 	= Строка_Лимиты.Организация;
					Стр.Статус 			= Строка_Лимиты.Статус;
					Стр.Сумма 			= Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
				КонецЕсли;
				
			КонецЕсли;
		ИначеЕсли Не Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий И Не Строка_Лимиты.Статус = Неопределено
			И (Строка_Лимиты.АвансОтКонтрагента > 0 Или Строка_Лимиты.АвансОтКонтрагента > 0) Тогда
			
			Если ТЗЛимитыКонтрагентов.Количество() = 0 Тогда
				Стр = ТЗЛимитыКонтрагентов.Добавить();
				Стр.Период 				= Строка_Лимиты.Период;
				Стр.Партнер 			= Строка_Лимиты.Партнер;
				Стр.Организация 		= Строка_Лимиты.Организация;
				Стр.Статус 				= Справочники.гф_СтатусыЛимитов.Действующий;
				Стр.Сумма 				= Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
			Иначе
				Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
					
					Если Строка_ЛимитыТЗ.Партнер = Строка_Лимиты.Партнер
						И Строка_Лимиты.Статус = Справочники.гф_СтатусыЛимитов.Действующий
						И Строка_ЛимитыТЗ.Организация = Строка_Лимиты.Организация Тогда
						
						Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма + Строка_Лимиты.СуммаВзаиморасчетов;
						НайденЛимит = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не НайденЛимит Тогда
					Стр = ТЗЛимитыКонтрагентов.Добавить();
					Стр.Период 			= Строка_Лимиты.Период;
					Стр.Партнер 		= Строка_Лимиты.Партнер;
					Стр.Организация 	= Строка_Лимиты.Организация;
					Стр.Статус 			= Справочники.гф_СтатусыЛимитов.Действующий;
					Стр.Сумма 			= Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Строка_Лимиты.Статус = Неопределено
			И (Строка_Лимиты.АвансОтКонтрагента > 0 Или Строка_Лимиты.ДолгКонтрагентаПередОрганизацией > 0) Тогда
			
			Если ТЗЛимитыКонтрагентов.Количество() = 0 Тогда
				Стр = ТЗЛимитыКонтрагентов.Добавить();
				Стр.Партнер = Строка_Лимиты.Партнер;
				Стр.Организация = Строка_Лимиты.Организация;
				Стр.Сумма = Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
			Иначе
				Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
					
					Если Строка_ЛимитыТЗ.Партнер = Строка_Лимиты.Партнер
						И Строка_Лимиты.Статус = Неопределено
						И Строка_ЛимитыТЗ.Организация = Строка_Лимиты.Организация Тогда
						
						Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
						НайденЛимит = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не НайденЛимит Тогда
					Стр = ТЗЛимитыКонтрагентов.Добавить();
					Стр.Партнер = Строка_Лимиты.Партнер;
					Стр.Организация = Строка_Лимиты.Организация;
					Стр.Сумма = Строка_Лимиты.Сумма + Строка_Лимиты.АвансОтКонтрагента - Строка_Лимиты.ДолгКонтрагентаПередОрганизацией;
				КонецЕсли;
				
			КонецЕсли;
				
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	// В этом запросе мы не отбираем конретно суммы документов в статусе который не отражает движения суммы
	// для расчета с контрагентом по организации, так как в ордере нет такого реквизита и сумма долга
	// вычисляется по всем найденным ордерам контрагента. 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасходныйОрдерНаТовары.гф_СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	РасходныйОрдерНаТовары.Получатель КАК Получатель,
		|	РасходныйОрдерНаТовары.Склад.гф_Организация КАК СкладОрганизация,
		|	РасходныйОрдерНаТовары.Статус КАК Статус,
		|	РеализацияТоваровУслуг.гф_РасходныйОрдер КАК РасходныйОрдерРеализация
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО (РеализацияТоваровУслуг.гф_РасходныйОрдер = РасходныйОрдерНаТовары.Ссылка)
		|ГДЕ
		|	РасходныйОрдерНаТовары.Проведен = &Проведен
		|	И РасходныйОрдерНаТовары.ПометкаУдаления = &ПометкаУдаления
		|	И (РасходныйОрдерНаТовары.Статус = &СтатусКОтбору
		|			ИЛИ РасходныйОрдерНаТовары.Статус = &СтатусПроверен
		|			ИЛИ РасходныйОрдерНаТовары.Статус = &СтатусКОтгрузке
		|			ИЛИ РасходныйОрдерНаТовары.Статус = &СтатусОтгружен)
		|	И РасходныйОрдерНаТовары.Получатель В(&Получатель)
		|	И РасходныйОрдерНаТовары.Склад.гф_Организация = &Организация";
	
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Запрос.УстановитьПараметр("Проведен", Истина);
	// Изменение связано с тем, что теперь первоначально Ордер создается в статусе КОтбору
	Запрос.УстановитьПараметр("СтатусКОтбору", Перечисления.СтатусыРасходныхОрдеров.КОтбору);
	// Ордер может быть переведен в следующий статус, который не делает движений по расчетам с контрагентами
	Запрос.УстановитьПараметр("СтатусПроверен", Перечисления.СтатусыРасходныхОрдеров.Проверен);
	
	
	Запрос.УстановитьПараметр("СтатусКОтгрузке", Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	Запрос.УстановитьПараметр("СтатусОтгружен", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	
	Запрос.УстановитьПараметр("Получатель", СписокКонтрагентов);
	
	Запрос.УстановитьПараметр("Организация", Объект.СкладОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДет = РезультатЗапроса.Выгрузить();
	
	ВыборкаДет.Свернуть("Получатель, СкладОрганизация, Статус, РасходныйОрдерРеализация", "СуммаНоменклатуры");
	
	// Если лимита нет совсем, который действует без блокировки типа лимита, будет в итоге лимит ноль если
	// не было расчетов по авансам и платежам!
	// Если у контрагента долг по оплате то сумма с минусом, если переплата то больше нуля.
	Для Каждого Строка_ЛимитыТЗ Из ТЗЛимитыКонтрагентов Цикл
		
		Для Каждого СтрокаВыборка Из ВыборкаДет Цикл
			
			Если Строка_ЛимитыТЗ.Партнер = СтрокаВыборка.Получатель Тогда
				//И Строка_ЛимитыТЗ.Организация = СтрокаВыборка.СкладОрганизация Тогда
				
				Если СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору
					Или (СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.Проверен
					И Не ЗначениеЗаполнено(СтрокаВыборка.РасходныйОрдерРеализация))
					
					Или (СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке
					И Не ЗначениеЗаполнено(СтрокаВыборка.РасходныйОрдерРеализация))
					
					Или (СтрокаВыборка.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен
					И Не ЗначениеЗаполнено(СтрокаВыборка.РасходныйОрдерРеализация)) Тогда
					
					Строка_ЛимитыТЗ.Сумма = Строка_ЛимитыТЗ.Сумма - СтрокаВыборка.СуммаНоменклатуры;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	// Получение всех блокировок по виду блокировак самого контрагента, не путать с блокировками лимитов.
	ТЗВидБлокировки = ТаблицаБлокировок.Скопировать( ,"ВидБлокировки");
	ТЗВидБлокировки.Свернуть("ВидБлокировки");
	
	// Получение видов блокировок для типов документов, при определенных типах блокировки не учитываются.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗВидБлокировки.ВидБлокировки КАК Ссылка
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	&ТЗВидБлокировки КАК ТЗВидБлокировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гф_ВидыБлокировокБлокируемыТипыДокументов.Ссылка КАК Ссылка,
		|	гф_ВидыБлокировокБлокируемыТипыДокументов.ТипДокументов КАК ТипДокументов
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_ВидыБлокировок.БлокируемыТипыДокументов КАК гф_ВидыБлокировокБлокируемыТипыДокументов
		|		ПО ВТ_1.Ссылка = гф_ВидыБлокировокБлокируемыТипыДокументов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_2.Ссылка КАК Ссылка,
		|	ВТ_2.ТипДокументов КАК ТипДокументов
		|ИЗ
		|	ВТ_2 КАК ВТ_2";
	
	Запрос.УстановитьПараметр("ТЗВидБлокировки", ТЗВидБлокировки);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаВидовБлокировок = РезультатЗапроса.Выгрузить();	
	
	БлокировкиКонтрагентовТЗ = РеквизитФормыВЗначение("БлокировокиКонтрагентов");
	БлокировкиКонтрагентовТЗ.Очистить();
	
	Для Каждого Строка Из ТаблицаБлокировок Цикл
		
		НайденнаяСтрока = ТаблицаВидовБлокировок.Найти(Строка.ВидБлокировки, "Ссылка");
		
		Если Не НайденнаяСтрока = Неопределено
			И (НайденнаяСтрока.ТипДокументов = Перечисления.гф_ТипыБлокируемыхДокументов.РеализацияТоваровУслуг
			Или НайденнаяСтрока.ТипДокументов = Перечисления.гф_ТипыБлокируемыхДокументов.РасходныйОрдерНаТовары) Тогда
			
			 Строка.УчитыватьВидБлокировки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивУдалитьСтроки = Новый Массив;
	Для Каждого Строка Из ТаблицаБлокировок Цикл
		
		Если Не Строка.УчитыватьВидБлокировки Тогда
			МассивУдалитьСтроки.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		ТаблицаБлокировок.Удалить(УдалитьСтроку);
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаБлокировок Цикл
		
		// ++ Галфинд ВолковЕВ 18.09.2023
		// Если Строка.Заблокирован Тогда
		Если (Строка.Заблокирован И Не Строка.Исключения)
			// Или (Строка.Заблокирован И Строка.Исключения И КонецДня(Строка.ДействуетДо) < НачалоДня(АктуальнаяДата)) Тогда
			Или (Строка.Заблокирован И Строка.Исключения И Строка.ДействуетДо - 1 < АктуальнаяДата) Тогда
		// -- Галфинд ВолковЕВ 18.09.2023
		
		    // ++ Галфинд ВолковЕВ 2024/01/24
			//Совпадение = Ложь;
			// -- Галфинд ВолковЕВ 2024/01/24
			Если БлокировкиКонтрагентовТЗ.Количество() = 0 Тогда
				Стр = БлокировкиКонтрагентовТЗ.Добавить();
				Стр.Период 					= Строка.Период;
				Стр.Партнер 				= Строка.Партнер;
				Стр.Организация 			= Строка.Организация;
				Стр.ДоговорКонтрагента 		= Строка.ДоговорКонтрагента;
				Стр.Заблокирован 			= Строка.Заблокирован;
				Стр.ВидБлокировки 			= Строка.ВидБлокировки;
			Иначе
				
				НайденныеСтроки = БлокировкиКонтрагентовТЗ.НайтиСтроки(Новый Структура("Партнер, Организация, ДоговорКонтрагента",
					Строка.Партнер, Строка.Организация, Строка.ДоговорКонтрагента));
				
				Если Не НайденныеСтроки.Количество() > 0 Тогда
					Стр = БлокировкиКонтрагентовТЗ.Добавить();
					Стр.Период 				= Строка.Период;
					Стр.Партнер 			= Строка.Партнер;
					Стр.Организация 		= Строка.Организация;
					Стр.ДоговорКонтрагента 	= Строка.ДоговорКонтрагента;
					Стр.Заблокирован 		= Строка.Заблокирован;
					Стр.ВидБлокировки 		= Строка.ВидБлокировки;
				КонецЕсли;
				// -- Галфинд ВолковЕВ 2024/01/24
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка_Т Из ТЗДляДерева Цикл
		
		// Лимитов может не быть, а сумма отгруженных товаров по Ордеру в статусе КОтгрузке и Прверен, а так же
		// реализация которая не проведена будет отражаться и выводиться с минусом в итоговой таблице на форме обработки.
		
		Для Каждого Строка_Лимиты Из ТЗЛимитыКонтрагентов Цикл
			Если Строка_Т.Клиент = Строка_Лимиты.Партнер И Строка_Т.Организация = Строка_Лимиты.Организация Тогда
				// vvv Галфинд \ Sakovich 05.03.2024
				// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eecb494788f468
				//Строка_Т.ДействующийЛимит = Строка_Лимиты.Сумма;
				стрПоиска = Новый Структура("Организация, Партнер, БлокировкаПоДоговору", 
				Строка_Т["Организация"], Строка_Т["Клиент"],  Строка_Т["Договор"]);
				мСтрокБлокировкиПоДоговорам = БлокировкиПоДоговорам.НайтиСтроки(стрПоиска);
				СуммаСБлокомПоДоговору = БлокировкиПоДоговорам.Скопировать(мСтрокБлокировкиПоДоговорам).Итог("Сумма");
				Строка_Т.ДействующийЛимит = Строка_Лимиты.Сумма - СуммаСБлокомПоДоговору;
				// ^^^ Галфинд \ Sakovich 05.03.2024
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Строка_Блокировки Из БлокировкиКонтрагентовТЗ Цикл
			
			Если Строка_Т.Клиент = Строка_Блокировки.Партнер 
				И Не ЗначениеЗаполнено(Строка_Блокировки.Организация)
				И Не ЗначениеЗаполнено(Строка_Блокировки.ДоговорКонтрагента) Тогда
				
				Строка_Т.БлокировкиОтгрузок = Истина;
				
			ИначеЕсли Строка_Т.Клиент = Строка_Блокировки.Партнер 
				И Строка_Т.Организация = Строка_Блокировки.Организация
				И Строка_Т.Договор = Строка_Блокировки.ДоговорКонтрагента Тогда
				
				Строка_Т.БлокировкиОтгрузок = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Строка_Т.БлокировкиОтгрузок Тогда
			Строка_Т.Блокировка = "Да";
		Иначе
			Строка_Т.Блокировка = "Нет";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваСтроки(Приемник, Выборка)
	
	Для Каждого Строка Из Выборка Цикл
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ЗаполнитьСвойстваСтроки(НоваяСтрока, Строка.Строки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоДокументов()
	
	КоллекцияЭлементовДерева = ДеревоДокументов.ПолучитьЭлементы();
	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		
		ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
		Элементы.ДеревоДокументов.Развернуть(ИдентификаторСтроки, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиВыше(Элемент, Отгрузить)
	
	ЭлементыТекущие = Элемент.ПолучитьЭлементы();
	
	Для Каждого Строка Из ЭлементыТекущие Цикл
		Строка.Отгрузить = Отгрузить;
		УстановитьФлажкиВыше(Строка, Отгрузить);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиНиже(Элемент, Отгрузить)
	
	Если Не Элемент.ПолучитьРодителя() = Неопределено Тогда
		ЭлементРодитель = Элемент.ПолучитьРодителя();
		Если Отгрузить Тогда
			ЭлементРодитель.Отгрузить = Отгрузить;
			УстановитьФлажкиНиже(ЭлементРодитель, Отгрузить)
		Иначе
			УстановитьФлажок = Ложь;
			ЭлементРодительЭлементы = ЭлементРодитель.ПолучитьЭлементы();
			Для Каждого Строка Из ЭлементРодительЭлементы Цикл
				УстановитьФлажок = УстановитьФлажок Или Строка.Отгрузить;
				Если УстановитьФлажок Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ЭлементРодитель.Отгрузить = УстановитьФлажок;
			УстановитьФлажкиНиже(строка.ПолучитьРодителя(), Отгрузить)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьРольОбходаБлокировок()
	
	Если РольДоступна("гф_ОбходБлокировок") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораДействия(СтруктураПереданныхДанных, СтруктураПараметров) Экспорт
	
	Если Не СтруктураПереданныхДанных = Неопределено Тогда
		
		Действие = СтруктураПереданныхДанных.Действие;
		
		Если Действие = "НеУчитыватьБлокировки" Тогда
			
			ОтгрузитьПродолжить();
			
		ИначеЕсли Действие = "ЗаписатьСкидкиПродолжить" Тогда

			ОтгрузитьПродолжитьСоСкидками(СтруктураПереданныхДанных);
			
		ИначеЕсли Действие = "НеУчитыватьЛимиты" Тогда
			
			ОтгрузитьНаСервере(Ложь, СтруктураПараметров);
			
		ИначеЕсли Действие = "ПродолжитьОтгрузкуСПересортом" Тогда
			
			Объект.ИсключитьКоробСРасхождениями = Ложь;
			ОтгрузитьУстановитьСкидки();
			
		ИначеЕсли Действие = "ИсключитьКоробСРасхождениями" Тогда
			
			Результат = ИсключитьКоробСРасхождениями();
			
			Если Объект.КоличествоУпаковочныхЛистовСРасхождением = Результат.КоличествоИсключенныхУпаковочныхЛистов
				И Результат.НаличиеУпаковочногоЛистаСПолнымКомплектом Тогда
				
				РазвернутьДеревоДокументов();
				Объект.ИсключитьКоробСРасхождениями = Истина;
				ОтгрузитьУстановитьСкидки();
				
			Иначе
				РазвернутьДеревоДокументов();
			КонецЕсли;
			
			Если Результат.НаличиеУпаковочногоЛистаСПолнымКомплектом Тогда
			
			КонецЕсли;
			
		ИначеЕсли Действие = "Отменить" Тогда
			
			ТекстСообщения = НСтр("ru = 'Действие отменено! '");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Действие по отгрузке прервано! '");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьПродолжить()
	
	Если ЗначениеЗаполнено(Объект.Склад) И Объект.ТоварыВКоробках Тогда
		
		НаличиеУпаковочногоЛистаСРасхождением = ПроверитьНаличиеУпаковочногоЛистаСРасхождением();
		
		Если НаличиеУпаковочногоЛистаСРасхождением Тогда
			ОтгрузитьУпаковочныеЛистыСРасхождением();
		Иначе
			ОтгрузитьУстановитьСкидки();
		КонецЕсли;
		
	Иначе
		ОтгрузитьУстановитьСкидки();
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНаличиеУпаковочногоЛистаСРасхождением()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	// Таблица для записи всех упаковочных листов с расхождениями для вывода пользователю в окне
	// с действиями по отгрузке таких упаковочных листов
	ТЗ_Расхождение = Новый ТаблицаЗначений;
	ТЗ_Расхождение.Колонки.Добавить("УпаковочныйЛист");
	ТЗ_Расхождение.Колонки.Добавить("СостояниеКороба");
	
	Объект.КоличествоУпаковочныхЛистовСРасхождением = 0;
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
				//Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
					
					НайденныеСтроки = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("Отгрузить, СостояниеКороба", Истина, "Пересорт"));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Объект.КоличествоУпаковочныхЛистовСРасхождением = Объект.КоличествоУпаковочныхЛистовСРасхождением + НайденныеСтроки.Количество();
						
						Для Каждого ЭлементМассива Из НайденныеСтроки Цикл
							СтрокаРасхождение = ТЗ_Расхождение.Добавить();
							СтрокаРасхождение.УпаковочныйЛист = ЭлементМассива.УпаковочныйЛистСсылка;
							СтрокаРасхождение.СостояниеКороба = ЭлементМассива.СостояниеКороба;
						КонецЦикла;
						
					КонецЕсли;
					
					НайденныеСтроки = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("Отгрузить, СостояниеКороба", Истина, "Не полный"));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Объект.КоличествоУпаковочныхЛистовСРасхождением = Объект.КоличествоУпаковочныхЛистовСРасхождением + НайденныеСтроки.Количество();
						
						Для Каждого ЭлементМассива Из НайденныеСтроки Цикл
							СтрокаРасхождение = ТЗ_Расхождение.Добавить();
							СтрокаРасхождение.УпаковочныйЛист = ЭлементМассива.УпаковочныйЛистСсылка;
							СтрокаРасхождение.СостояниеКороба = ЭлементМассива.СостояниеКороба;
						КонецЦикла;
						
					КонецЕсли;
					
					НайденныеСтроки = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("Отгрузить, СостояниеКороба", Истина, "Не полный и пересорт"));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Объект.КоличествоУпаковочныхЛистовСРасхождением = Объект.КоличествоУпаковочныхЛистовСРасхождением + НайденныеСтроки.Количество();
						
						Для Каждого ЭлементМассива Из НайденныеСтроки Цикл
							СтрокаРасхождение = ТЗ_Расхождение.Добавить();
							СтрокаРасхождение.УпаковочныйЛист = ЭлементМассива.УпаковочныйЛистСсылка;
							СтрокаРасхождение.СостояниеКороба = ЭлементМассива.СостояниеКороба;
						КонецЦикла;
						
					КонецЕсли;
					
				//КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	// При согласовании, доработать возврат таблицы с данными
	// ТЗ_Расхождение
	
	Если Объект.КоличествоУпаковочныхЛистовСРасхождением > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтгрузитьУпаковочныеЛистыСРасхождением()
	
		СтруктураПараметров = Неопределено;
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтотОбъект, СтруктураПараметров);
		
		ПараметрыОткрытия = Неопределено;
		
		Если ИмяФормы = "ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.Форма" Тогда
			ОткрытьФорму("ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.ФормаВопросаООтгрузкеУпаковочныхЛистовСПересортом", ПараметрыОткрытия,
			ЭтотОбъект, , , , Оповещение);
		Иначе
			ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаВопросаООтгрузкеУпаковочныхЛистовСПересортом", ПараметрыОткрытия,
			ЭтотОбъект, , , , Оповещение);
		КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьУстановитьСкидки()
	
		СтруктураПараметров = Неопределено;
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтотОбъект, СтруктураПараметров);
		
		ПараметрыОткрытия = ПолучитьПараметрыФормы();
		
		Если ИмяФормы = "ВнешняяОбработка.гф_ОтгрузкаПоЗаказам.Форма.Форма" Тогда
			ОткрытьФорму("ВнешняяОбработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаДанныеДляРТУ", ПараметрыОткрытия,
			ЭтотОбъект, , , , Оповещение);
		Иначе
			ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаДанныеДляРТУ", ПараметрыОткрытия,
			ЭтотОбъект, , , , Оповещение);
		КонецЕсли;
		
КонецПроцедуры

Функция ИсключитьКоробСРасхождениями()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	КоличествоИсключенныхУпаковочныхЛистов = 0;
	НаличиеУпаковочногоЛистаСПолнымКомплектом = Ложь;
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
				//Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
					
					НайденныеСтроки = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("Отгрузить, СостояниеКороба", Истина, "Пересорт"));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Для Каждого ЭлементМассива Из НайденныеСтроки Цикл 
							ЭлементМассива.Отгрузить = Ложь;
							КоличествоИсключенныхУпаковочныхЛистов = КоличествоИсключенныхУпаковочныхЛистов + 1;
						КонецЦикла;
						
					КонецЕсли;
					
					НайденныеСтроки = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("Отгрузить, СостояниеКороба", Истина, "Не полный"));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Для Каждого ЭлементМассива Из НайденныеСтроки Цикл
							ЭлементМассива.Отгрузить = Ложь;
							КоличествоИсключенныхУпаковочныхЛистов = КоличествоИсключенныхУпаковочныхЛистов + 1;
						КонецЦикла;
						
					КонецЕсли;
					
					НайденныеСтроки = Строка_ТТ.Строки.НайтиСтроки(Новый Структура("Отгрузить, СостояниеКороба", Истина, "Полный комплект"));
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						НаличиеУпаковочногоЛистаСПолнымКомплектом = Истина;
						
					КонецЕсли;
					
				//КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоДокументов");
	
	Результат = Новый Структура("КоличествоИсключенныхУпаковочныхЛистов, НаличиеУпаковочногоЛистаСПолнымКомплектом",
		КоличествоИсключенныхУпаковочныхЛистов, НаличиеУпаковочногоЛистаСПолнымКомплектом);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтгрузитьПродолжитьСоСкидками(СтруктураПараметров)
	
	АктивныеЛимитыКлиента = ПолучитьЛимиты();
	
	Если Не АктивныеЛимитыКлиента = Неопределено Тогда
		
		ПроверкаРолиОбходаБлокировок = ПроверитьРольОбходаБлокировок();
		
		Если ПроверкаРолиОбходаБлокировок Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтотОбъект, СтруктураПараметров);
			
			Отбор = Новый Структура();
			ПараметрыОткрытия = Новый Структура("Ключ", Отбор);
			
			Если ИмяФормы = "ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.Форма" Тогда
				ОткрытьФорму("ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.ФормаВопросаООбходеЛимитов", ПараметрыОткрытия,
				ЭтотОбъект, , , , Оповещение);
			Иначе
				ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаВопросаООбходеЛимитов", ПараметрыОткрытия,
				ЭтотОбъект, , , , Оповещение);
			КонецЕсли;
			
		Иначе
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Сумма по отмеченным объектам превышает лимит клиента ""%1""!'"), АктивныеЛимитыКлиента);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		ОтгрузитьНаСервере(Ложь, СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отгрузить(Команда)
	
	Отказ = Ложь;
	ЗаказСПеремещением = Ложь;
	// Проверка контрагентов на различие
	ПроверкаРеквизитовВыбранныхОбъектовДляОтгрузки(Отказ, ЗаказСПеремещением);
	
	Если Не Отказ Тогда
		
		Если ЗаказСПеремещением Тогда
			
			СоздатьПеремещениеТоваров();
			
		Иначе
			
			АктивныеБлокировкиКлиента = ПолучитьАктивныеБлокировки();
			
			Если Не АктивныеБлокировкиКлиента = Неопределено Тогда
				
				ПроверкаРолиОбходаБлокировок = ПроверитьРольОбходаБлокировок();
				
				Если ПроверкаРолиОбходаБлокировок Тогда
					
					СтруктураПараметров = Неопределено;
					Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтотОбъект, СтруктураПараметров);
					
					Отбор = Новый Структура();
					ПараметрыОткрытия = Новый Структура("Ключ", Отбор);
					
					Если ИмяФормы = "ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.Форма" Тогда
						ОткрытьФорму("ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.ФормаВопросаООбходеБлокировок", ПараметрыОткрытия,
						ЭтотОбъект, , , , Оповещение);
					Иначе
						ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаВопросаООбходеБлокировок", ПараметрыОткрытия,
						ЭтотОбъект, , , , Оповещение);
					КонецЕсли;
					
				Иначе
					
					Отказ = Истина;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" есть отметка блокировки, "
						+ "необходимо исключить объекты из отгрузки по контрагенту! '"), АктивныеБлокировкиКлиента);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
					Возврат;
					
				КонецЕсли;
				
			Иначе
				
				ОтгрузитьПродолжить();
				
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьАктивныеБлокировки()
	
	Блокировки = Неопределено;
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	Если Объект.ТоварыВКоробках Тогда
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				Если Строка_Т.Отгрузить И Строка_Т.БлокировкиОтгрузок Тогда
					Возврат Строка_Т.Клиент;
				КонецЕсли;
				
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	иначе
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				Если Строка_Т.Отгрузить И Строка_Т.БлокировкиОтгрузок Тогда
					Возврат Строка_Т.Клиент;
				КонецЕсли;
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
	Возврат Блокировки;
	
КонецФункции

Процедура ПроверкаРеквизитовВыбранныхОбъектовДляОтгрузки(Отказ, ЗаказСПеремещением)
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	СписокДоговоров = Новый ТаблицаЗначений;
	СписокДоговоров.Колонки.Добавить("Договор");
	
	СписокКонтрагентов = Новый ТаблицаЗначений;
	СписокКонтрагентов.Колонки.Добавить("Клиент");
	
	СписокЗаказовСезонность = Новый ТаблицаЗначений;
	СписокЗаказовСезонность.Колонки.Добавить("Сезонность");
	
	НаличиеУпаковочногоЛистаКОтгрузке = Ложь;
	
	НаличиеОбъектаСНеВернымСтатусомКМ = Ложь;
	МассивОбъектовСтатусКМ = Новый Массив;
	
	// ++ Галфинд Волков 2024/01/24
	МассивУпаковочныхЛистов = Новый Массив;
	// -- Галфинд Волков 2024/01/24
	
	// ++ Галфинд Волков 2024/02/09
	МассивЗаказов = Новый Массив;
	// -- Галфинд Волков 2024/02/09
	
	Если Объект.ТоварыВКоробках Тогда
		
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				Если Строка_Т.Отгрузить Тогда
					НаличиеУпаковочногоЛистаКОтгрузке = Истина;
					
					// ++ Галфинд Волков 2024/01/24
					МассивУпаковочныхЛистов.Добавить(Строка_Т);
					// -- Галфинд Волков 2024/01/24
					// ++ Галфинд Волков 2024/02/07
					Если Объект.ТоварыВКоробках Тогда
						
						Если Не Строка_Т.СтатусКМ = Перечисления.гф_СтатусыКМ_в_ШК.ВОбороте Тогда
							// Временное решение
							ОсобенностьУчета = Строка_Т.УпаковочныйЛистСсылка.гф_Комплектация.Владелец.ВидНоменклатуры.ОсобенностьУчета;
							
							Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда
								
								НаличиеОбъектаСНеВернымСтатусомКМ = Истина;
								
								МассивОбъектовСтатусКМ.Добавить(Строка_Т);
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					// -- Галфинд Волков 2024/02/07
					
					// ++ Галфинд Волков 2024/02/09
					МассивЗаказов.Добавить(Строка_Т.Заказ);
					// -- Галфинд Волков 2024/02/09
					
				КонецЕсли;
				
				Если Строка_Т.Отгрузить И Не Строка_Т.БлокировкиОтгрузок Тогда
					
					Стр = СписокДоговоров.Добавить();
					Стр.Договор = Строка_Т.Договор;
					
					Стр = СписокКонтрагентов.Добавить();
					Стр.Клиент = Строка_Т.Клиент;
					
					Стр = СписокЗаказовСезонность.Добавить();
					Стр.Сезонность = Строка_Т.Заказ.гф_СезонныйЗаказ;
					
					Если Строка_Т.ОтгрузкаПеремещением Тогда
						ЗаказСПеремещением = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
Иначе
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				Если Строка_Т.Отгрузить Тогда
					НаличиеУпаковочногоЛистаКОтгрузке = Истина;
					
					// ++ Галфинд Волков 2024/01/24
					МассивУпаковочныхЛистов.Добавить(Строка_Т);
					// -- Галфинд Волков 2024/01/24
					// ++ Галфинд Волков 2024/02/07
					Если Объект.ТоварыВКоробках Тогда
						
						Если Не Строка_Т.СтатусКМ = Перечисления.гф_СтатусыКМ_в_ШК.ВОбороте Тогда
							// Временное решение
							ОсобенностьУчета = Строка_Т.УпаковочныйЛистСсылка.гф_Комплектация.Владелец.ВидНоменклатуры.ОсобенностьУчета;
							
							Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда
								
								НаличиеОбъектаСНеВернымСтатусомКМ = Истина;
								
								МассивОбъектовСтатусКМ.Добавить(Строка_Т);
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					// -- Галфинд Волков 2024/02/07
					
					// ++ Галфинд Волков 2024/02/09
					МассивЗаказов.Добавить(Строка_Т.Заказ);
					// -- Галфинд Волков 2024/02/09
					
				КонецЕсли;
				
				Если Строка_Т.Отгрузить И Не Строка_Т.БлокировкиОтгрузок Тогда
					
					Стр = СписокДоговоров.Добавить();
					Стр.Договор = Строка_Т.Договор;
					
					Стр = СписокКонтрагентов.Добавить();
					Стр.Клиент = Строка_Т.Клиент;
					
					Стр = СписокЗаказовСезонность.Добавить();
					Стр.Сезонность = Строка_Т.Заказ.гф_СезонныйЗаказ;
					
					Если Строка_Т.ОтгрузкаПеремещением Тогда
						ЗаказСПеремещением = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
	Если Не НаличиеУпаковочногоЛистаКОтгрузке Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Не отмечен к отгрузке ни один объект.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// ++ Галфинд Волков 2024/02/07
	Если НаличиеОбъектаСНеВернымСтатусомКМ Тогда
		Отказ = Истина;
		
		Для Каждого МассивСтрока Из МассивОбъектовСтатусКМ Цикл
			ТекстСообщения = СтрШаблон(НСтр("ru = ' Отмечен объект %1 со статусом КМ ""%2"" не введенным в оборот!
			| Необходимо исключить из отгрузки данный объект!'"),
			МассивСтрока.УпаковочныйЛистСсылка, МассивСтрока.СтатусКМ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	// -- Галфинд Волков 2024/02/07
	
	СписокКонтрагентов.Свернуть("Клиент");
	
	Если СписокКонтрагентов.Количество() > 1 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Необходимо отметить для отгрузки объекты только по одному клиенту.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СписокДоговоров.Свернуть("Договор");
	
	Если СписокДоговоров.Количество() > 1 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Отмечены для отгрузки объекты с разными договорами! Необходимо отметить только по одному договору.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СписокЗаказовСезонность.Свернуть("Сезонность");
	
	Если СписокЗаказовСезонность.Количество() > 1 Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Отмечены заказы с разной сезонностью! Необходимо отметить объекты по заказу с одинаковой сезонностью'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// ++ Галфинд Волков 2024/01/24
	РасхождениеСостояниеКороба = Ложь;
	
	Для Каждого МассивСтрока Из МассивУпаковочныхЛистов Цикл
		// Временное решение
		ОсобенностьУчета = МассивСтрока.УпаковочныйЛистСсылка.гф_Комплектация.Владелец.ВидНоменклатуры.ОсобенностьУчета;
		
		Если ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда
			
			СостояниеКороба = Справочники.гф_СостянияКоробов.НайтиПоНаименованию(МассивСтрока.СостояниеКороба);
			ФактическоеСостояниеКороба = Неопределено;
			РасхождениеСостояниеКороба = ПроверитьДокумент(МассивСтрока.УпаковочныйЛистСсылка, СостояниеКороба, ФактическоеСостояниеКороба);
			
			Если РасхождениеСостояниеКороба Тогда
				Отказ = Истина;
				
				Если ФактическоеСостояниеКороба = Неопределено Тогда
					ФактическоеСостояниеКороба = "Фактическое состояние выбранного для отгрузки упаковочного листа определить не удалось"
				Иначе
					ФактическоеСостояниеКороба = СтрШаблон("Предположительно фактическое состояние выбранного для отгрузки упаковочного листа соответствует состоянию %1.", ФактическоеСостояниеКороба);
				КонецЕсли;	
				ТекстСообщения = СтрШаблон(НСтр("ru = ' Отмечен %1 состояние которого не соответствует наполнению его табличной части!
				| %2.
				| Необходимо исключить из отгрузки данный упаковочный лист!'"),
				МассивСтрока.УпаковочныйЛистСсылка, ФактическоеСостояниеКороба);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// ++ Галфинд Волков 2024/02/09
	СвернутыйМассивЗаказов = Новый Массив;
	
	Для Каждого Элемент Из МассивЗаказов Цикл
		Если СвернутыйМассивЗаказов.Найти(Элемент) = Неопределено Тогда
			//если такого значения в массиве еще нет, добавим его
			СвернутыйМассивЗаказов.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	НаличиеПустыхКодовСтрокВЗаказе = Ложь;
	
	Для Каждого МассивСтрока Из СвернутыйМассивЗаказов Цикл
		НаличиеПустыхКодовСтрокВЗаказе = ПроверитьЗаказКодыСтрок(МассивСтрока);
		
		Если НаличиеПустыхКодовСтрокВЗаказе Тогда
			Отказ = Истина;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1 присутствует номенклатура с пустыми Кодами строк!
			| Отгрузка отменена!
			| Необходимо перепровести заказ или исключить из отгрузки упаковочные листы по этому заказу!'"),
			МассивСтрока);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;	
	// -- Галфинд Волков 2024/02/09		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// -- Галфинд Волков 2024/01/24
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДокумент(Ссылка, СостояниеКороба, ФактическоеСостояниеКороба)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
	|	ЛОЖЬ КАК флПересорт,
	|	0 КАК КоличествоШтрихКод
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка.гф_Комплектация);
	
	Результат = Запрос.Выполнить();
	
	СоставДокумента = Результат.Выгрузить();
	
	// Далее получаем содержимое Штрих-кодов
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|ГДЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка.гф_Агрегация);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		НайденныеСтроки = СоставДокумента.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДокумента = НайденныеСтроки[0];
		Иначе
			СтрокаДокумента = СоставДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, Выборка);
			СтрокаДокумента["КоличествоУпаковок"] 	= 0;
			СтрокаДокумента["Количество"] 			= 0;
			СтрокаДокумента["КоличествоШтрихКод"] 	= 0;
			СтрокаДокумента["флПересорт"] 			= Истина;
		КонецЕсли;
		
		СтрокаДокумента["КоличествоШтрихКод"] = СтрокаДокумента["КоличествоШтрихКод"] + 1;
		
	КонецЦикла;
	
	флПересорт = Ложь;
	
	Для Каждого СтрокаДокумента Из СоставДокумента Цикл
		Если СтрокаДокумента["КоличествоУпаковок"] <> СтрокаДокумента["КоличествоШтрихКод"] Тогда
			СтрокаДокумента["флПересорт"] = Истина;
		КонецЕсли;
		флПересорт = флПересорт ИЛИ СтрокаДокумента["флПересорт"];
	КонецЦикла;
	
	ИтогКоличествоПоДокументу = СоставДокумента.Итог("КоличествоУпаковок");
	ИтогКоличествоПоШтрихКодам = СоставДокумента.Итог("КоличествоШтрихКод");
	
	Если ИтогКоличествоПоДокументу = ИтогКоличествоПоШтрихКодам И Не флПересорт Тогда
		ФактическоеСостояниеКороба = Справочники.гф_СостянияКоробов.ПолныйКомплект;
	ИначеЕсли ИтогКоличествоПоДокументу <> ИтогКоличествоПоШтрихКодам Тогда
		ФактическоеСостояниеКороба = Справочники.гф_СостянияКоробов.НеПолный;
	ИначеЕсли флПересорт Тогда
		ФактическоеСостояниеКороба = Справочники.гф_СостянияКоробов.Пересорт;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	Если ФактическоеСостояниеКороба = СостояниеКороба Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьЗаказКодыСтрок(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.КодСтроки = 0
		|	И ЗаказКлиентаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЛимиты()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	// Сбор информации по лимитам контрагента, при превышении лимита общей суммой по упаковочным листам, отмена отгрузки
	Лимиты = Неопределено;
	
	ТабСуммаОтгрузки = Новый ТаблицаЗначений;
	ТабСуммаОтгрузки.Колонки.Добавить("Клиент");
	ТабСуммаОтгрузки.Колонки.Добавить("Заказ");
	ТабСуммаОтгрузки.Колонки.Добавить("УпаковочныйЛист");
	ТабСуммаОтгрузки.Колонки.Добавить("Стоимость");
	ТабСуммаОтгрузки.Колонки.Добавить("ДействующийЛимит");
	
	Если Объект.ТоварыВКоробках Тогда
		
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				Если Строка_Т.Отгрузить И (ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
					Или (Не Объект.ТоварыВКоробках
					И ЗначениеЗаполнено(Строка_Т.Номенклатура)))
					И Не Строка_Т.ОтгрузкаПеремещением Тогда
					
					Стр = ТабСуммаОтгрузки.Добавить();
					Стр.Клиент = Строка_Т.Клиент;
					Стр.Заказ = Строка_Т.Заказ;
					Стр.УпаковочныйЛист = Строка_Т.УпаковочныйЛистСсылка;
					Стр.Стоимость = Строка_Т.Стоимость;
					Стр.ДействующийЛимит = Строка_Т.ДействующийЛимит;
					
				КонецЕсли;
			КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
Иначе
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				Если Строка_Т.Отгрузить И (ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
					Или (Не Объект.ТоварыВКоробках
					И ЗначениеЗаполнено(Строка_Т.Номенклатура)))
					И Не Строка_Т.ОтгрузкаПеремещением Тогда
					
					Стр = ТабСуммаОтгрузки.Добавить();
					Стр.Клиент = Строка_Т.Клиент;
					Стр.Заказ = Строка_Т.Заказ;
					Стр.УпаковочныйЛист = Строка_Т.УпаковочныйЛистСсылка;
					Стр.Стоимость = Строка_Т.Стоимость;
					Стр.ДействующийЛимит = Строка_Т.ДействующийЛимит;
					
				КонецЕсли;
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
	ТабСуммаОтгрузки.Свернуть("Клиент, ДействующийЛимит", "Стоимость");
	
	Для Каждого СтрокаКлиент Из ТабСуммаОтгрузки Цикл
		
		Если СтрокаКлиент.Стоимость > Число(СтрокаКлиент.ДействующийЛимит) Тогда
			
			Возврат СтрокаКлиент.Клиент;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Лимиты;
	
КонецФункции

&НаКлиенте
Процедура ОтгрузитьНаСервере(Отказ, СтруктураПереданныхДанных)
	
	ВыполнитьДействиеПоОтгрузкеСУчетомСклада(Отказ, СтруктураПереданныхДанных);
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	ПриОткрытии(Отказ);
	
КонецПроцедуры

Функция ПолучитьКоличествоУпаковокВУпаковочномЛисте(УпаковочныйЛистСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(УпаковочныйЛистТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	|ИЗ
	|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
	|ГДЕ
	|	УпаковочныйЛистТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", УпаковочныйЛистСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КоличествоУпаковок;
	КонецЦикла;
	
КонецФункции

Процедура ВыполнитьДействиеПоОтгрузкеСУчетомСклада(Отказ, СтруктураПереданныхДанных)
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	// Таблица для записи каждого заказа с конкретным списком упаковочных листов/номенклатуры по этому заказу
	// Добавляем Таблицу "НовыеДанныеДляТаблицыПоЗаказу" с новыми строками и количеством для отгрузки, количество после учета
	// комплектации по каждому упаковочному листу этого заказа
	// При успешном прохождении проверки наличия комплектации из упаковочного листа  в заказе, то "ВозможнаЗаписьЗаказа" запишется Истина
	// При успешном перепроведении заказа с новой таблицей "НовыеДанныеДляТаблицыПоЗаказу", то в "Перепроведен" запишется Истина
	ТЗ_Заказы = Новый ТаблицаЗначений;
	ТЗ_Заказы.Колонки.Добавить("Заказ");
	ТЗ_Заказы.Колонки.Добавить("СписокУпаковочныйЛистИлиНоменклатура");
	ТЗ_Заказы.Колонки.Добавить("НовыеДанныеДляТаблицыПоЗаказу");
	ТЗ_Заказы.Колонки.Добавить("НовыеДанныеДляТаблицыПоЗаказуТоварыВКоробах");
	ТЗ_Заказы.Колонки.Добавить("НовыеДанныеДляТаблицыПоЗаказуПричиныИзмененияТоварыВКоробах");
	ТЗ_Заказы.Колонки.Добавить("Перепроведение");
	ТЗ_Заказы.Колонки.Добавить("ВозможнаЗаписьЗаказа");
	ТЗ_Заказы.Колонки.Добавить("НомерАдреса");
	ТЗ_Заказы.Колонки.Добавить("ДобавленОрдер");
	
	Если Объект.ТоварыВКоробках Тогда
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				// Исключение упаковочных листов с пересортом, если пользователь выбрал в окне выбора действий "Исключить короб из отгрузки"
				Если Объект.ТоварыВКоробках И Объект.ИсключитьКоробСРасхождениями И Строка_Т.Отгрузить И ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
					И Строка_Т.СостояниеКороба = "Пересорт" Тогда
					
					Строка_Т.Отгрузить = Ложь;
					
				КонецЕсли;
				
				Если Строка_Т.Отгрузить И (ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка) Или (Не Объект.ТоварыВКоробках И ЗначениеЗаполнено(Строка_Т.Номенклатура))) Тогда
					
					НайтиЗаказ = ТЗ_Заказы.Найти(Строка_Т.Заказ, "Заказ");
					
					Если НайтиЗаказ = Неопределено Тогда
						СтрокаЗаказы = ТЗ_Заказы.Добавить();
						СтрокаЗаказы.Заказ 			= Строка_Т.Заказ;
						СтрокаЗаказы.НомерАдреса 	= Строка_Т.НомерАдреса;
						
						ТЗ_ОбъектыДляОтгрузки = Новый ТаблицаЗначений;
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("УпаковочныйЛист");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ЭлементУпаковочныйЛистНоменклатура");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("КоличествоОстаток");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Цена");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ЦенаПары");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("СписокКодовСтроки");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Перепроведение");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("КоличествоПарОбуви");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Характеристика");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Скидка");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ВидЦены");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ЦенаУпаковочногоЛиста");
						// ++ Галфинд ВолковЕВ 28.04.2023 НДС Для заполнения скрытого реквизита "гф_СуммаНоменклатуры" в документе "Расходный ордер"
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("СтавкаНДС");
						// -- Галфинд ВолковЕВ 28.04.2023
						
						СтрокаОбъектыДляОтгрузки = ТЗ_ОбъектыДляОтгрузки.Добавить();
						
						Если Объект.ТоварыВКоробках Тогда
							СтрокаОбъектыДляОтгрузки.УпаковочныйЛист 		= Строка_Т.УпаковочныйЛистСсылка;
							СтрокаОбъектыДляОтгрузки.КоличествоОстаток 		= Строка_Т.КоличествоОстаток;
							СтрокаОбъектыДляОтгрузки.ЦенаПары 				= Строка_Т.Цена; 
							СтрокаОбъектыДляОтгрузки.Скидка 				= Строка_Т.Скидка;
							
							// Подставим стоимость короба, а не номенклатуры, что бы учесть ее при формировании Расходного ордера и далее для расчета лимита 
							СтрокаОбъектыДляОтгрузки.ЦенаУпаковочногоЛиста 	= Строка_Т.Стоимость;
							СтрокаОбъектыДляОтгрузки.КоличествоПарОбуви = ПолучитьКоличествоУпаковокВУпаковочномЛисте(Строка_Т.УпаковочныйЛистСсылка);
						Иначе
							ЗаполнитьЗначенияИзСтроки(СтрокаОбъектыДляОтгрузки, Строка_Т, Объект.ТоварыВКоробках);
						КонецЕсли;
						
						СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура = ТЗ_ОбъектыДляОтгрузки;
						
					Иначе
						
						СтрокаОбъектыДляОтгрузки = НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Добавить();
						
						Если Объект.ТоварыВКоробках Тогда
							СтрокаОбъектыДляОтгрузки.УпаковочныйЛист 		= Строка_Т.УпаковочныйЛистСсылка;
							СтрокаОбъектыДляОтгрузки.КоличествоОстаток 		= Строка_Т.КоличествоОстаток;
							СтрокаОбъектыДляОтгрузки.ЦенаПары 				= Строка_Т.Цена;
							СтрокаОбъектыДляОтгрузки.ЦенаУпаковочногоЛиста 	= Строка_Т.Стоимость;
							СтрокаОбъектыДляОтгрузки.КоличествоПарОбуви = ПолучитьКоличествоУпаковокВУпаковочномЛисте(Строка_Т.УпаковочныйЛистСсылка);
						Иначе
							ЗаполнитьЗначенияИзСтроки(СтрокаОбъектыДляОтгрузки, Строка_Т, Объект.ТоварыВКоробках);
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
			
			КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
Иначе
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				// Исключение упаковочных листов с пересортом, если пользователь выбрал в окне выбора действий "Исключить короб из отгрузки"
				Если Объект.ТоварыВКоробках И Объект.ИсключитьКоробСРасхождениями И Строка_Т.Отгрузить И ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
					И Строка_Т.СостояниеКороба = "Пересорт" Тогда
					
					Строка_Т.Отгрузить = Ложь;
					
				КонецЕсли;
				
				Если Строка_Т.Отгрузить И (ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка) Или (Не Объект.ТоварыВКоробках И ЗначениеЗаполнено(Строка_Т.Номенклатура))) Тогда
					
					НайтиЗаказ = ТЗ_Заказы.Найти(Строка_Т.Заказ, "Заказ");
					
					Если НайтиЗаказ = Неопределено Тогда
						СтрокаЗаказы = ТЗ_Заказы.Добавить();
						СтрокаЗаказы.Заказ 			= Строка_Т.Заказ;
						СтрокаЗаказы.НомерАдреса 	= Строка_Т.НомерАдреса;
						
						ТЗ_ОбъектыДляОтгрузки = Новый ТаблицаЗначений;
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("УпаковочныйЛист");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ЭлементУпаковочныйЛистНоменклатура");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("КоличествоОстаток");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Цена");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ЦенаПары");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("СписокКодовСтроки");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Перепроведение");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("КоличествоПарОбуви");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Характеристика");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("Скидка");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ВидЦены");
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("ЦенаУпаковочногоЛиста");
						// ++ Галфинд ВолковЕВ 28.04.2023 НДС Для заполнения скрытого реквизита "гф_СуммаНоменклатуры" в документе "Расходный ордер"
						ТЗ_ОбъектыДляОтгрузки.Колонки.Добавить("СтавкаНДС");
						// -- Галфинд ВолковЕВ 28.04.2023
						
						СтрокаОбъектыДляОтгрузки = ТЗ_ОбъектыДляОтгрузки.Добавить();
						
						Если Объект.ТоварыВКоробках Тогда
							СтрокаОбъектыДляОтгрузки.УпаковочныйЛист 		= Строка_Т.УпаковочныйЛистСсылка;
							СтрокаОбъектыДляОтгрузки.КоличествоОстаток 		= Строка_Т.КоличествоОстаток;
							СтрокаОбъектыДляОтгрузки.ЦенаПары 				= Строка_Т.Цена; 
							СтрокаОбъектыДляОтгрузки.Скидка 				= Строка_Т.Скидка;
							
							// Подставим стоимость короба, а не номенклатуры, что бы учесть ее при формировании Расходного ордера и далее для расчета лимита 
							СтрокаОбъектыДляОтгрузки.ЦенаУпаковочногоЛиста 	= Строка_Т.Стоимость;
							СтрокаОбъектыДляОтгрузки.КоличествоПарОбуви = ПолучитьКоличествоУпаковокВУпаковочномЛисте(Строка_Т.УпаковочныйЛистСсылка);
						Иначе
							ЗаполнитьЗначенияИзСтроки(СтрокаОбъектыДляОтгрузки, Строка_Т, Объект.ТоварыВКоробках);
						КонецЕсли;
						
						СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура = ТЗ_ОбъектыДляОтгрузки;
						
					Иначе
						
						СтрокаОбъектыДляОтгрузки = НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Добавить();
						
						Если Объект.ТоварыВКоробках Тогда
							СтрокаОбъектыДляОтгрузки.УпаковочныйЛист 		= Строка_Т.УпаковочныйЛистСсылка;
							СтрокаОбъектыДляОтгрузки.КоличествоОстаток 		= Строка_Т.КоличествоОстаток;
							СтрокаОбъектыДляОтгрузки.ЦенаПары 				= Строка_Т.Цена;
							СтрокаОбъектыДляОтгрузки.ЦенаУпаковочногоЛиста 	= Строка_Т.Стоимость;
							СтрокаОбъектыДляОтгрузки.КоличествоПарОбуви = ПолучитьКоличествоУпаковокВУпаковочномЛисте(Строка_Т.УпаковочныйЛистСсылка);
						Иначе
							ЗаполнитьЗначенияИзСтроки(СтрокаОбъектыДляОтгрузки, Строка_Т, Объект.ТоварыВКоробках);
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
			
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КонецЕсли;
	
	// Если отмечены были только упаковочные листы с пересортом или не полные и пользователь
	// их исключил из отгрузки, то количество для отгрузки равно нулю
	Если ТЗ_Заказы.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Не отмечен ни один объект.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
		
	// Для каждого заказа по отмеченным упаковочным листам/номенклатура формируем отгрузку и перезаполняем данные в таблицах заказа
	Для Каждого СтрокаЗаказы Из ТЗ_Заказы Цикл
		
// Окунев 2023.12.22 {
		СтруктураПереданныхДанных.Вставить("Заказ", СтрокаЗаказы.Заказ); 
// Окунев 2023.12.22 }

		ВозможнаЗаписьЗаказа = Ложь;
		
		ОбъектЗаказ = СтрокаЗаказы.Заказ.ПолучитьОбъект();
		
		// Копируем данные на случай, если одна номенклатура или один из упаковочных листов не сможет пройти отгрузку по количеству в заказе,
		// тогда заменим таблицу данными до изменения таблицы заказа
		ТЗ_Заказ_Товары = Новый ТаблицаЗначений;
		ТЗ_Заказ_Товары = ОбъектЗаказ.Товары.Выгрузить();
		
		// Таблица для хранения колонок полученных из таблицы заказа "Товары", используется для копирования колонок в новые таблицы "ТЗ" 
		// с колонками при прохождении цикла по каждой строке отмеченных упаковочных листов/номенклатура
		ТЗКолонкиТоваровЗаказа = Новый ТаблицаЗначений;
		ТЗКолонкиТоваровЗаказа = ОбъектЗаказ.Товары.Выгрузить();
		ТЗКолонкиТоваровЗаказа.Очистить();
		
		// Копируем данные на случай, если один из упаковочных листов/номенклатура не сможет пройти отгрузку по количеству в заказе,
		// тогда заменим таблицу данными до изменения таблицы заказа, данными из упаковочного листа
		// Используется для временного копирования и хранения оригинальных данных
		ТабВременная_ТЗ_Заказ_Товары = Новый ТаблицаЗначений;
		ТабВременная_ТЗ_Заказ_Товары = ТЗ_Заказ_Товары.Скопировать();
		
		// Для отгрузки упаковочных листов
		Если Объект.ТоварыВКоробках Тогда
			
			ТЗ_Заказ_ТоварыВКоробах = Новый ТаблицаЗначений;
			ТЗ_Заказ_ТоварыВКоробах = ОбъектЗаказ.гф_ТоварыВКоробах.Выгрузить();
			
			ТЗ_ПричиныИзмененияТоварыВКоробах = Новый ТаблицаЗначений;
			ТЗ_ПричиныИзмененияТоварыВКоробах = ОбъектЗаказ.гф_ПричиныИзмененияТоваровВКоробах.Выгрузить();
			
			// Таблица для хранения колонок полученных из таблицы заказа "гф_ТоварыВКоробах"
			ТЗКолонкиТоварыВКоробахЗаказа = Новый ТаблицаЗначений;
			ТЗКолонкиТоварыВКоробахЗаказа = ОбъектЗаказ.гф_ТоварыВКоробах.Выгрузить();
			ТЗКолонкиТоварыВКоробахЗаказа.Очистить();
			
			// Таблица для хранения колонок полученных из таблицы заказа "гф_ПричиныИзмененияТоваровВКоробах"
			ТЗКолонкиПричиныИзмененияТоваровВКоробах = Новый ТаблицаЗначений;
			ТЗКолонкиПричиныИзмененияТоваровВКоробах = ОбъектЗаказ.гф_ПричиныИзмененияТоваровВКоробах.Выгрузить();
			ТЗКолонкиПричиныИзмененияТоваровВКоробах.Очистить();
			
		    // Копируем на случай, если один из упаковочных листов не сможет пройти отгрузку по количеству в заказе
			// Используется для временного копирования и хранения оригинальных данных
			ТабВременная_ТЗ_Заказ_ТоварыВКоробах = Новый ТаблицаЗначений;
			ТабВременная_ТЗ_Заказ_ТоварыВКоробах = ТЗ_Заказ_ТоварыВКоробах.Скопировать();
			
			// Копируем на случай, если один из упаковочных листов не сможет пройти отгрузку по количеству в заказе
			// Используется для временного копирования и хранения оригинальных данных
			ТабВременная_ТЗ_Заказ_ПричиныИзмененияТоварыВКоробах = Новый ТаблицаЗначений;
			ТабВременная_ТЗ_Заказ_ПричиныИзмененияТоварыВКоробах = ТЗ_ПричиныИзмененияТоварыВКоробах.Скопировать();
			
		КонецЕсли;
	
		Для Каждого СтрокаУпаковочныйЛистНоменклатура Из СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура Цикл
			
			УпЛистНайден = Ложь;
			ОтказЗаписьУпаковочногоЛиста = Ложь;
			
			// Временная пустая таблица для записи новых данных по Товарам
			ТЗ_Новая_Заказ_Товары = Новый ТаблицаЗначений;
			ТЗ_Новая_Заказ_Товары = ТЗКолонкиТоваровЗаказа.СкопироватьКолонки();
			
			Если Объект.ТоварыВКоробках Тогда
				
				// Временная пустая таблица для записи новых данных по Упаковочным листам
				ТЗ_Новая_Заказ_ТоварыВКоробах = Новый ТаблицаЗначений;
				ТЗ_Новая_Заказ_ТоварыВКоробах = ТЗКолонкиТоварыВКоробахЗаказа.СкопироватьКолонки();
				
				// Временная пустая таблица для записи новых данных по Упаковочным листам
				ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах = Новый ТаблицаЗначений;
				ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах = ТЗКолонкиПричиныИзмененияТоваровВКоробах.СкопироватьКолонки();
				
				ТабКомплектация = Новый ТаблицаЗначений;
				ТабКомплектация.Колонки.Добавить("Номенклатура");
				ТабКомплектация.Колонки.Добавить("Характеристика");
				ТабКомплектация.Колонки.Добавить("Количество");
				// Данное поле используется для записи количества пересорта, которого нет в варианте комплектации,
				// что бы рпботе с табличной частью заказа добавить это количество
				ТабКомплектация.Колонки.Добавить("КоличествоУпаковок");
				
				// Получение списка номенклатуры входящей в упаковочный лист для последующего разделения строк с вычетом количества
				// из обрабатываемой текущей строки в заказе согласно перебираемым строкам эталонной комплектации упаковочного листа
				Для Каждого СтрокаКомплектация Из СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.Товары Цикл
					НоваяСтрокаКомплектация = ТабКомплектация.Добавить();
					НоваяСтрокаКомплектация.Номенклатура 	= СтрокаКомплектация.Номенклатура;
					НоваяСтрокаКомплектация.Характеристика 	= СтрокаКомплектация.Характеристика;
					НоваяСтрокаКомплектация.Количество 		= СтрокаКомплектация.Количество;
				КонецЦикла;
				
				// Таблица для записи кодов строк из заказа для последующей записи в табличную часть упаковочного листа
				СписокКодовСтрокиПоУпаковочнымЛистам = Новый ТаблицаЗначений;
				СписокКодовСтрокиПоУпаковочнымЛистам.Колонки.Добавить("УпаковочныйЛист");
				СписокКодовСтрокиПоУпаковочнымЛистам.Колонки.Добавить("КодСтроки");
				СписокКодовСтрокиПоУпаковочнымЛистам.Колонки.Добавить("Номенклатура");
				СписокКодовСтрокиПоУпаковочнымЛистам.Колонки.Добавить("Характеристика");
				СписокКодовСтрокиПоУпаковочнымЛистам.Колонки.Добавить("Количество");
			КонецЕсли;
			
			ТекстСообщения = "";
			
			// Разбиваем строки Упаковочных листов, записываем скидкиРТУ, датуРТУ и комментарийРТУ.
			// Перебираем строки согласно варианту комплектации упаковочного листа, эталон варианта комплектации сравнивается с текущим
			// состояним короба (Не полный, Пересорт) передаем дальше скидку "СкидкаВКоробах" по текущемуупаковочному листу,
			// с последующей записью для включения "СкидкаВКоробах" в отбор поиска строк по номеменклатуре и характеристике 
			Если Объект.ТоварыВКоробках Тогда
				
				ВозвратПродолжить 	= Ложь;
				Отказ 				= Ложь;
				
				ОбработкаЗаполненияТоваровВКоробах(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, СтрокаУпаковочныйЛистНоменклатура,
					СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,ТЗ_Новая_Заказ_ТоварыВКоробах,
					ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах, ТабКомплектация,
					СписокКодовСтрокиПоУпаковочнымЛистам, ТекстСообщения);
					
				Если Отказ Тогда
					Если ЗначениеЗаполнено(ТекстСообщения) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;	
					Возврат;
				ИначеЕсли ВозвратПродолжить Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				ОбработкаЗаполненияТоваров(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных,
					ОбъектЗаказ);
				
			КонецЕсли;	
			
			Если Объект.ТоварыВКоробках Тогда
				
				Если Не ОтказЗаписьУпаковочногоЛиста Тогда
					
					Для Каждого СтрокаТаблицыИсточника Из ТЗ_Новая_Заказ_Товары Цикл
						СтрокаТаблицыПриемника = ТЗ_Заказ_Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
					КонецЦикла;
					
					ТабВременная_ТЗ_Заказ_Товары = ТЗ_Заказ_Товары.Скопировать();
					
					Для Каждого СтрокаТаблицыИсточника Из ТЗ_Новая_Заказ_ТоварыВКоробах Цикл
						СтрокаТаблицыПриемника = ТЗ_Заказ_ТоварыВКоробах.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
					КонецЦикла;
					
					ТабВременная_ТЗ_Заказ_ТоварыВКоробах = ТЗ_Заказ_ТоварыВКоробах.Скопировать();
					
					// Добавление строк в таблицы "гф_ПричиныИзмененияТоваровВКоробах" с историей по комплектации
					Для Каждого СтрокаТаблицыИсточника Из ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах Цикл
						СтрокаТаблицыПриемника = ТЗ_ПричиныИзмененияТоварыВКоробах.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
					КонецЦикла;
					
					ТабВременная_ТЗ_Заказ_ПричиныИзмененияТоварыВКоробах = ТЗ_ПричиныИзмененияТоварыВКоробах.Скопировать();
					
					СтрокаУпаковочныйЛистНоменклатура.СписокКодовСтроки = СписокКодовСтрокиПоУпаковочнымЛистам;
					
				Иначе
					// Возвращаем состояние таблиц до обработки упаковочного листа или номенклатуры
					ТЗ_Заказ_Товары 						= ТабВременная_ТЗ_Заказ_Товары.Скопировать();
					ТЗ_Заказ_ТоварыВКоробах 				= ТабВременная_ТЗ_Заказ_ТоварыВКоробах.Скопировать();
					ТЗ_ПричиныИзмененияТоварыВКоробах 		= ТабВременная_ТЗ_Заказ_ПричиныИзмененияТоварыВКоробах.Скопировать();
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
										
				КонецЕсли;
				
			Иначе
				
				Для Каждого СтрокаТаблицыИсточника Из ТЗ_Новая_Заказ_Товары Цикл
					СтрокаТаблицыПриемника = ТЗ_Заказ_Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
				КонецЦикла;
				
			КонецЕсли;
	
		КонецЦикла;
		
		СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказу 										= ТЗ_Заказ_Товары;
		СтрокаЗаказы.ВозможнаЗаписьЗаказа 												= Истина;
		
		Если Объект.ТоварыВКоробках Тогда
			ТЗ_Заказ_ТоварыВКоробах.Свернуть("ВариантКомплектации, Артикул, ЦенаКороба, IDКороба, Добавлено, ПричинаДобавления, Отменено, ПричинаОтмены, ИдентификаторСтроки, ВидЦены,"
			+ "Скидка, СкидкаДляРТУ, ДатаДляРТУ, КомментарийРТУ, ЦенаКоробаСоСкидкой, СтавкаНДС, ВариантОбеспечения,ПрайсЛистДляРТУ", "Количество, Сумма, СуммаНДС, СуммаСНДС");
		
			СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказуТоварыВКоробах 					= ТЗ_Заказ_ТоварыВКоробах;
			СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказуПричиныИзмененияТоварыВКоробах 	= ТЗ_ПричиныИзмененияТоварыВКоробах;
		КонецЕсли;
		
	КонецЦикла;
	
	// Поиск заказов с одинаковым адресом для отгрузки для создания одного ордера по ним а не по каждому заказу
	КопияТаб = ТЗ_Заказы.Скопировать();
	КопияТаб.Свернуть("НомерАдреса");
	
	Для Каждого СтрокаКопия Из КопияТаб Цикл
		
		НайденныеСтроки = ТЗ_Заказы.НайтиСтроки(Новый Структура("НомерАдреса", СтрокаКопия.НомерАдреса));
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Проверка = Истина;
			
			Для Каждого СтрокаЗаказы Из НайденныеСтроки Цикл
				
				Если Не (СтрокаЗаказы.ВозможнаЗаписьЗаказа И СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказу.Количество() > 0) Тогда
					Проверка = Ложь;
					СообщениеЗаказ = "" + СтрокаЗаказы.Заказ;
				КонецЕсли;
				
				// ++ Галфинд ВолковЕВ 2024/01/15
				СтрокаЗаказы.Перепроведение = Ложь;
				// -- Галфинд ВолковЕВ 2024/01/15
				
			КонецЦикла;
			
			Если Не Проверка Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось выполнить запись заказа/ов %1'"), СообщениеЗаказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаЗаказы Из НайденныеСтроки Цикл
				
				// Транзакция проводит документы заказ, расходный ордер, упаковочный лист
				// и изменяет агрегацию (элементы справочника с кодами маркировки)
				НачатьТранзакцию();
				
				ОбъектЗаказ = СтрокаЗаказы.Заказ.ПолучитьОбъект();
				
				Попытка
					ОбъектЗаказ.Заблокировать();
				Исключение
					ТекстСообщения = СтрШаблон(НСтр("ru = '%1 находится в процессе редактирования и не может быть изменен.'"), ОбъектЗаказ);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					Прервать;
				КонецПопытки;
				
				// Загрузка таблицы с новыми данными по отгрузке по заказу с учетом комплектации всех прошедших проверку упаковочных листов 
				// и доступного наличии количества номенклатуры для отгрузки в заказе
				ОбъектЗаказ.Товары.Загрузить(СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказу);
				
				Если Объект.ТоварыВКоробках Тогда
					// Загрузка таблицы с новыми данными по ТоварыВКоробах
					Если СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказуТоварыВКоробах.Количество() > 0 Тогда
						ОбъектЗаказ.гф_ТоварыВКоробах.Загрузить(СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказуТоварыВКоробах);
					КонецЕсли;	
					// Загрузка таблицы с новыми данными по ПричиныИзмененияТоварыВКоробах
					Если СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказуПричиныИзмененияТоварыВКоробах.Количество() > 0 Тогда
						ОбъектЗаказ.гф_ПричиныИзмененияТоваровВКоробах.Загрузить(СтрокаЗаказы.НовыеДанныеДляТаблицыПоЗаказуПричиныИзмененияТоварыВКоробах);
					КонецЕсли;
				КонецЕсли;
				
				// Запись нового максимального значения кода строки в заказ, так как ранее разбивали строки в заказе и проставляли код строки
				ТЗМакс = ОбъектЗаказ.Товары.Выгрузить(, "КодСтроки");
				
				МаксКодСтроки = Новый СравнениеЗначений;
				ТЗМакс.Сортировать("КодСтроки Убыв", МаксКодСтроки);
				ОбъектЗаказ.МаксимальныйКодСтроки = ТЗМакс[0].КодСтроки;
				
				ОбъектЗаказ.ДополнительныеСвойства.Вставить("гф_ОбработкаОтгрузкаПоЗаказам", Истина);
				
				Попытка
					
					ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					
					СтрокаЗаказы.Перепроведение = Истина;
					
				Исключение
					
					СтрокаЗаказы.Перепроведение = Ложь;
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьАктивнуюТранзакцию();
					КонецЕсли;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Заказ не проведен ""%1"" и расходный ордер не сформирован.'"),
					СтрокаЗаказы.Заказ);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документа ""Заказ клиента""'"),
						УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ВызватьИсключение;
					
				КонецПопытки;
				
			КонецЦикла;
			
			Проверка = Истина;
			
			Для Каждого СтрокаЗаказы Из НайденныеСтроки Цикл
				
				Если Не СтрокаЗаказы.Перепроведение Тогда
					Проверка = Ложь;
					СообщениеЗаказ = "" + СтрокаЗаказы.Заказ;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не Проверка Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось выполнить перепроведение заказа/ов %1'"), СообщениеЗаказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			Распоряжения 		= Новый Массив;
			ОбъектыДляОрдера 	= Новый Массив;
			ОбъектыЗаказы 		= Новый Массив;
			
			Для Каждого СтрокаЗаказы Из НайденныеСтроки Цикл
				Распоряжения.Добавить(СтрокаЗаказы.Заказ);
				ОбъектыДляОрдера.Добавить(СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура);
				ОбъектыЗаказы.Добавить(СтрокаЗаказы.Заказ.ПолучитьОбъект());
			КонецЦикла;
			
			МассивРаспоряжений.ЗагрузитьЗначения(Распоряжения);
			
			Попытка
				
				// Проведение документов расходный ордер и упаковочный лист, изменение статуса агрегации (справочник кодов маркировки)
				// Дополнительно передаем "ОбъектЗаказ" для получения табличной части "Товары" и последующего отбора по коду строки
				СтруктураЗадания = ОформитьРасходныеОрдераНаСервере(ОбъектыДляОрдера, Отказ, ОбъектыЗаказы);
				
				Если Не Отказ Тогда
					Если ТранзакцияАктивна() Тогда
						ЗафиксироватьАктивнуюТранзакцию();
						
						Для Каждого Стр Из СтруктураЗадания.ОформленныеОрдера Цикл
							
							РасходныйОрдерПредставление = Стр.РасходныйОрдер;
							Прервать;
							
						КонецЦикла;
						
						Для Каждого МассивЗаказ Из ОбъектыЗаказы Цикл
							
							ТекстСообщения = СтрШаблон(НСтр("ru = 'По заказу ""%1"" сформирован и проведен расходный ордер ""%2""!'"),
												МассивЗаказ, РасходныйОрдерПредставление);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							
						КонецЦикла;
						
					КонецЕсли;
				Иначе
					Если ТранзакцияАктивна() Тогда
						ОтменитьАктивнуюТранзакцию();
					КонецЕсли;
					
					Возврат;
					
				КонецЕсли;
				
			Исключение
				
				// Возможна ситуация когда в момент работы обработки по отгрузке, изменятся доступные остатки
				Если ТранзакцияАктивна() Тогда
					ОтменитьАктивнуюТранзакцию();
				КонецЕсли;
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Заказ ""%1"" сформирован но расходный ордер не проведен. Выполнена отмена изменения заказа!'"),
									СтрокаЗаказы.Заказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документа ""Расходный ордер""'"), УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, ДобавленоПоПричине = Ложь)
	
	Если НоваяСтрока <> Неопределено И Не ДобавленоПоПричине Тогда
		
		ДобавитьСтрокуДляПересчетаСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы, ТекущаяСтрока);
		ДобавитьСтрокуДляПересчетаСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы, НоваяСтрока);
		
		ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
		
	ИначеЕсли НоваяСтрока <> Неопределено И ДобавленоПоПричине Тогда
		
		СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
		
		СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
		СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
		
		ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуЗавершениеПересорт(Строка, ДополнительныеПараметры)
	
	СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
	
	СтруктураПересчетаСуммы.Строки.Добавить(Строка);
	СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + Строка[СтруктураПересчетаСуммы.ИмяПоляКоличество];
	
	ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
	
КонецПроцедуры


Процедура ДобавитьСтрокуЗавершениеНеПолный(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока)
	
	// Рассмотреть возможность, что бы пересчет по одной строке был, а не сразу две
	
	СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
	
	СтруктураПересчетаСуммы.Строки.Добавить(ТекущаяСтрока);
	СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + ТекущаяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
	
	СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
	СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
	
	ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
	
КонецПроцедуры

Процедура РазбитьСтрокуЗавершениеПересорт(Строка, ДополнительныеПараметры)
	
	СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
	
	СтруктураПересчетаСуммы.Строки.Добавить(Строка);
	СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + Строка[СтруктураПересчетаСуммы.ИмяПоляКоличество];
	
	ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
	
КонецПроцедуры

Процедура РазбитьСтрокуЗавершениеНеПолный(НоваяСтрока, ДополнительныеПараметры)
	
	СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
	
	СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
	СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
	
	ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
	
КонецПроцедуры

// Добавляет строку для пересчета суммы в структуру пересчета суммы, описание см. функция
//                            ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы.
//
// Параметры:
//  СтруктураПересчетаСуммы - см. ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы
//  Строка - ДанныеФормыЭлементКоллекции - строка, для которой необходимо рассчитать значения сумм.
//
Процедура ДобавитьСтрокуДляПересчетаСуммы(СтруктураПересчетаСуммы, Строка) Экспорт

	СтруктураПересчетаСуммы.Строки.Добавить(Строка);
	СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + Строка[СтруктураПересчетаСуммы.ИмяПоляКоличество];

КонецПроцедуры

// Пересчитывает суммы в строках, добавленных в структуру пересчета суммы, описание см. функция
//                            ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы.
//
// Параметры:
//  СтруктураПересчетаСуммы - см. ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы
//
Процедура ПересчитатьСуммы(СтруктураПересчетаСуммы)
	
	РазрядностиОкругления = Неопределено;
	Если СтруктураПересчетаСуммы.Свойство("РазрядностиОкругления") Тогда
		РазрядностиОкругления = СтруктураПересчетаСуммы.РазрядностиОкругления;
	КонецЕсли;
	
	Для Каждого Строка Из СтруктураПересчетаСуммы.Строки Цикл
		
		Если СтруктураПересчетаСуммы.ИтогКоличество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Коэффициент = Строка[СтруктураПересчетаСуммы.ИмяПоляКоличество] / СтруктураПересчетаСуммы.ИтогКоличество;
		СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество - Строка[СтруктураПересчетаСуммы.ИмяПоляКоличество];
		
		Для Каждого Поле Из СтруктураПересчетаСуммы.Поля Цикл
			
			НовоеЗначение = Поле.Значение * Коэффициент;
			
			Если РазрядностиОкругления <> Неопределено Тогда
				Строка[Поле.Ключ] = Окр(НовоеЗначение, РазрядностиОкругления[Поле.Ключ]);
			Иначе
				Строка[Поле.Ключ] = НовоеЗначение;
			КонецЕсли;
			
			СтруктураПересчетаСуммы.Поля[Поле.Ключ] = Поле.Значение - Строка[Поле.Ключ];
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПараметрыОбработкиПересорт(ДополнительныеПараметры, Количество)
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ДополнительныеПараметры", 		ДополнительныеПараметры);
	ПараметрыОбработки.Вставить("Количество", 					Количество);
	
	Возврат ПараметрыОбработки;
	
КонецФункции

Функция ПолучитьПараметрыОбработки(ТабличнаяЧасть, ЭлементФормы, ОповещениеПослеРазбиения, ПараметрыРазбиенияСтроки, ДополнительныеПараметры, Количество)
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ТабличнаяЧасть", 				ТабличнаяЧасть);
	ПараметрыОбработки.Вставить("ЭлементФормы", 				ЭлементФормы);
	ПараметрыОбработки.Вставить("ОповещениеПослеРазбиения", 	ОповещениеПослеРазбиения);
	ПараметрыОбработки.Вставить("ПараметрыРазбиенияСтроки", 	ПараметрыРазбиенияСтроки);
	ПараметрыОбработки.Вставить("ДополнительныеПараметры", 		ДополнительныеПараметры);
	ПараметрыОбработки.Вставить("Количество", 					Количество);
	
	Возврат ПараметрыОбработки;
	
КонецФункции

Процедура ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(ТоварыВКоробках, СписокКодовСтроки, ТекущаяСтрока, УпаковочныйЛист)
	
	Если ТоварыВКоробках Тогда
		НоваяСтрокаСписокКодовСтроки = СписокКодовСтроки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСписокКодовСтроки, ТекущаяСтрока);
		НоваяСтрокаСписокКодовСтроки.УпаковочныйЛист = УпаковочныйЛист;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДополнительныеПараметры(СтрокаТоварыВКоробах, ОбрабатываетсяСтрокаУпаковочногоЛиста)
	
	Если ОбрабатываетсяСтрокаУпаковочногоЛиста Тогда
		СтруктураПересчетаСуммы = СтруктураПересчетаСуммы(
			"Количество, Сумма, СуммаНДС, СуммаСНДС", "Количество");
	Иначе
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы(
			"Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаРучнойСкидки", "КоличествоУпаковок");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураПересчетаСуммы", СтруктураПересчетаСуммы);
	
	ОбработкаТабличнойЧастиКлиентСервер.ЗаполнитьСтруктуруПересчетаСуммы(СтруктураПересчетаСуммы, СтрокаТоварыВКоробах);
	
	Для Каждого СтрокаПересчета Из СтруктураПересчетаСуммы.Поля Цикл
		Если СтрокаПересчета.Значение = Неопределено Тогда
			
			СтруктураПересчетаСуммы.Поля[СтрокаПересчета.Ключ] = 0;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция ПолучитьДополнительныеПараметрыПересорт(СтрокаТоварыВКоробах)
	
	СтруктураПересчетаСуммы = СтруктураПересчетаСуммы("Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаРучнойСкидки", "КоличествоУпаковок");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураПересчетаСуммы", СтруктураПересчетаСуммы);
	
	ЗаполнитьСтруктуруПересчетаСуммы(СтруктураПересчетаСуммы, СтрокаТоварыВКоробах);
	
	Для Каждого СтрокаПересчета Из СтруктураПересчетаСуммы.Поля Цикл
		Если СтрокаПересчета.Значение = Неопределено Тогда
			
			СтруктураПересчетаСуммы.Поля[СтрокаПересчета.Ключ] = 0;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

// Инициализирует структуру для пересчета суммы в табличной части документа
//
// Параметры:
//  СтруктураПересчетаСуммы - Структура - структура подлежащая инициализации, описание см. функция
//                            ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы.
//  ДанныеЗаполнения - ДанныеФормыЭлементКоллекции - строка, содержащая значения суммовых показателей,
//                     которые необходимо будет распределить между строками при пересчете сумм.
//
// Возвращаемое значение
//  Структура - Структура со следующими полями:
//              Поля - Структура - содержит поля для пересчета суммы в табличной части документа,
//              Строки - Массив - содержит элементы типа ДанныеФормыЭлементКоллекции, ссылки нас строки для пересчета сумм,
//              ИтогКоличество - Число - сумма значений в поле "Количество" в строках переданных в параметре "Строки".
//
Процедура ЗаполнитьСтруктуруПересчетаСуммы(СтруктураПересчетаСуммы, ДанныеЗаполнения) Экспорт

	ЗаполнитьЗначенияСвойств(СтруктураПересчетаСуммы.Поля, ДанныеЗаполнения);

	СтруктураПересчетаСуммы.ИтогКоличество = 0;
	СтруктураПересчетаСуммы.Строки.Очистить();

КонецПроцедуры

// Возвращает структуру, содержащую поля для пересчета суммы в табличной части документа.
//
// Параметры:
//  Реквизиты - Строка - Содержит имена полей, заданных через запятую,
//  ИмяПоляКоличество     - Строка - Имя поля, по которому считается коэффициент пропорциональности.
//  РазрядностиОкругления - Структура - структура, в формате ИмяПоля => Количество знаков дробной части, которая будет
//                                      использоваться при пересчете реквизитов.
//
// Возвращаемое значение:
//  Структура - Структура со следующими полями:
//            * Поля - Структура - содержит поля для пересчета суммы в табличной части документа
//            * Строки - Массив - содержит элементы типа ДанныеФормыЭлементКоллекции, ссылки нас строки для пересчета сумм
//            * ИтогКоличество - Число - сумма значений в поле "Количество" в строках переданных в параметре "Строки"
//            * ИмяПоляКоличество - Строка
//            * РазрядностиОкругления - Структура
//
Функция СтруктураПересчетаСуммы(Реквизиты, ИмяПоляКоличество = "Количество", РазрядностиОкругления = Неопределено) Экспорт

	Поля = Новый Структура(Реквизиты);
	
	Результат = Новый Структура;
	Результат.Вставить("Поля", Поля);
	Результат.Вставить("Строки", Новый Массив());
	Результат.Вставить("ИтогКоличество", 0);
	Результат.Вставить("ИмяПоляКоличество", ИмяПоляКоличество);
	Результат.Вставить("РазрядностиОкругления", РазрядностиОкругления);

	Возврат Результат;

КонецФункции

Процедура ПолучитьМаксНомерСтроки(Таблица0, Таблица1, НоваяСтрока)
	
	ТЗМакс 			= Таблица0.Скопировать( , "КодСтроки");
	ТоварыМакс 		= Таблица1.Скопировать( , "КодСтроки");
	
	Если ТЗМакс.Количество() > 0 Тогда
		МаксКодСтроки = Новый СравнениеЗначений;
		ТЗМакс.Сортировать("КодСтроки Убыв", МаксКодСтроки);
		МаксимальныйКодСтрокиТЗ = ТЗМакс[0].КодСтроки;
	Иначе
		МаксимальныйКодСтрокиТЗ = 0;
	КонецЕсли;
	
	Если ТоварыМакс.Количество() > 0 Тогда
		МаксКодСтроки = Новый СравнениеЗначений;
		ТоварыМакс.Сортировать("КодСтроки Убыв", МаксКодСтроки);
		МаксимальныйКодСтрокиТовары = ТоварыМакс[0].КодСтроки;
	Иначе
		МаксимальныйКодСтрокиТовары = 0;
	КонецЕсли;
	
	Если МаксимальныйКодСтрокиТЗ > МаксимальныйКодСтрокиТовары Тогда
		МаксимальныйКодСтроки = МаксимальныйКодСтрокиТЗ;
	Иначе
		МаксимальныйКодСтроки = МаксимальныйКодСтрокиТовары;
	КонецЕсли;
	
	НоваяСтрока.КодСтроки = МаксимальныйКодСтроки + 1;
	
КонецПроцедуры

// ++ Галфинд Окунев 2023.12.24
// Комментарий и скидки для РТУ 
//
// Параметры:
//
// КомментарийРТУ				- Строка
// СкидкаДляРТУ					- Число
// ДатаДляРТУ					- Дата
// ПроцентРучнойСкидки			- Число 
// СтруктураПереданныхДанных	- Структура 
// ПрайсЛистДляРТУ				- СправочникСсылка
//
&НаСервере
Процедура ПолучитьКомментарийИСкидкиДляРТУ(КомментарийРТУ, СкидкаДляРТУ, ДатаДляРТУ, 
	ПроцентРучнойСкидки, СтруктураПереданныхДанных, ПрайсЛистДляРТУ)
	
	Если РасчетЦен = 2 Тогда // По прайс-листу
		
		ПрайсЛистДляРТУ = Объект.ВидЦены;
		
	Иначе	
		
		ПрайсЛистДляРТУ = Справочники.ВидыЦен.ПустаяСсылка();
		
	КонецЕсли;    
	
	ДанныеДляРТУ = СтруктураПереданныхДанных.Результат;
	
	МассивСтрокКомментария = Новый Массив;
	
	ЗначениеСто = 100;   
	
	Для Каждого СтрокаСтруктураПереданныхДанных Из ДанныеДляРТУ Цикл
		
		Если СтрокаСтруктураПереданныхДанных.Заказ = СтруктураПереданныхДанных.Заказ Тогда
			
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла;	
	
	ДатаДляРТУ = СтрокаСтруктураПереданныхДанных.ДатаДляРТУ;
	
	Комментарий = СтрШаблон("Дата получения цен %1.", Формат(СтрокаСтруктураПереданныхДанных.ДатаДляРТУ, "ДФ=dd.MM.yyyy"));
	
	МассивСтрокКомментария.Добавить(Комментарий); 
	
	Если ТипЗнч(СтрокаСтруктураПереданныхДанных.РучнаяСкидка) = Тип("СписокЗначений") Тогда
		
		РучнаяСкидка = 0;
		
		Для Каждого Элемент Из СтрокаСтруктураПереданныхДанных.РучнаяСкидка Цикл
			
			Если Элемент.Значение = 0 Тогда
				
				Продолжить;
				
			КонецЕсли;	
			
			РучнаяСкидка = РучнаяСкидка + Элемент.Значение;    
			
			Комментарий = СтрШаблон("%1 %2%%.", СокрЛП(Элемент.Представление), Элемент.Значение);
			
			МассивСтрокКомментария.Добавить(Комментарий);
			
		КонецЦикла;	
		
	Иначе
		
		РучнаяСкидка = ПроцентРучнойСкидки;
		
		Если РучнаяСкидка Тогда
		
			Комментарий = СтрШаблон("Скидка из заказа %1%%.", РучнаяСкидка);
			
			МассивСтрокКомментария.Добавить(Комментарий);    
		
		КонецЕсли;
		
	КонецЕсли;	
	
	ОбщаяСкидкаКоэффициент = (ЗначениеСто - РучнаяСкидка) / ЗначениеСто;  
	
	ПрименитьСкидкиКСтроке(ОбщаяСкидкаКоэффициент, СтрокаСтруктураПереданныхДанных.Скидки, 
	МассивСтрокКомментария);
	
	ПрименитьСкидкиКСтроке(ОбщаяСкидкаКоэффициент, СтрокаСтруктураПереданныхДанных.Наценки, 
	МассивСтрокКомментария, Истина);
	
	СкидкаДляРТУ = ЗначениеСто - (ОбщаяСкидкаКоэффициент * ЗначениеСто);
	
	Если СкидкаДляРТУ > 0 Тогда
		
		Комментарий = СтрШаблон("Итоговая скидка %1%%.", СкидкаДляРТУ);
		
	ИначеЕсли СкидкаДляРТУ < 0 Тогда 
		
		Комментарий = СтрШаблон("Итоговая наценка %1%%.", -СкидкаДляРТУ);
		
	Иначе
		
		Комментарий= "Итоговая скидка отстутствует.";
		
	КонецЕсли;  
	
	МассивСтрокКомментария.Добавить(Комментарий); 
	
	КомментарийРТУ = СтрСоединить(МассивСтрокКомментария, " ");
	
КонецПроцедуры 

// -- Галфинд Окунев 2023.12.24

Процедура ДобавитьСтрокуРазбиениемДляУпаковочногоЛиста(ПараметрыОбработки, НоваяТаблица, ТекущаяСтрока, СтруктураПереданныхДанных,
	ПроверкаОтказ, СкидкаДляРТУДляЗаписьВОрдер, ПрайсЛистДляРТУДляЗаписьВОрдер)
	
	Количество = ПараметрыОбработки.Количество;
	
	ПараметрыРазбиенияСтроки = ПараметрыОбработки.ПараметрыРазбиенияСтроки;
	ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
	
	// Для Упаковочных листов принято решение не менять статус в строке, если количество равно
	Если ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] > Количество 
		Или ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] = Количество Тогда
		
		НоваяСтрока = НоваяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] = Количество;
		
		ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] =
			ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] - Количество;
		
		НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;
		НоваяСтрока.Скидка 					= ТекущаяСтрока.Скидка;
		
		ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.КомментарийРТУ, НоваяСтрока.СкидкаДляРТУ, НоваяСтрока.ДатаДляРТУ,
			НоваяСтрока.Скидка, СтруктураПереданныхДанных, НоваяСтрока.ПрайсЛистДляРТУ);
		
		СкидкаДляРТУДляЗаписьВОрдер 		= НоваяСтрока.СкидкаДляРТУ;     
		ПрайсЛистДляРТУДляЗаписьВОрдер 		= НоваяСтрока.ПрайсЛистДляРТУ;
		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	Иначе
		ПроверкаОтказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуРазбиением(ПараметрыОбработки, НоваяТаблица, ТекущаяСтрока, Товары, СписокКодовСтроки,
	УпаковочныйЛист, СтруктураПереданныхДанных, СкидкаДляРТУДляЗаписьВОрдер, ПрайсЛистДляРТУДляЗаписьВОрдер)
	
	Количество = ПараметрыОбработки.Количество;
	
	ПараметрыРазбиенияСтроки 	= ПараметрыОбработки.ПараметрыРазбиенияСтроки;
	ДополнительныеПараметры 	= ПараметрыОбработки.ДополнительныеПараметры;
	
	Если ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] > Количество Тогда
		
		НоваяСтрока = НоваяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] = Количество;
		
		ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] =
			ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] - Количество;
		
		НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;
		НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
		
		ПолучитьМаксНомерСтроки(НоваяТаблица, Товары, НоваяСтрока);
		
		ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
			НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
			
		// Возможно условие устарело, так процедура есть отдельная процедура для упаковочных листов
		Если Объект.ТоварыВКоробках Тогда
			НоваяСтрокаСписокКодовСтроки = СписокКодовСтроки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСписокКодовСтроки, НоваяСтрока);
			НоваяСтрокаСписокКодовСтроки.УпаковочныйЛист = УпаковочныйЛист;
		КонецЕсли;
		
		// Если Неопределено то скидка в ордер идет из упаковочного листа иначе для номенклатуры запишем
		СкидкаДляРТУДляЗаписьВОрдер 		= НоваяСтрока.гф_СкидкаДляРТУ;
		ПрайсЛистДляРТУДляЗаписьВОрдер 		= НоваяСтрока.гф_ПрайсЛистДляРТУ;
		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	ИначеЕсли ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] = Количество Тогда
		
		ТекущаяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
		ТекущаяСтрока.ДатаОтгрузки 			= ТекущаяДата();
		
		ПолучитьКомментарийИСкидкиДляРТУ(ТекущаяСтрока.гф_КомментарийРТУ, ТекущаяСтрока.гф_СкидкаДляРТУ, ТекущаяСтрока.гф_ДатаДляРТУ,
			ТекущаяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ТекущаяСтрока.гф_ПрайсЛистДляРТУ);
		
		// Возможно условие устарело, так процедура есть отдельная процедура для упаковочных листов
		Если Объект.ТоварыВКоробках Тогда
			НоваяСтрокаСписокКодовСтроки = СписокКодовСтроки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСписокКодовСтроки, ТекущаяСтрока);
			НоваяСтрокаСписокКодовСтроки.УпаковочныйЛист = УпаковочныйЛист;
		КонецЕсли;
		
		СкидкаДляРТУДляЗаписьВОрдер 		= ТекущаяСтрока.гф_СкидкаДляРТУ;
		ПрайсЛистДляРТУДляЗаписьВОрдер 		= ТекущаяСтрока.гф_ПрайсЛистДляРТУ;

		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуРазбиениемУбратьКоличествоПересорт(ПараметрыОбработки, ТекущаяСтрока, ТаблицаИсточник, ПроверкаОтказ)
	
	Количество = ПараметрыОбработки.Количество;
	
	ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
	
	Если ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
		ПроверкаОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.КоличествоУпаковок > Количество Тогда
		
		НоваяСтрока = ТаблицаИсточник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока.КоличествоУпаковок 	= Количество;
		// Важно заполнять Количество, в типовой процедуре, откуда взят этот код,
		// отсутвует параметр для заполнения количества, только для КоличествоУпаковок
		НоваяСтрока.Количество 			= Количество;
		НоваяСтрока.Отменено 			= Истина;
		НоваяСтрока.ПричинаОтмены 		= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
		
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок - Количество;
		
		ПолучитьМаксНомерСтроки(ТаблицаИсточник, ТаблицаИсточник, НоваяСтрока);
		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	ИначеЕсли ТекущаяСтрока.КоличествоУпаковок = Количество Тогда
		
		ТекущаяСтрока.Отменено 			= Истина;
		ТекущаяСтрока.ПричинаОтмены 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	Иначе
		
		ПроверкаОтказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуРазбиениемУбратьКоличествоНеПолный(ПараметрыОбработки, ТекущаяСтрока, ТаблицаИсточник, ПроверкаОтказ)
	
	Количество = ПараметрыОбработки.Количество;
	
	ПараметрыРазбиенияСтроки = ПараметрыОбработки.ПараметрыРазбиенияСтроки;
	ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
	
	Если ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
		ПроверкаОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока.КоличествоУпаковок > Количество Тогда
		
		НоваяСтрока = ТаблицаИсточник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		НоваяСтрока.КоличествоУпаковок 	= Количество;
		// Важно заполнять Количество, в типовой процедуре, откуда взят этот код,
		// отсутвует параметр для заполнения количества, только для КоличествоУпаковок
		НоваяСтрока.Количество 			= Количество;	
		НоваяСтрока.Отменено 			= Истина;
		НоваяСтрока.ПричинаОтмены 		= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
		
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.КоличествоУпаковок - Количество;
		
		ПолучитьМаксНомерСтроки(ТаблицаИсточник, ТаблицаИсточник, НоваяСтрока);
		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	ИначеЕсли ТекущаяСтрока.КоличествоУпаковок = Количество Тогда
		
		ТекущаяСтрока.Отменено 			= Истина;
		ТекущаяСтрока.ПричинаОтмены 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
		
		РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
		
	Иначе
		
		ПроверкаОтказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуРазбиениемДобавитьКоличествоПересорт(ПараметрыОбработки, ТекущаяСтрока, ТаблицаИсточник)
	
	Количество = ПараметрыОбработки.Количество;
	
	ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
	
	НоваяСтрока = ТаблицаИсточник.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	
	НоваяСтрока.КоличествоУпаковок 		= Количество;
	// Важно заполнять Количество, в типовой процедуре, откуда взят этот код,
	// отсутвует параметр для заполнения количества, только для КоличествоУпаковок
	НоваяСтрока.Количество 				= Количество;
	НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
	НоваяСтрока.гф_ДобавленоПоПричине 	= Истина;
	НоваяСтрока.гф_ПричинаДобавления 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
	
	ПолучитьМаксНомерСтроки(ТаблицаИсточник, ТаблицаИсточник, НоваяСтрока);
	
	РазбитьСтрокуЗавершениеПересорт(НоваяСтрока, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьСтрокуРазбиениемДобавитьКоличествоНеПолный(ПараметрыОбработки, ТекущаяСтрока, ТаблицаИсточник)
	
	Количество = ПараметрыОбработки.Количество;
	
	ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
	
	НоваяСтрока = ТаблицаИсточник.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
	
	НоваяСтрока.КоличествоУпаковок 		= Количество;
	НоваяСтрока.Количество 				= Количество;
	НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
	НоваяСтрока.гф_ДобавленоПоПричине 	= Истина;
	НоваяСтрока.гф_ПричинаДобавления 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
    
	ПолучитьМаксНомерСтроки(ТаблицаИсточник, ТаблицаИсточник, НоваяСтрока);
	
	РазбитьСтрокуЗавершениеНеПолный(НоваяСтрока, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьСтрокуРазбиениемНеПолный(ПараметрыОбработки, НоваяТаблица, ТекущаяСтрока, ТаблицаИсточник, ПроверкаОтказ,
	СписокКодовСтроки, УпаковочныйЛист, СтруктураПереданныхДанных)
	
	Количество = ПараметрыОбработки.Количество;
	
	Если Не ТипЗнч(ТекущаяСтрока) = Тип("Массив") Тогда
		
		ПараметрыРазбиенияСтроки = ПараметрыОбработки.ПараметрыРазбиенияСтроки;
		ДополнительныеПараметры = ПараметрыОбработки.ДополнительныеПараметры;
		
		Если ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			ПроверкаОтказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] > Количество Тогда
			
			НоваяСтрока  = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НоваяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] = Количество;
			
			ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] =
				ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] - Количество;
			// Важно заполнять Количество, в типовой процедуре, откуда взят этот код,
			// отсутвует параметр для заполнения количества, только для КоличествоУпаковок
			
			НоваяСтрока.ВариантОбеспечения 		= Перечисления.ВариантыОбеспечения.Отгрузить;
			НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
			
			ПолучитьМаксНомерСтроки(НоваяТаблица, ТаблицаИсточник, НоваяСтрока);
			
			ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
				НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
			
			ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтроки, НоваяСтрока, УпаковочныйЛист);
			
			РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ТекущаяСтрока, Ложь);
			
		ИначеЕсли ТекущаяСтрока[ПараметрыРазбиенияСтроки.ИмяПоляКоличество] = Количество Тогда
			
			ТекущаяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
			ТекущаяСтрока.ДатаОтгрузки 			= ТекущаяДата();
			
			ПолучитьКомментарийИСкидкиДляРТУ(ТекущаяСтрока.гф_КомментарийРТУ, ТекущаяСтрока.гф_СкидкаДляРТУ, ТекущаяСтрока.гф_ДатаДляРТУ,
				ТекущаяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ТекущаяСтрока.гф_ПрайсЛистДляРТУ);
			
			ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтроки, ТекущаяСтрока, УпаковочныйЛист);
						
		Иначе
			
			ПроверкаОтказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		КоличествоОбщееНоменклатуры = 0;
		
		Для Каждого ЭлементМассива Из ТекущаяСтрока Цикл
			КоличествоОбщееНоменклатуры = КоличествоОбщееНоменклатуры + ЭлементМассива.КоличествоУпаковок;
		КонецЦикла;
		
		Если КоличествоОбщееНоменклатуры > Количество Тогда
			
			// Частный случай, что номенклатыры добавили больше чем отгружаем при неполном коробе
			ПроверкаОтказ = Истина;
			ТекстСообщения = НСтр("ru = 'Частный случай добавления номенклатуры в количестве превышающим требуемое, необходимо обратиться к администратору!""!'");

			Возврат;
			
		ИначеЕсли КоличествоОбщееНоменклатуры = Количество Тогда
		
			Для Каждого ЭлементМассива Из ТекущаяСтрока Цикл
				
				ЭлементМассива.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				ЭлементМассива.ДатаОтгрузки = ТекущаяДата();
				
				ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ, ЭлементМассива.гф_ДатаДляРТУ,
					ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
				
				ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтроки, ЭлементМассива, УпаковочныйЛист);
				
				РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ЭлементМассива, Ложь);
				
			КонецЦикла;
			
		Иначе
			
			ПроверкаОтказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция-конструктор дополнительных параметров разбиения строки.
//
// Возвращаемое значение:
//  Структура:
//     * ИмяПоляКоличество - Строка - имя поля, по которому будет происходить разбиение
//     * Заголовок - Строка - заголовок формы ввода числа
//     * РазрешитьНулевоеКоличество - Булево - признак, что в исходной и конечной строке может быть 0
//     * Количество - Неопределено, Число - количество, которое будет отображено в форме редактирования числа;
//          если Неопределенно - будет показано количество, взятое из исходной строки.
//
Функция ПараметрыРазбиенияСтроки() Экспорт
	
	ПараметрыРазбиенияСтроки = Новый Структура;
	ПараметрыРазбиенияСтроки.Вставить("ИмяПоляКоличество", "КоличествоУпаковок");
	ПараметрыРазбиенияСтроки.Вставить("Заголовок", НСтр("ru = 'Введите количество товара в новой строке';
														|en = 'Enter quantity of goods in a new line'"));
	ПараметрыРазбиенияСтроки.Вставить("РазрешитьНулевоеКоличество", Истина);
	ПараметрыРазбиенияСтроки.Вставить("Количество", Неопределено);
	
	Возврат ПараметрыРазбиенияСтроки;
	
КонецФункции

// Функция-конструктор дополнительных параметров разбиения строки.
//
// Возвращаемое значение:
//  Структура:
//     * ИмяПоляКоличество - Строка - имя поля, по которому будет происходить разбиение
//     * Заголовок - Строка - заголовок формы ввода числа
//     * РазрешитьНулевоеКоличество - Булево - признак, что в исходной и конечной строке может быть 0
//     * Количество - Неопределено, Число - количество, которое будет отображено в форме редактирования числа;
//          если Неопределенно - будет показано количество, взятое из исходной строки.
//
Функция ПараметрыРазбиенияСтрокиПересорт() Экспорт
	
	ПараметрыРазбиенияСтроки = Новый Структура;
	ПараметрыРазбиенияСтроки.Вставить("ИмяПоляКоличество", "КоличествоУпаковок");
	ПараметрыРазбиенияСтроки.Вставить("Заголовок", НСтр("ru = 'Введите количество товара в новой строке';
														|en = 'Enter quantity of goods in a new line'"));
	ПараметрыРазбиенияСтроки.Вставить("РазрешитьНулевоеКоличество", Истина);
	ПараметрыРазбиенияСтроки.Вставить("Количество", Неопределено);
	
	Возврат ПараметрыРазбиенияСтроки;
	
КонецФункции

Функция ЗависимыеРеквизитыСтрокой()
	
	Возврат "СуммаБезВозвратнойТары, СуммаНДСБезВозвратнойТары, СуммаСНДСБезВозвратнойТары,
		|СуммаРучнойСкидкиБезВозвратнойТары, СуммаАвтоматическойСкидкиБезВозвратнойТары,
		|СуммаОтмененоБезВозвратнойТары, СуммаНДСОтмененоБезВозвратнойТары, СуммаСНДСОтмененоБезВозвратнойТары,
		|СуммаРучнойСкидкиОтмененоБезВозвратнойТары, СуммаАвтоматическойСкидкиОтмененоБезВозвратнойТары,
		|СуммаОтменено, СуммаНДСОтменено, СуммаСНДСОтменено,
		|СуммаРучнойСкидкиОтменено, СуммаАвтоматическойСкидкиОтменено";
	
КонецФункции

Процедура ЗаполнитьРезервыНаСервере(Заказ, УпаковочныйЛист, УпаковочныеЛистыСТаблицейТовары, МассивНоменклатурыПоЗаказу,
	ЗаказУпаковочныеЛисты, МассивНаличиеЗаказаСПустымКодомСтроки)
	
	ОтборУЛ = Новый Структура();
	ОтборУЛ.Вставить("ЗаказКлиентаСсылка", Заказ);
	
	НайдСтрУпаковочныеЛисты = ЗаказУпаковочныеЛисты.НайтиСтроки(ОтборУЛ);
	
	// ++ Галфинд Волков 2024/01/18
	//Если Не МассивНаличиеЗаказаСПустымКодомСтроки.Количество() > 0 Тогда
		// -- Галфинд Волков 2024/01/18
		
		Проверка = Истина;
		
		НаличиеПроверкаЗаказ = Новый Массив;
		Для Инд = 0 По МассивНоменклатурыПоЗаказу.ВГраница() Цикл
			НаличиеПроверкаЗаказ.Добавить(МассивНоменклатурыПоЗаказу[Инд]);
		КонецЦикла;
		
		ПроверкаУЛ = Ложь;
		
		// Предварительное сравнение упаковочного листа, который предполагается что он в наличии в заказе
		Для Каждого СтрокаДляПроверки Из НайдСтрУпаковочныеЛисты Цикл
			
			// Дополнительное условие по статусу заказа, 
			Если СтрокаДляПроверки.УпаковочныйЛистСсылка = УпаковочныйЛист
				И Не Заказ.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован") Тогда
				
				ПроверкаУЛ = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПроверкаУЛ Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Ссылка", УпаковочныйЛист);
			
			ТаблицаДляПроверки = УпаковочныеЛистыСТаблицейТовары.НайтиСтроки(Отбор);
			
			// Предварительное сравнение с номенклатурой, которая в наличии в заказе, с номенклатурой из упаковочного листа
			Для Каждого СтрокаДляПроверки Из ТаблицаДляПроверки Цикл
				Для Каждого СтрокаНаличие Из НаличиеПроверкаЗаказ Цикл
					
					Если СтрокаДляПроверки.Номенклатура = СтрокаНаличие.Номенклатура
						И СтрокаДляПроверки.Характеристика = СтрокаНаличие.Характеристика Тогда
						
						СтрокаДляПроверки.Проверка = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
			Для Каждого СтрокаДляПроверки Из ТаблицаДляПроверки Цикл
				Если Не СтрокаДляПроверки.Проверка Тогда
					НайденнаяСтрока = "НеПройденаПроверка";
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// Если предварительная проверка пройдена, то из общего доступного наличия вычитается состав номенклатуры с характеристикой 
			// и количеством из одного текущкго упаковочного листа. Данная операция необходима для понимания доступного количества 
			// при обработке нового упаковочного листа в следующей итерации цикла.
			Если НайденнаяСтрока = Неопределено Тогда
				
				// Сравнение количества номенклатуры из упаковочного листа с количеством номенклатуры в наличии.
				// При нехватке количества, не будет изменена таблица "Объект.Наличие"
				Для Каждого СтрокаУпковочногоЛиста Из ТаблицаДляПроверки Цикл
					
					Для Каждого СтрокаНаличие Из НаличиеПроверкаЗаказ Цикл
						
						Если СтрокаУпковочногоЛиста.Номенклатура = СтрокаНаличие.Номенклатура
							И СтрокаУпковочногоЛиста.Характеристика = СтрокаНаличие.Характеристика Тогда
							
							Если СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок < 0 Тогда
								Проверка = Ложь;
								Прервать;
							Иначе
								СтрокаНаличие.Доступно = СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок;
								Проверка = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если Не Проверка Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				// При прохождении всех проверок, уменьшим доступное количество номенклатуры по текущему упаковочному листу.
				// Новый упаковочный лист, при следующей итерации цикла, будет проходить проверку
				// по количеству уже за вычетом количества из предыдущего упакоыочного листа. 
				Если Проверка Тогда
					
					ОбъектНаличиеЗаказ = Объект.Наличие.НайтиСтроки(Новый Структура("ЗаказНаОтгрузку", Заказ));
					
					Для Каждого СтрокаУпковочногоЛиста Из ТаблицаДляПроверки Цикл
						
						Для Каждого СтрокаНаличие Из ОбъектНаличиеЗаказ Цикл
							
							Если Заказ = СтрокаНаличие.ЗаказНаОтгрузку
								И СтрокаУпковочногоЛиста.Номенклатура = СтрокаНаличие.Номенклатура
								И СтрокаУпковочногоЛиста.Характеристика = СтрокаНаличие.Характеристика Тогда
								
								Если Не СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок < 0 Тогда 
									СтрокаНаличие.Доступно = СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок;
									// При успешном списании упаковочный лист помечается как доступный и не будет удален из списка вывода в отчет.
									Строка = Объект.ДоступностьУпаковочныхЛистов.Добавить();
									Строка.УпаковочныйЛист = УпаковочныйЛист;
									Строка.Проверка = Истина;
								Иначе
									// Упаковочный лист помечается как не доступный и дальше будет удален из списка вывода в отчет.
									Строка = Объект.ДоступностьУпаковочныхЛистов.Добавить();
									Строка.УпаковочныйЛист = УпаковочныйЛист;
									Строка.Проверка = Ложь;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				// Упаковочный лист не прошедший предварительную проверку на ниличиее его комплектации номенклатуры
				// в составе заказа помечается как не доступный и дальше будет удален из вывода в отчет.
				Строка = Объект.ДоступностьУпаковочныхЛистов.Добавить();
				Строка.УпаковочныйЛист = УпаковочныйЛист;
				Строка.Проверка = Ложь;
				
			КонецЕсли;
			
		Иначе	
			// Упаковочный лист отсутсвующий в заказе помечается как не доступный и дальше будет удален из вывода в отчет.
			Строка = Объект.ДоступностьУпаковочныхЛистов.Добавить();
			Строка.УпаковочныйЛист = УпаковочныйЛист;
			Строка.Проверка = Ложь;
			
		КонецЕсли;
			
	// ++ Галфинд Волков 2024/01/18
	//Иначе	
	//	
	//	Для Каждого СтрокаДляПроверки Из НайдСтрУпаковочныеЛисты Цикл
	//		// Удаляем все упаковочные листы по заказу у которого в табличной части Товары есть строки с пустым полем КодСтроки.
	//		Строка = Объект.ДоступностьУпаковочныхЛистов.Добавить();
	//		Строка.УпаковочныйЛист = УпаковочныйЛист;
	//		Строка.Проверка = Ложь;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	// -- Галфинд Волков 2024/01/18
	
КонецПроцедуры

Процедура ЗаполнитьРезервыНаСервере2(Заказ, УпаковочныйЛист, УпаковочныеЛистыСТаблицейТовары, МассивНоменклатурыПоЗаказу,
	ЗаказУпаковочныеЛисты, ДоступностьУпаковочныхЛистов)
	
	ОтборУЛ = Новый Структура();
	ОтборУЛ.Вставить("ЗаказКлиентаСсылка", Заказ);
	
	НайдСтрУпаковочныеЛисты = ЗаказУпаковочныеЛисты.НайтиСтроки(ОтборУЛ);
		
		Проверка = Истина;
		
		НаличиеПроверкаЗаказ = Новый Массив;
		Для Инд = 0 По МассивНоменклатурыПоЗаказу.ВГраница() Цикл
			НаличиеПроверкаЗаказ.Добавить(МассивНоменклатурыПоЗаказу[Инд]);
		КонецЦикла;
		
		ПроверкаУЛ = Ложь;
		
		// Предварительное сравнение упаковочного листа, который предполагается что он в наличии в заказе
		Для Каждого СтрокаДляПроверки Из НайдСтрУпаковочныеЛисты Цикл
			
			// Дополнительное условие по статусу заказа, 
			Если СтрокаДляПроверки.УпаковочныйЛистСсылка = УпаковочныйЛист
				И Не Заказ.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован") Тогда
				
				ПроверкаУЛ = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПроверкаУЛ Тогда
			
			Отбор = Новый Структура();
			Отбор.Вставить("Ссылка", УпаковочныйЛист);
			
			ТаблицаДляПроверки = УпаковочныеЛистыСТаблицейТовары.НайтиСтроки(Отбор);
			
			// Предварительное сравнение с номенклатурой, которая в наличии в заказе, с номенклатурой из упаковочного листа.
			// Проверка для теоретического понимания, что в заказе есть номенклатура сопоставимая с номенклатурой упаковочного листа.
			// Если одной позиции номенклатуры из упаковочного листа нет в заказе, то дальше тестировать 
			// имитацию фактической отгрузки упаковочного листане имеет смысла. Убираем Упаковочный лист из общего списка
			Для Каждого СтрокаДляПроверки Из ТаблицаДляПроверки Цикл
				Для Каждого СтрокаНаличие Из НаличиеПроверкаЗаказ Цикл
					
					Если СтрокаДляПроверки.Номенклатура = СтрокаНаличие.Номенклатура
						И СтрокаДляПроверки.Характеристика = СтрокаНаличие.Характеристика Тогда
						
						СтрокаДляПроверки.Проверка = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
			Для Каждого СтрокаДляПроверки Из ТаблицаДляПроверки Цикл
				Если Не СтрокаДляПроверки.Проверка Тогда
					НайденнаяСтрока = "НеПройденаПроверка";
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			// Если предварительная проверка пройдена, то из общего доступного наличия вычитается состав номенклатуры с характеристикой 
			// и количеством из одного текущкго упаковочного листа. Данная операция необходима для понимания доступного количества 
			// при обработке нового упаковочного листа в следующей итерации цикла.
			Если НайденнаяСтрока = Неопределено Тогда
				
				// Сравнение количества номенклатуры из упаковочного листа с количеством номенклатуры в наличии.
				// При нехватке количества, не будет изменена таблица "Объект.Наличие"
				Для Каждого СтрокаУпковочногоЛиста Из ТаблицаДляПроверки Цикл
					
					Для Каждого СтрокаНаличие Из НаличиеПроверкаЗаказ Цикл
						
						Если СтрокаУпковочногоЛиста.Номенклатура = СтрокаНаличие.Номенклатура
							И СтрокаУпковочногоЛиста.Характеристика = СтрокаНаличие.Характеристика Тогда
							
							Если СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок < 0 Тогда
								Проверка = Ложь;
								Прервать;
							Иначе
								СтрокаНаличие.Доступно = СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок;
								Проверка = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если Не Проверка Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				// При прохождении всех проверок, уменьшим доступное количество номенклатуры по текущему упаковочному листу.
				// Новый упаковочный лист, при следующей итерации цикла, будет проходить проверку
				// по количеству уже за вычетом количества из предыдущего упакоыочного листа. 
				Если Проверка Тогда
					
					ОбъектНаличиеЗаказ = Объект.Наличие.НайтиСтроки(Новый Структура("ЗаказНаОтгрузку", Заказ));
					
					Для Каждого СтрокаУпковочногоЛиста Из ТаблицаДляПроверки Цикл
						
						Для Каждого СтрокаНаличие Из ОбъектНаличиеЗаказ Цикл
							
							Если Заказ = СтрокаНаличие.ЗаказНаОтгрузку
								И СтрокаУпковочногоЛиста.Номенклатура = СтрокаНаличие.Номенклатура
								И СтрокаУпковочногоЛиста.Характеристика = СтрокаНаличие.Характеристика Тогда
								
								Если Не СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок < 0 Тогда 
									СтрокаНаличие.Доступно = СтрокаНаличие.Доступно - СтрокаУпковочногоЛиста.КоличествоУпаковок;
									// При успешном списании упаковочный лист помечается как доступный и не будет удален из списка вывода в отчет.
									
									Строка = ДоступностьУпаковочныхЛистов.Добавить();
									Строка.УпаковочныйЛист = УпаковочныйЛист;
									Строка.Проверка = Истина;
								Иначе
									// Упаковочный лист помечается как не доступный и дальше будет удален из списка вывода в отчет.
									
									Строка = ДоступностьУпаковочныхЛистов.Добавить();
									Строка.УпаковочныйЛист = УпаковочныйЛист;
									Строка.Проверка = Ложь;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				// Упаковочный лист не прошедший предварительную проверку на наличие его комплектации номенклатуры
				// в составе заказа помечается как не доступный и дальше будет удален из вывода в отчет.
				
				Строка = ДоступностьУпаковочныхЛистов.Добавить();
				Строка.УпаковочныйЛист = УпаковочныйЛист;
				Строка.Проверка = Ложь;
				
			КонецЕсли;
			
		Иначе	
			// Упаковочный лист отсутствующий в заказе помечается как не доступный и дальше будет удален из вывода в отчет.
			
			Строка = ДоступностьУпаковочныхЛистов.Добавить();
			Строка.УпаковочныйЛист = УпаковочныйЛист;
			Строка.Проверка = Ложь;
			
		КонецЕсли;
			
КонецПроцедуры

&НаСервере
Функция ОформитьРасходныеОрдераНаСервере(ОбъектыДляОрдера, Отказ, ОбъектЗаказ)
	
	// За основу взята типовая процедура "ОформитьРасходныеОрдераНаСервере" из общего модуля УправлениеОтгрузкой
	ПараметрыПереоформленияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДокументТовары.Ссылка КАК ДокументОтгрузки,
	|	ДокументТовары.Склад Склад
	|ПОМЕСТИТЬ ДокументыОтгрузки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивРаспоряжений)
	|	И ДокументТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(Документ.ЗаданиеНаПеревозку.ПустаяСсылка) КАК ЗаданиеНаПеревозку,
	|	ТоварыКОтгрузке.Склад КАК Склад,
	|	ТоварыКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ТоварыКОтгрузке.Получатель КАК Получатель,
	|	ЕСТЬNULL(РеквизитыРаспоряжения.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОтгрузки КАК ДокументыОтгрузки
	|		ПО ТоварыКОтгрузке.ДокументОтгрузки = ДокументыОтгрузки.ДокументОтгрузки
	|			И ТоварыКОтгрузке.Склад = ДокументыОтгрузки.Склад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеквизитыРаспоряжения
	|			ПО ТоварыКОтгрузке.ДокументОтгрузки = РеквизитыРаспоряжения.Ссылка
	|				И НЕ РеквизитыРаспоряжения.ДополнительнаяЗапись";
	
	Запрос.УстановитьПараметр("МассивРаспоряжений", МассивРаспоряжений.ВыгрузитьЗначения());
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СоздатьОрдера = Ложь;
	
	// Передаем заказ для использования таблицы "Товары" и ссылки на заказ для получения содержимого упаковочного листа
	// по номенлатуре в заказе со статусом "Отгружено" и с отбором по коду строки
	// Так как Упаковочный лист еще не записан с кодами строки из заказ, то сопоставление данных с заказом не возможно
	ПараметрыПереоформленияРасходныхОрдеров.Вставить("гф_Заказ");
	ПараметрыПереоформленияРасходныхОрдеров.гф_Заказ = ОбъектЗаказ;
	
	Пока Выборка.СледующийПоЗначениюПоля("Склад") Цикл
		
		СоздатьОрдера = Истина;
		
		ПараметрыПереоформленияРасходныхОрдеров.Склад = Выборка.Склад;
		
		Пока Выборка.СледующийПоЗначениюПоля("Получатель") Цикл
			
			ПараметрыПереоформленияРасходныхОрдеров.Получатель = Выборка.Получатель;
			
			Распоряжения = Новый Массив;
			Пока Выборка.Следующий() Цикл
				Распоряжения.Добавить(Выборка.ДокументОтгрузки);
			КонецЦикла;
			
			ПараметрыПереоформленияРасходныхОрдеров.РаспоряженияНаОтгрузку = Распоряжения;
			
			ПараметрыПереоформленияРасходныхОрдеров.Вставить("гф_СоздатьОрдера");
			ПараметрыПереоформленияРасходныхОрдеров.гф_СоздатьОрдера = Ложь;
			
			ПараметрыПереоформленияРасходныхОрдеров.Вставить("гф_ОтгрузкаПеремещением");
			ПараметрыПереоформленияРасходныхОрдеров.гф_ОтгрузкаПеремещением = МассивРаспоряжений[0].Значение.гф_ОтгрузкаПеремещением;
			
			Если Объект.ТоварыВКоробках Тогда
				ПараметрыПереоформленияРасходныхОрдеров.Вставить("гф_УпаковочныйЛист");
				ПараметрыПереоформленияРасходныхОрдеров.гф_УпаковочныйЛист = ОбъектыДляОрдера;
			Иначе
				ПараметрыПереоформленияРасходныхОрдеров.Вставить("гф_Товары");
				ПараметрыПереоформленияРасходныхОрдеров.гф_Товары = ОбъектыДляОрдера;
			КонецЕсли;
			
			ПараметрыПереоформленияРасходныхОрдеров.Вставить("гф_ЕстьОшибкаОстаткаНоменклатуры");
			ПараметрыПереоформленияРасходныхОрдеров.гф_ЕстьОшибкаОстаткаНоменклатуры = Ложь;
			
			СтруктураЗадания = СкладыСервер.ПереоформитьРасходныеОрдера(ПараметрыПереоформленияРасходныхОрдеров);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не СоздатьОрдера Тогда
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'По выбранным распоряжениям не требуется отгрузка товаров.';
								|en = 'Goods shipment is not required for the selected references.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	ИначеЕсли ПараметрыПереоформленияРасходныхОрдеров.Свойство("гф_СоздатьОрдера") И Не ПараметрыПереоформленияРасходныхОрдеров.гф_СоздатьОрдера Тогда
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'По выбранным распоряжениям отгрузка товаров превышает доступный остаток.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		Если ПараметрыПереоформленияРасходныхОрдеров.Свойство("гф_ЕстьОшибкаОстаткаНоменклатуры")
			И ПараметрыПереоформленияРасходныхОрдеров.гф_ЕстьОшибкаОстаткаНоменклатуры Тогда
			Отказ = Истина;
			
			ТекстСообщения = НСтр("ru = 'Отгрузка части товаров превышает доступный остаток по одному из распоряжений.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураЗадания;
	
КонецФункции

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	УстановитьСнятьФлажкиКлиент(Ложь);
	
	РазвернутьДеревоДокументов();
	
	РассчитатьОбщуюСтоимостьОтмеченныхКОтгрузкеТоваровКлиент(); // СадомцевСА 12.02.2024
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	УстановитьСнятьФлажкиКлиент(Истина);
	
	РазвернутьДеревоДокументов();
	
	РассчитатьОбщуюСтоимостьОтмеченныхКОтгрузкеТоваровКлиент(); // СадомцевСА 12.02.2024
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажкиКлиент(Отгрузить)
	
	Для Каждого Строка Из ДеревоДокументов.ПолучитьЭлементы() Цикл
		
		Если Отгрузить И Не Строка.БлокировкиОтгрузок Тогда
			Строка.Отгрузить = Отгрузить;
			УстановитьФлажкиДалееКлиент(Строка, Строка.Отгрузить);
		ИначеЕсли Не Отгрузить Тогда
			Строка.Отгрузить = Отгрузить;
			УстановитьФлажкиДалееКлиент(Строка, Строка.Отгрузить);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиДалееКлиент(Элемент, Отгрузить)
	
	Для Каждого Строка Из Элемент.ПолучитьЭлементы() Цикл
		
		Строка.Отгрузить = Отгрузить;
		
		Если Не Элемент.ПолучитьЭлементы().Количество() = 0 Тогда
			УстановитьФлажкиДалееКлиент(Строка, Отгрузить);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиКодовМаркировки(Команда)
	
	Если ЗначениеЗаполнено(Объект.Склад) И Объект.ТоварыВКоробках Тогда
		
		ПоЗаказам = 1;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦены) И РасчетЦен <> ПоЗаказам Тогда
			ТекстСообщения = НСтр("ru = 'Не указан вид цены!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Строка = Неопределено;
		Оповещение = Новый ОписаниеОповещения("ПослеЗаполненияСпискаУпаковочныхЛистов", ЭтотОбъект, Строка);
		
		ПараметрыОткрытия = Новый Структура();
		
		ПараметрыОткрытия.Вставить("Заголовок", "Загрузка кодов маркировки");
		ПараметрыОткрытия.Вставить("ИспользоватьКодУпаковки", Ложь);
		
		ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаЗагрузкиКодовМаркировкиУпаковочныхЛистов",
			ПараметрыОткрытия, , , , ,Оповещение);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Заполнение возможно только если у склада установлен флаг ""Товары в коробах""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияСпискаУпаковочныхЛистов(СтруктураПереданныхДанных, Строка) Экспорт
	
	Если НЕ СтруктураПереданныхДанных = Неопределено Тогда
		
		УстановитьОтметкиКодовМаркировкиДляДереваДокументов(СтруктураПереданныхДанных);
		
		РазвернутьДеревоДокументов();
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтметкиКодовМаркировкиДляДереваДокументов(СтруктураПереданныхДанных)
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("УпаковочныйЛист");
	ТЗ.Колонки.Добавить("НайденУЛ");
	
	Для Каждого ЭлементМассива Из СтруктураПереданныхДанных Цикл
		
		Стр = ТЗ.Добавить();
		Стр.УпаковочныйЛист = ЭлементМассива.Штрихкод;
		Стр.НайденУЛ = Ложь;
		
	КонецЦикла;
	
	ТЗ.Свернуть("УпаковочныйЛист, НайденУЛ");
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		Для Каждого Строка_Н Из Строка.Строки Цикл
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
			Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
				
				Для Каждого ЭлементМассива Из СтруктураПереданныхДанных Цикл
					
					Если ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)
						И Не Строка.БлокировкиОтгрузок
						И Строка_Т.УпаковочныйЛистСсылка.гф_Агрегация = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", ЭлементМассива.Штрихкод) Тогда
						
						Строка_Т.Отгрузить = Истина;
						НайденнаяСтрока = ТЗ.Найти(ЭлементМассива.Штрихкод);
						НайденнаяСтрока.НайденУЛ = Истина;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоДокументов");
	
	Для Каждого Строка Из ТЗ Цикл
		
		Если Не Строка.НайденУЛ Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Упаковочный лист ""%1"" не найден!'"), Строка.УпаковочныйЛист);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗафиксироватьАктивнуюТранзакцию()
	
	ЗафиксироватьТранзакцию();
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьАктивнуюТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьАктивнуюТранзакцию()
	
	ОтменитьТранзакцию();
	
	Если ТранзакцияАктивна() Тогда
		ОтменитьАктивнуюТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СнятьРезервНаСервере(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Склад) И Объект.ТоварыВКоробках Тогда
		СнятьРезервОбработкаДанныхТоварыВКоробках();
	Иначе
		СнятьРезервОбработкаДанныхТовары();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СнятьРезервОбработкаДанныхТоварыВКоробках()
	
	ТЗ_Заказы = ПолучитьОтмеченныеДанныеДереваЗначений();
	
	Для Каждого СтрокаЗаказы Из ТЗ_Заказы Цикл
		
		НачатьТранзакцию();
		
		Попытка
		
		НовыйДокумент = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
		
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Организация = СтрокаЗаказы.Организация;
		НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
		НовыйДокумент.Назначение = СтрокаЗаказы.Назначение;
		НовыйДокумент.Комментарий = "Создано автоматически обработкой Отгрузка по заказам";
		НовыйДокумент.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		
		Для Каждого СтрокаУпаковочныйЛист Из СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура Цикл
			ОбъектУпаковочныйЛист = СтрокаУпаковочныйЛист.УпаковочныйЛист.ПолучитьОбъект();
			
			Для Каждого Строка Из ОбъектУпаковочныйЛист.Товары Цикл
				Стр = НовыйДокумент.Товары.Добавить();
				Стр.Номенклатура 		= Строка.Номенклатура;
				Стр.Характеристика 		= Строка.Характеристика;
				Стр.Количество 			= Строка.Количество;
				Стр.КоличествоУпаковок 	= Строка.КоличествоУпаковок;
				Стр.гф_IDкороба 		= ОбъектУпаковочныйЛист.Ссылка;
				Стр.Склад 				= СтрокаЗаказы.Склад;
				Стр.ИсходноеНазначение 	= СтрокаЗаказы.Назначение;
			КонецЦикла;
			
		КонецЦикла;
		
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КорректировкаНазначенияПроведен = Истина;
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьАктивнуюТранзакцию();
			КонецЕсли;
			
			КорректировкаНазначенияПроведен = Ложь;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'По заказу ""%1"" не удалось провести документ ""Корректировка назначения товаров""'"),
				СтрокаЗаказы.Заказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(ТекстСообщения,
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
			
		КонецПопытки;
		
		Если КорректировкаНазначенияПроведен Тогда
			
			Для Каждого СтрокаУпаковочныйЛист Из СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура Цикл
				
				ОбъектУпаковочныйЛист = СтрокаУпаковочныйЛист.УпаковочныйЛист.ПолучитьОбъект();
				
				Попытка
					ОбъектУпаковочныйЛист.Заблокировать();
				Исключение
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьАктивнуюТранзакцию();
					КонецЕсли;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = '%1 находится в процессе редактирования и не может быть изменен.
						|Документ ""Корректировка назначения товаров"" не сформирован'"), ОбъектУпаковочныйЛист);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					ВызватьИсключение;
					
				КонецПопытки;
				
				// Очищаем ссылку на заказ клиента
				ОбъектУпаковочныйЛист.гф_Заказ = Неопределено;
				
				// Очищаем колонку с назначением по каждой строке
				Для Каждого Строка Из ОбъектУпаковочныйЛист.Товары Цикл
					Строка.Назначение = Неопределено;
				КонецЦикла;
				
				Попытка
					ОбъектУпаковочныйЛист.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный); 
				Исключение
					
					Если ТранзакцияАктивна() Тогда
						 ОтменитьАктивнуюТранзакцию();
					КонецЕсли;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Упаковочный лист ""%1"" не удалось перепровести. '"),
						ОбъектУпаковочныйЛист);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документа ""Упаковочный лист""'"),
						УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					Продолжить;
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Попытка
			Если ТранзакцияАктивна() Тогда
				ЗафиксироватьАктивнуюТранзакцию();
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Сформирован документ ""%1"". Внесены изменения в ""%2""'"),
								НовыйДокумент, ОбъектУпаковочныйЛист);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьАктивнуюТранзакцию();
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка фиксации транзакции снятия резерва по заказу ""%1"", поробуйте выполнить
			| операцию позднее. Возможно отсутствует доступ на формирование и изменение документов участвующих в снятии резерва'"),
				СтрокаЗаказы.Заказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(ТекстСообщения,
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СнятьРезервОбработкаДанныхТовары()
	
	ТЗ_Заказы = ПолучитьОтмеченныеДанныеДереваЗначений();
	
	Для Каждого СтрокаЗаказы Из ТЗ_Заказы Цикл
		
		НачатьТранзакцию();
		
		Попытка
		
		НовыйДокумент = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
		
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Организация = СтрокаЗаказы.Организация;
		НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
		НовыйДокумент.Назначение = СтрокаЗаказы.Назначение;
		
		Для Каждого СтрокаУпаковочныйЛист Из СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура Цикл
			
			Если Объект.ТоварыВКоробках Тогда
				
				ОбъектУпаковочныйЛист = СтрокаУпаковочныйЛист.УпаковочныйЛист.ПолучитьОбъект();
				
				Для Каждого Строка Из ОбъектУпаковочныйЛист.Товары Цикл
					Стр = НовыйДокумент.Товары.Добавить();
					Стр.Номенклатура 		= Строка.Номенклатура;
					Стр.Характеристика 		= Строка.Характеристика;
					Стр.Количество 			= Строка.Количество;
					Стр.КоличествоУпаковок 	= Строка.КоличествоУпаковок;
					Стр.гф_IDкороба 		= ОбъектУпаковочныйЛист.Ссылка;
					Стр.Склад 				= СтрокаЗаказы.Склад;
					Стр.ИсходноеНазначение 	= СтрокаЗаказы.Назначение;
				КонецЦикла;
				
			Иначе
				
				Стр = НовыйДокумент.Товары.Добавить();
				Стр.Номенклатура 		= СтрокаУпаковочныйЛист.Номенклатура;
				Стр.Характеристика 		= СтрокаУпаковочныйЛист.Характеристика;
				Стр.Количество 			= СтрокаУпаковочныйЛист.Количество;
				Стр.КоличествоУпаковок 	= СтрокаУпаковочныйЛист.Количество;
				Стр.Склад 				= СтрокаЗаказы.Склад;
				Стр.ИсходноеНазначение 	= СтрокаЗаказы.Назначение;
				
			КонецЕсли;
			
		КонецЦикла;
		
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КорректировкаНазначенияПроведен = Истина;
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьАктивнуюТранзакцию();
			КонецЕсли;
			
			КорректировкаНазначенияПроведен = Ложь;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'По заказу ""%1"" не удалось провести документ ""Корректировка назначения товаров""'"),
				СтрокаЗаказы.Заказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(ТекстСообщения,
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
			
		КонецПопытки;
		
		Если КорректировкаНазначенияПроведен И Объект.ТоварыВКоробках Тогда
			
			Для Каждого СтрокаУпаковочныйЛист Из СтрокаЗаказы.УпаковочныеЛисты Цикл
				
				ОбъектУпаковочныйЛист = СтрокаУпаковочныйЛист.УпаковочныйЛист.ПолучитьОбъект();
				
				Попытка
					ОбъектУпаковочныйЛист.Заблокировать();
				 Исключение
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьАктивнуюТранзакцию();
					КонецЕсли;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = '%1 находится в процессе редактирования и не может быть изменен.
						|Документ ""Корректировка назначения товаров"" не сформирован'"), ОбъектУпаковочныйЛист);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					ВызватьИсключение;
					
				КонецПопытки;
				
				// Очищаем ссылку на заказ клиента
				ОбъектУпаковочныйЛист.гф_Заказ = Неопределено;
				
				// Очищаем колонку с назначением по каждой строке
				Для Каждого Строка Из ОбъектУпаковочныйЛист.Товары Цикл
					Строка.Назначение = Неопределено;
				КонецЦикла;
				
				Попытка
					ОбъектУпаковочныйЛист.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	 
				Исключение
					
					Если ТранзакцияАктивна() Тогда
						ОтменитьАктивнуюТранзакцию();
					КонецЕсли;
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Упаковочный лист ""%1"" не удалось перепровести. '"), ОбъектУпаковочныйЛист);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Проведение документа ""Упаковочный лист""'"),
						УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					Продолжить;
				КонецПопытки;
				
			КонецЦикла;
			 
		КонецЕсли;
		
		Попытка
			Если ТранзакцияАктивна() Тогда
				
				ЗафиксироватьАктивнуюТранзакцию();
				
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Сформирован документ ""%1"".'"), НовыйДокумент);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, НовыйДокумент);
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьАктивнуюТранзакцию();
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка фиксации транзакции снятия резерва по заказу ""%1"", поробуйте выполнить
			| операцию позднее. Возможно отсутствует доступ на формирование и изменение документов участвующих в снятии резерва'"),
				СтрокаЗаказы.Заказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(ТекстСообщения,
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтмеченныеДанныеДереваЗначений()
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	
	// Таблица для записи каждого заказа с конкретным списком упаковочных листов по этому заказу
	ТЗ_Заказы = Новый ТаблицаЗначений;
	ТЗ_Заказы.Колонки.Добавить("Заказ");
	ТЗ_Заказы.Колонки.Добавить("СписокУпаковочныйЛистИлиНоменклатура");
	ТЗ_Заказы.Колонки.Добавить("Склад");
	ТЗ_Заказы.Колонки.Добавить("Организация");
	ТЗ_Заказы.Колонки.Добавить("Назначение");
	
	Если Объект.ТоварыВКоробках Тогда
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Для Каждого Строка_ТТ Из Строка_Н.Строки Цикл
				Для Каждого Строка_Т Из Строка_ТТ.Строки Цикл
					
					Если Строка_Т.Отгрузить
						И (ЗначениеЗаполнено(Строка_Т.Номенклатура)
						Или ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)) Тогда
						
						НайтиЗаказ = ТЗ_Заказы.Найти(Строка_Т.Заказ, "Заказ");
						
						Если НайтиЗаказ = Неопределено Тогда
							
							ОбъектЗаказ = Строка_Т.Заказ.ПолучитьОбъект();
							
							СтрокаЗаказы = ТЗ_Заказы.Добавить();
							СтрокаЗаказы.Заказ = Строка_Т.Заказ;
							СтрокаЗаказы.Склад = Строка_Т.Склад;
							СтрокаЗаказы.Организация = Строка_Т.Организация;
							СтрокаЗаказы.Назначение = ОбъектЗаказ.Назначение;
							
							Если Объект.ТоварыВКоробках Тогда
								
								ТЗ_УпаковочныеЛисты = Новый ТаблицаЗначений;
								ТЗ_УпаковочныеЛисты.Колонки.Добавить("УпаковочныйЛист");
								СтрокаУпаковочныеЛисты = ТЗ_УпаковочныеЛисты.Добавить();
								
								СтрокаУпаковочныеЛисты.УпаковочныйЛист = Строка_Т.УпаковочныйЛистСсылка;
								
								СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура = ТЗ_УпаковочныеЛисты;
								
							Иначе
								
								ТЗ_Номенклатура = Новый ТаблицаЗначений;
								ТЗ_Номенклатура.Колонки.Добавить("Номенклатура");
								ТЗ_Номенклатура.Колонки.Добавить("Характеристика");
								ТЗ_Номенклатура.Колонки.Добавить("Количество");
								СтрокаНоменклатуры = ТЗ_Номенклатура.Добавить();
								
								СтрокаНоменклатуры.Номенклатура 		= Строка_Т.Номенклатура;
								СтрокаНоменклатуры.Характеристика 		= Строка_Т.Характеристика;
								// СадомцевСА 07.03.2024
								//СтрокаНоменклатуры.Количество 			= Строка_Т.КоличествоНоменклатуры;
								СтрокаНоменклатуры.Количество 			= Строка_Т.КоличествоОтгрузить;
								
								СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура = ТЗ_Номенклатура;
								
							КонецЕсли;
						Иначе
							
							Если Объект.ТоварыВКоробках Тогда
								НайтиСписокУпаковочныйЛистИлиНоменклатура =
								НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Найти(Строка_Т.УпаковочныйЛистСсылка, "УпаковочныйЛист");
							Иначе
								НайтиСписокУпаковочныйЛистИлиНоменклатура =
								НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Найти(Строка_Т.Номенклатура, "Номенклатура");	
							КонецЕсли;
							
							Если НайтиСписокУпаковочныйЛистИлиНоменклатура = Неопределено Тогда
								
								СтрокаСписокУпаковочныйЛистИлиНоменклатура = НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Добавить();
								
								Если Объект.ТоварыВКоробках Тогда
									СтрокаСписокУпаковочныйЛистИлиНоменклатура.УпаковочныйЛист 		= Строка_Т.УпаковочныйЛистСсылка;
								Иначе
									СтрокаСписокУпаковочныйЛистИлиНоменклатура.Номенклатура 		= Строка_Т.Номенклатура;
									СтрокаСписокУпаковочныйЛистИлиНоменклатура.Характеристика 		= Строка_Т.Характеристика;
									СтрокаСписокУпаковочныйЛистИлиНоменклатура.Количество 			= Строка_Т.КоличествоНоменклатуры;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
Иначе
	
	Для Каждого Строка Из ДеревоЗначений.Строки Цикл
		
		Для Каждого Строка_Н Из Строка.Строки Цикл
			
			Для Каждого Строка_Т Из Строка_Н.Строки Цикл
				
				Если Строка_Т.Отгрузить
					И (ЗначениеЗаполнено(Строка_Т.Номенклатура)
					Или ЗначениеЗаполнено(Строка_Т.УпаковочныйЛистСсылка)) Тогда
					
					НайтиЗаказ = ТЗ_Заказы.Найти(Строка_Т.Заказ, "Заказ");
					
					Если НайтиЗаказ = Неопределено Тогда
						
						ОбъектЗаказ = Строка_Т.Заказ.ПолучитьОбъект();
						
						СтрокаЗаказы = ТЗ_Заказы.Добавить();
						СтрокаЗаказы.Заказ = Строка_Т.Заказ;
						СтрокаЗаказы.Склад = Строка_Т.Склад;
						СтрокаЗаказы.Организация = Строка_Т.Организация;
						СтрокаЗаказы.Назначение = ОбъектЗаказ.Назначение;
						
						Если Объект.ТоварыВКоробках Тогда
							
							ТЗ_УпаковочныеЛисты = Новый ТаблицаЗначений;
							ТЗ_УпаковочныеЛисты.Колонки.Добавить("УпаковочныйЛист");
							СтрокаУпаковочныеЛисты = ТЗ_УпаковочныеЛисты.Добавить();
							
							СтрокаУпаковочныеЛисты.УпаковочныйЛист = Строка_Т.УпаковочныйЛистСсылка;
							
							СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура = ТЗ_УпаковочныеЛисты;
							
						Иначе
							
							ТЗ_Номенклатура = Новый ТаблицаЗначений;
							ТЗ_Номенклатура.Колонки.Добавить("Номенклатура");
							ТЗ_Номенклатура.Колонки.Добавить("Характеристика");
							ТЗ_Номенклатура.Колонки.Добавить("Количество");
							СтрокаНоменклатуры = ТЗ_Номенклатура.Добавить();
							
							СтрокаНоменклатуры.Номенклатура 		= Строка_Т.Номенклатура;
							СтрокаНоменклатуры.Характеристика 		= Строка_Т.Характеристика;
							// СадомцевСА 07.03.2024
							//СтрокаНоменклатуры.Количество 			= Строка_Т.КоличествоНоменклатуры;
							СтрокаНоменклатуры.Количество 			= Строка_Т.КоличествоОтгрузить;
							
							СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура = ТЗ_Номенклатура;
							
						КонецЕсли;
					Иначе
						
						Если Объект.ТоварыВКоробках Тогда
							НайтиСписокУпаковочныйЛистИлиНоменклатура =
								НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Найти(Строка_Т.УпаковочныйЛистСсылка, "УпаковочныйЛист");
						Иначе
							НайтиСписокУпаковочныйЛистИлиНоменклатура =
								НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Найти(Строка_Т.Номенклатура, "Номенклатура");	
						КонецЕсли;
						
						Если НайтиСписокУпаковочныйЛистИлиНоменклатура = Неопределено Тогда
							
							СтрокаСписокУпаковочныйЛистИлиНоменклатура = НайтиЗаказ.СписокУпаковочныйЛистИлиНоменклатура.Добавить();
							
							Если Объект.ТоварыВКоробках Тогда
								СтрокаСписокУпаковочныйЛистИлиНоменклатура.УпаковочныйЛист 		= Строка_Т.УпаковочныйЛистСсылка;
							Иначе
								СтрокаСписокУпаковочныйЛистИлиНоменклатура.Номенклатура 		= Строка_Т.Номенклатура;
								СтрокаСписокУпаковочныйЛистИлиНоменклатура.Характеристика 		= Строка_Т.Характеристика;
								СтрокаСписокУпаковочныйЛистИлиНоменклатура.Количество 			= Строка_Т.КоличествоНоменклатуры;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	КонецЕсли;
	
	Если ТЗ_Заказы.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Не отмечен ни один объект к снятию резерва.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат ТЗ_Заказы;
		
	КонецЕсли;
	
	Возврат ТЗ_Заказы;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеТоварыВКоробах()
	
	Объект.ТоварыВКоробках = ПолучитьЗначениеРеквизитаСкладаТоварыВКоробках();
	
	Если Не Объект.ТоварыВКоробках Тогда
		Элементы.ДеревоДокументовНоменклатура.Видимость 				= Истина;
		Элементы.ДеревоДокументовХарактеристика.Видимость 				= Истина;
		Элементы.ДеревоДокументовДокументПоступленияНомер.Видимость 	= Ложь;
		Элементы.ДеревоДокументовУпаковочныйЛистНомер.Видимость 		= Ложь;
		Элементы.ДеревоДокументовСостояниеКороба.Видимость 				= Ложь;
		Элементы.ДеревоДокументовКоличествоВНаличии.Видимость 			= Ложь;
		Элементы.ДеревоДокументовКоличествоДнейХранения.Видимость 		= Ложь;
		Элементы.ДеревоДокументовСтатусКМ.Видимость 					= Ложь;
		Элементы.ДеревоДокументовКоличествоЗаказано.Видимость 			= Истина;
		Элементы.ДеревоДокументовКоличествоОтгрузить.Видимость 			= Истина;
		Элементы.ДеревоДокументовКоличествоДоступно.Видимость 			= Истина;
		Элементы.ДеревоДокументовКоличествоНоменклатуры.Видимость 		= Ложь;
		Элементы.ДеревоДокументовЦена.Видимость 						= Истина;
		
		Элементы.ДеревоДокументовСкидкаИзЗаказа.Видимость 				= Истина;
		
		Элементы.КоличествоОтмеченныхКОтгрузкеТоваров.Видимость 		= Истина;
		Элементы.КоличествоКоробов.Видимость 							= Ложь;
		Элементы.КоличествоПарВКоробах.Видимость 						= Ложь;
	Иначе
		Элементы.ДеревоДокументовНоменклатура.Видимость 				= Ложь;
		Элементы.ДеревоДокументовХарактеристика.Видимость 				= Ложь;
		Элементы.ДеревоДокументовДокументПоступленияНомер.Видимость 	= Истина;
		Элементы.ДеревоДокументовУпаковочныйЛистНомер.Видимость 		= Истина;
		Элементы.ДеревоДокументовСостояниеКороба.Видимость 				= Истина;
		Элементы.ДеревоДокументовКоличествоВНаличии.Видимость 			= Истина;
		Элементы.ДеревоДокументовКоличествоДнейХранения.Видимость 		= Истина;
		Элементы.ДеревоДокументовСтатусКМ.Видимость 					= Истина;
		Элементы.ДеревоДокументовКоличествоЗаказано.Видимость 			= Ложь;
		Элементы.ДеревоДокументовКоличествоОтгрузить.Видимость 			= Ложь;
		Элементы.ДеревоДокументовКоличествоДоступно.Видимость 			= Ложь;
		Элементы.ДеревоДокументовКоличествоНоменклатуры.Видимость 		= Истина;
		Элементы.ДеревоДокументовЦена.Видимость 						= Ложь;
		
		Элементы.ДеревоДокументовСкидкаИзЗаказа.Видимость 				= Ложь;
		
		Элементы.КоличествоОтмеченныхКОтгрузкеТоваров.Видимость 		= Ложь;
		Элементы.КоличествоКоробов.Видимость 							= Истина;
		Элементы.КоличествоПарВКоробах.Видимость 						= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизитаСкладаТоварыВКоробках()
	
	ОчиститьДеревоЗначений();
	
	Склад = Объект.Склад;
	
	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "гф_СкладыТоварыВКоробах");
	ЗначениеДополнительногоРеквизита = Склад.ДополнительныеРеквизиты.Найти(ДополнительныйРеквизит, "Свойство");
	
	Если Не ЗначениеДополнительногоРеквизита = Неопределено Тогда
		Возврат ЗначениеДополнительногоРеквизита.Значение;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОчиститьДеревоЗначений()
	
	ДеревоДокументовЭлементы = ДеревоДокументов.ПолучитьЭлементы();
	ДеревоДокументовЭлементы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОстатковДляНеКоробногоСклада(Отказ)
	
	Дерево = ЗаполнитьДеревоЗначенийДляНеКоробногоСклада();
	
	Если Дерево = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РассчитатьЛимиты(Дерево);
	
	ПолучитьБлокировки(Дерево);
	
	ДеревоДокументовЭлементы = ДеревоДокументов.ПолучитьЭлементы();
	ДеревоДокументовЭлементы.Очистить();
	
	ЗаполнитьСвойстваСтроки(ДеревоДокументов, Дерево.Строки);
	
КонецПроцедуры

Функция ЗаполнитьДеревоЗначенийДляНеКоробногоСклада()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	Склад 		= ОтчетОбъект.Склад;
	Партнер 	= ОтчетОбъект.Клиент;
	
	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("СхемаКомпоновкиНоменклатуры");
	
	Объект.КомпоновщикНастроекНоменклатуры.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Объект.КомпоновщикНастроекНоменклатуры.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	КомпоновщикНастроек = Объект.КомпоновщикНастроекНоменклатуры;
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	ГруппировкаДетальныеПоля = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаДетальныеПоля.Использование = Истина;
	АвтоПоле = ГруппировкаДетальныеПоля.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоПоле.Использование = Истина;
	
	ПолеПараметрыДанных				= Новый ПолеКомпоновкиДанных("ПараметрыДанных");
	ПолеСистемныеПоля				= Новый ПолеКомпоновкиДанных("СистемныеПоля");
	
	Для Каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование	= Не (ПолеВыбора.Поле = ПолеПараметрыДанных ИЛИ ПолеВыбора.Поле = ПолеСистемныеПоля);
		ВыбранноеПоле.Поле			= ПолеВыбора.Поле;
	КонецЦикла;
	
	ПараметрОбособленныеТовары = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(
		"ПоказатьОбособленныеТовары");
	Если ПараметрОбособленныеТовары <> Неопределено Тогда
		ПараметрОбособленныеТовары.Значение = Истина;
	КонецЕсли; 
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Предоплата", СвойствоДоговораПредоплата);
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= Склад;
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Партнер");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= Партнер;
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;
	
	ТекстЗапросаВесУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки(
		"Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВесНоменклатуры", ТекстЗапросаВесУпаковки);
		
	ТекстЗапросаОбъемУпаковки = Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки(
		"Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОбъемНоменклатуры", ТекстЗапросаОбъемУпаковки);
	
	
	// ++ Галфинд Окунев 2023.11.22 {	
	КорректировкаТекстаЗапросаПредоплатные(ТекстЗапроса, ОтборПредоплатныхКлиентов);
	// -- Галфинд Окунев 2023.11.22 {	
	
	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, , , ТипГенератора);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ТаблицаКомпоновкаДанных = Новый ТаблицаЗначений;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьОбъект(ТаблицаКомпоновкаДанных);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
	МассивУдалитьСтроки = Новый Массив;
	Для Каждого Строка Из ТаблицаКомпоновкаДанных Цикл
		// ++ Галфинд Волков 2023/12/18
		// Если Строка["ТипЗаписи"] <> "Сейчас"
		//	Или Не ЗначениеЗаполнено(Строка.ЗаказНаОтгрузку)
		//	Или (ЗначениеЗаполнено(Партнер) И Не Строка.ЗаказНаОтгрузку.Партнер = Партнер) Тогда
		//	МассивУдалитьСтроки.Добавить(Строка);
		// КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.ЗаказНаОтгрузку)
			Или (ЗначениеЗаполнено(Партнер) И Не Строка.ЗаказПартнер = Партнер) Тогда
			МассивУдалитьСтроки.Добавить(Строка);
		КонецЕсли;
		// -- Галфинд Волков 2023/12/18
		
	КонецЦикла;
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		ТаблицаКомпоновкаДанных.Удалить(УдалитьСтроку);
	КонецЦикла;
	
	Если ТаблицаКомпоновкаДанных.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Данные для отгрузки, соответствующие условию отбора не найдены.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОстатки = ТаблицаКомпоновкаДанных.Скопировать();
	ТаблицаОстатки.Свернуть("ЗаказНаОтгрузку, Склад, Номенклатура, НоменклатураАртикул, Характеристика, ЗаказНаОтгрузку", "Доступно");
	
	ТЗЗаказНаОтгрузку = ТаблицаОстатки.Скопировать(, "ЗаказНаОтгрузку");
	ТЗЗаказНаОтгрузку.Свернуть("ЗаказНаОтгрузку");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказКлиента.Ссылка КАК Заказ,
		|	ЗаказКлиента.гф_АдресДоставки КАК АдресДоставки,
		|	ЗаказКлиента.Партнер КАК Клиент,
		|	ЗаказКлиента.Организация КАК Организация,
		|	ЗаказКлиента.Договор КАК Договор,
		|	ЗаказКлиента.Склад КАК Склад,
		|	ЗаказКлиента.гф_ОтгрузкаПеремещением КАК ОтгрузкаПеремещением,
		|	ЗаказКлиента.Товары КАК Товары
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_АдресаДоставки КАК гф_АдресаДоставки
		|		ПО ЗаказКлиента.гф_АдресДоставки = гф_АдресаДоставки.Ссылка
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ТЗЗаказНаОтгрузку.ВыгрузитьКолонку("ЗаказНаОтгрузку"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗВыборкаЗаказАдрес = РезультатЗапроса.Выгрузить();
	
	ТаблицаОстатки.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	ТаблицаОстатки.Колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("СправочникСсылка.гф_АдресаДоставки"));
	ТаблицаОстатки.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаОстатки.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаОстатки.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаОстатки.Колонки.Добавить("Стоимость",  Новый ОписаниеТипов("Число"));
	ТаблицаОстатки.Колонки.Добавить("КоличествоЗаказано", Новый ОписаниеТипов("Число"));
	ТаблицаОстатки.Колонки.Добавить("КоличествоОтгрузить", Новый ОписаниеТипов("Число"));
	ТаблицаОстатки.Колонки.Добавить("ОтгрузкаПеремещением", Новый ОписаниеТипов("Булево"));
	ТаблицаОстатки.Колонки.Добавить("СтавкаНДССсылка", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	// ++ Галфинд Волков 2023/12/26
	ТаблицаОстатки.Колонки.Добавить("СкидкаИзЗаказа", Новый ОписаниеТипов("Число"));
	// -- Галфинд Волков 2023/12/26
	ТаблицаОстатки.Колонки.Добавить("ТоварыВКоробках", Новый ОписаниеТипов("Булево"));
	ТаблицаОстатки.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Число"));
	
	// ++ Галфинд Волков 2023/12/18
	// СтруктураПоискаНоменклатурахарактеристика.Вставить("Отменено", Ложь);
	МассивУдалитьСтроки = Новый Массив;
	// -- Галфинд Волков 2023/12/18
	
	Для Каждого СтрокаОстатки Из ТаблицаОстатки Цикл
		
		СтрокаОстатки.ТоварыВКоробках = Объект.ТоварыВКоробках;
		
		ТЗВыборкаЗаказАдресСтрока = ТЗВыборкаЗаказАдрес.Найти(СтрокаОстатки.ЗаказНаОтгрузку, "Заказ");
		
		Если Не ТЗВыборкаЗаказАдресСтрока = Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(СтрокаОстатки, ТЗВыборкаЗаказАдресСтрока, , "Склад");
			
		КонецЕсли;
		// ++ Галфинд Волков 2023/12/18
		// СтруктураПоискаНоменклатурахарактеристика = Новый Структура;
		// СтруктураПоискаНоменклатурахарактеристика.Вставить("Номенклатура", СтрокаОстатки.Номенклатура);
		// СтруктураПоискаНоменклатурахарактеристика.Вставить("Характеристика", СтрокаОстатки.Характеристика);
		//
		// ТЗВыборкаНоменклатураСтрока = ТЗВыборкаЗаказАдресСтрока.Товары.НайтиСтроки(СтруктураПоискаНоменклатурахарактеристика);
		// Если ТЗВыборкаНоменклатураСтрока.Количество() > 0 Тогда
		
		//	СтрокаОстатки.Цена = ТЗВыборкаНоменклатураСтрока[0].Цена;
		//	СтрокаОстатки.КоличествоЗаказано = ТЗВыборкаНоменклатураСтрока[0].КоличествоУпаковок;
		//	
		//	Если СтрокаОстатки.Доступно > СтрокаОстатки.КоличествоЗаказано Тогда
		//		СтрокаОстатки.КоличествоОтгрузить = СтрокаОстатки.КоличествоЗаказано;
		//	Иначе
		//		СтрокаОстатки.КоличествоОтгрузить = СтрокаОстатки.Доступно;
		//	КонецЕсли;
		//	
		//	// Стоимость с НДС
		//	СтрокаОстатки.СтавкаНДС = ТЗВыборкаНоменклатураСтрока[0].СтавкаНДС;
		//	СтрокаОстатки.Стоимость = СтрокаОстатки.КоличествоОтгрузить * ТЗВыборкаНоменклатураСтрока[0].Цена * (1 + ТЗВыборкаНоменклатураСтрока[0].СтавкаНДС.Ставка/100);
		//	
		// КонецЕсли;
		
			ТаблицаТоварыЗаказа = ТЗВыборкаЗаказАдресСтрока.Товары.Скопировать();
			
			СтруктураПоискаНоменклатураХарактеристикаОтмененоЛожь = Новый Структура;
			СтруктураПоискаНоменклатураХарактеристикаОтмененоЛожь.Вставить("Номенклатура", СтрокаОстатки.Номенклатура);
			СтруктураПоискаНоменклатураХарактеристикаОтмененоЛожь.Вставить("Характеристика", СтрокаОстатки.Характеристика);
			СтруктураПоискаНоменклатураХарактеристикаОтмененоЛожь.Вставить("Отменено", Ложь);
			СтруктураПоискаНоменклатураХарактеристикаОтмененоЛожь.Вставить("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.КОбеспечению);
			
			МассивСтрокТоварыЗаказаОтмененоЛожь = ТаблицаТоварыЗаказа.НайтиСтроки(СтруктураПоискаНоменклатураХарактеристикаОтмененоЛожь);
			
			СтруктураПоискаНоменклатураХарактеристикаОтмененоИстина = Новый Структура;
			СтруктураПоискаНоменклатураХарактеристикаОтмененоИстина.Вставить("Номенклатура", СтрокаОстатки.Номенклатура);
			СтруктураПоискаНоменклатураХарактеристикаОтмененоИстина.Вставить("Характеристика", СтрокаОстатки.Характеристика);
			СтруктураПоискаНоменклатураХарактеристикаОтмененоИстина.Вставить("Отменено", Истина);
			СтруктураПоискаНоменклатураХарактеристикаОтмененоИстина.Вставить("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.КОбеспечению);
		
			МассивСтрокТоварыЗаказаОтмененоИстина = ТаблицаТоварыЗаказа.НайтиСтроки(СтруктураПоискаНоменклатураХарактеристикаОтмененоИстина);
			
			Если (МассивСтрокТоварыЗаказаОтмененоЛожь.Количество() = 0 И МассивСтрокТоварыЗаказаОтмененоИстина.Количество() > 0)
				Или (МассивСтрокТоварыЗаказаОтмененоЛожь.Количество() = 0 И МассивСтрокТоварыЗаказаОтмененоИстина.Количество() = 0) Тогда
				МассивУдалитьСтроки.Добавить(СтрокаОстатки);
				Продолжить;
			ИначеЕсли МассивСтрокТоварыЗаказаОтмененоЛожь.Количество() > 0 Тогда	
				
				КоличествоУп = 0;
				Для Каждого СтрокаМассива Из МассивСтрокТоварыЗаказаОтмененоЛожь Цикл
					КоличествоУп = СтрокаМассива.КоличествоУпаковок;
				КонецЦикла;
				
				СтрокаОстатки.Цена = МассивСтрокТоварыЗаказаОтмененоЛожь[0].Цена;
				СтрокаОстатки.КоличествоЗаказано = КоличествоУп;
				
				Если СтрокаОстатки.Доступно > СтрокаОстатки.КоличествоЗаказано Тогда
					СтрокаОстатки.КоличествоОтгрузить = СтрокаОстатки.КоличествоЗаказано;
				Иначе
					СтрокаОстатки.КоличествоОтгрузить = СтрокаОстатки.Доступно;
				КонецЕсли;
				
				// Стоимость с НДС
				СтрокаОстатки.СтавкаНДССсылка = МассивСтрокТоварыЗаказаОтмененоЛожь[0].СтавкаНДС;
				СтрокаОстатки.СтавкаНДС = МассивСтрокТоварыЗаказаОтмененоЛожь[0].СтавкаНДС.Ставка;
				// ++ Галфинд Волков 2023/12/26
				// СтрокаОстатки.Стоимость = СтрокаОстатки.КоличествоОтгрузить * МассивСтрокТоварыЗаказаОтмененоЛожь[0].Цена
				//	* (1 + МассивСтрокТоварыЗаказаОтмененоЛожь[0].СтавкаНДС.Ставка/100);
				СтрокаОстатки.Стоимость = СтрокаОстатки.КоличествоОтгрузить * МассивСтрокТоварыЗаказаОтмененоЛожь[0].Цена
					* (1 + МассивСтрокТоварыЗаказаОтмененоЛожь[0].СтавкаНДС.Ставка / 100)
					* (1 - МассивСтрокТоварыЗаказаОтмененоЛожь[0].ПроцентРучнойСкидки / 100);
					
				СтрокаОстатки.СкидкаИзЗаказа = МассивСтрокТоварыЗаказаОтмененоЛожь[0].ПроцентРучнойСкидки;
				// -- Галфинд Волков 2023/12/26
				
			КонецЕсли;
			// ++ Галфинд Волков 2023/12/18
			
		КонецЦикла;
	
	// ++ Галфинд Волков 2023/12/18
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		ТаблицаОстатки.Удалить(УдалитьСтроку);
	КонецЦикла;
	// -- Галфинд Волков 2023/12/18
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОстаткиИтог.Клиент КАК Клиент,
		|	ТаблицаОстаткиИтог.АдресДоставки КАК АдресДоставки,
		|	ТаблицаОстаткиИтог.Номенклатура КАК Номенклатура,
		|	ТаблицаОстаткиИтог.ЗаказНаОтгрузку КАК Заказ,
		|	ТаблицаОстаткиИтог.ОтгрузкаПеремещением КАК ОтгрузкаПеремещением,
		|	ТаблицаОстаткиИтог.Характеристика КАК Характеристика,
		|	ТаблицаОстаткиИтог.Организация КАК Организация,
		|	ТаблицаОстаткиИтог.Договор КАК Договор,
		|	ТаблицаОстаткиИтог.Склад КАК Склад,
		|	ТаблицаОстаткиИтог.Доступно КАК КоличествоДоступно,
		|	ТаблицаОстаткиИтог.КоличествоЗаказано КАК КоличествоЗаказано,
		|	ТаблицаОстаткиИтог.КоличествоОтгрузить КАК КоличествоОтгрузить,
		|	ТаблицаОстаткиИтог.Цена КАК Цена,
		|	ТаблицаОстаткиИтог.Стоимость КАК Стоимость,
		// ++ Галфинд Волков 2023/12/26
		|	ТаблицаОстаткиИтог.СкидкаИзЗаказа КАК СкидкаИзЗаказа,
		// -- Галфинд Волков 2023/12/26
		|	ТаблицаОстаткиИтог.ТоварыВКоробках КАК ТоварыВКоробках,
		|	ТаблицаОстаткиИтог.СтавкаНДССсылка КАК СтавкаНДССсылка,
		|	ТаблицаОстаткиИтог.СтавкаНДС КАК СтавкаНДС
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаОстатки КАК ТаблицаОстаткиИтог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ.Клиент КАК Клиент,
		|	ВТ.АдресДоставки КАК АдресДоставки,
		|	ВТ.Номенклатура КАК Номенклатура,
		|	ВТ.Заказ КАК Заказ,
		|	ВТ.ОтгрузкаПеремещением КАК ОтгрузкаПеремещением,
		|	ВТ.Характеристика КАК Характеристика,
		|	ВТ.Организация КАК Организация,
		|	ВТ.Договор КАК Договор,
		|	ВТ.Склад КАК Склад,
		|	ВТ.КоличествоДоступно КАК КоличествоДоступно,
		|	ВТ.КоличествоЗаказано КАК КоличествоЗаказано,
		|	ВТ.КоличествоОтгрузить КАК КоличествоОтгрузить,
		|	ВТ.Цена КАК Цена,
		|	ВТ.Стоимость КАК Стоимость,
		|	ВТ.СтавкаНДССсылка КАК СтавкаНДССсылка,
		|	ВТ.СтавкаНДС КАК СтавкаНДС,
		// ++ Галфинд Волков 2023/12/26
		|	ВТ.СкидкаИзЗаказа КАК СкидкаИзЗаказа,
		// -- Галфинд Волков 2023/12/26
		|	ВТ.ТоварыВКоробках КАК ТоварыВКоробках,
		|	гф_АдресаДоставки.НомерАдреса КАК НомерАдреса,
		|	ЛОЖЬ КАК Блокировка,
		|	ЛОЖЬ КАК Отгрузить,
		|	ЛОЖЬ КАК БлокировкиОтгрузок,
		|	0 КАК ДействующийЛимит,
		|	НоменклатураЕИ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	НоменклатураЕИ.Артикул КАК Артикул
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_АдресаДоставки КАК гф_АдресаДоставки
		|		ПО ВТ.АдресДоставки = гф_АдресаДоставки.Ссылка,
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураЕИ
		|		ПО ВТ.Номенклатура = НоменклатураЕИ.Ссылка
		|ИТОГИ ПО
		|	Клиент,
		|	НомерАдреса";
	
	Запрос.УстановитьПараметр("ТаблицаОстатки", ТаблицаОстатки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗВыборкаЗаказАдрес = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат ТЗВыборкаЗаказАдрес;
	
КонецФункции     

// ++ Галфинд Окунев 2023.11.22 {	
// Корректировка текста запроса для предоплатных
//
// Параметры:
//
// ТекстЗапроса - Строка
// ОтборПредоплатныхКлиентов - Число
//
&НаСервере
Процедура КорректировкаТекстаЗапросаПредоплатные(ТекстЗапроса, ОтборПредоплатныхКлиентов)
	
	Предопдлатные	= 1;
	Непредоплатные	= 2;
	
	Если ОтборПредоплатныхКлиентов = Предопдлатные Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор");
		
	ИначеЕсли ОтборПредоплатныхКлиентов = Непредоплатные Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "Не ЗаказНоменклатураХарактеристика.ПредоплатныйДоговор");
		
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредоплатныйДоговор", "ИСТИНА");
		
	КонецЕсли;	
	
КонецПроцедуры
// -- Галфинд Окунев 2023.11.22 {	

Функция ПолучитьНоменклатуруТабличнойЧастиЗаказа(ТЗ_Заказ_Товары, СкидкаВКоробах, ВариантыОбеспечения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаОстаткиИтог.Номенклатура КАК Номенклатура,
	|	ТаблицаОстаткиИтог.Характеристика КАК Характеристика,
	|	ТаблицаОстаткиИтог.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ТаблицаОстаткиИтог.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ТаблицаОстаткиИтог.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|	ТаблицаОстаткиИтог.Отменено КАК Отменено
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаОстатки КАК ТаблицаОстаткиИтог
	|ГДЕ
	|	ТаблицаОстаткиИтог.ВариантОбеспечения = &ВариантОбеспечения
	|	И ТаблицаОстаткиИтог.ПроцентРучнойСкидки = &ПроцентРучнойСкидки
	|	И Не ТаблицаОстаткиИтог.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика,
	|	ВТ.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ТаблицаОстатки", ТЗ_Заказ_Товары);
	Запрос.УстановитьПараметр("ПроцентРучнойСкидки", СкидкаВКоробах);
	Запрос.УстановитьПараметр("ВариантОбеспечения", ВариантыОбеспечения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатВыборки = РезультатЗапроса.Выгрузить();
	
	Возврат РезультатВыборки;
	
КонецФункции

Функция РазницаТаблицЗначений(Таблица0, Таблица1) Экспорт
	
	ВсеКолонки = "";
	
	Для Каждого Колонка Из Таблица0.Колонки Цикл 
		ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;
	ВсеКолонки = Сред(ВсеКолонки, 2);
	
	Таблица = Таблица1.Скопировать();    
	
	Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
	
	Таблица.ЗаполнитьЗначения(1, "Знак");
	
	Для Каждого Строка Из Таблица0 Цикл ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка) КонецЦикла;
	
	Таблица.Колонки.Добавить("Счёт");
	Таблица.ЗаполнитьЗначения(1, "Счёт");
	
	Таблица.Свернуть(ВсеКолонки, "Знак, Счёт");
	
	Ответ = Таблица.Скопировать(Новый Структура("Счёт", 1), ВсеКолонки + ", Знак");
	
	Возврат Ответ;
	
КонецФункции

Процедура ЗаполнитьЗначенияИзСтроки(СтрокаУпаковочныеЛистыНоменклатура, Строка_Т, ЭтоТоварыВКоробках)
	
	Если ЭтоТоварыВКоробках Тогда
		СтрокаУпаковочныеЛистыНоменклатура.ЭлементУпаковочныйЛистНоменклатура 		= Строка_Т.УпаковочныйЛистСсылка;
	Иначе
		СтрокаУпаковочныеЛистыНоменклатура.ЭлементУпаковочныйЛистНоменклатура 		= Строка_Т.Номенклатура;
		СтрокаУпаковочныеЛистыНоменклатура.Характеристика 							= Строка_Т.Характеристика;
	КонецЕсли;
	
	СтрокаУпаковочныеЛистыНоменклатура.КоличествоОстаток 							= Строка_Т.КоличествоОтгрузить;
	СтрокаУпаковочныеЛистыНоменклатура.Цена 										= Строка_Т.Цена;
	// ++ Галфинд ВолковЕВ 28.04.2023 НДС Для заполнения скрытого реквизита "гф_СуммаНоменклатуры" в документе "Расходный ордер"
	СтрокаУпаковочныеЛистыНоменклатура.СтавкаНДС 									= Строка_Т.СтавкаНДС;
	// -- Галфинд ВолковЕВ 28.04.2023
	СтрокаУпаковочныеЛистыНоменклатура.Скидка 										= Строка_Т.Скидка;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТоваров(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных,
	ОбъектЗаказ)
	
	Для Каждого СтрокаТовары Из ТЗ_Заказ_Товары Цикл
		
		Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Или СтрокаТовары.Отменено Тогда
			Продолжить;
		Иначе
			
			Если СтрокаУпаковочныйЛистНоменклатура.ЭлементУпаковочныйЛистНоменклатура = СтрокаТовары.Номенклатура Тогда
				
				ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
				
				ПараметрыРазбиенияСтроки = ПараметрыРазбиенияСтроки();
				
				Количество = 0;
				
				Если ЗначениеЗаполнено(СтрокаТовары.Характеристика) Тогда
					
					Если СтрокаУпаковочныйЛистНоменклатура.Характеристика = СтрокаТовары.Характеристика
						Или (ТипЗнч(СтрокаУпаковочныйЛистНоменклатура.Характеристика) = Тип("Строка")
						И СтрокаУпаковочныйЛистНоменклатура.Характеристика = СтрокаТовары.Характеристика.Наименование) Тогда
						
						Количество = СтрокаУпаковочныйЛистНоменклатура.КоличествоОстаток;
						
						ПараметрыОбработки = ПолучитьПараметрыОбработки(ТЗ_Новая_Заказ_Товары, ЭтаФорма, "", ПараметрыРазбиенияСтроки,
							ДополнительныеПараметры, Количество);
						
						ДобавитьСтрокуРазбиением(ПараметрыОбработки, ТЗ_Новая_Заказ_Товары, СтрокаТовары, ТЗ_Заказ_Товары,
							Неопределено, СтрокаУпаковочныйЛистНоменклатура.ЭлементУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных,
							СтрокаУпаковочныйЛистНоменклатура.Скидка, СтрокаУпаковочныйЛистНоменклатура.ВидЦены);
						
						Прервать;
						
					КонецЕсли;
					
				Иначе
					
					Количество = СтрокаУпаковочныйЛистНоменклатура.КоличествоОстаток;
					
					ПараметрыОбработки = ПолучитьПараметрыОбработки(ТЗ_Новая_Заказ_Товары, ЭтаФорма, "", ПараметрыРазбиенияСтроки,
						ДополнительныеПараметры, Количество);
					
					ДобавитьСтрокуРазбиением(ПараметрыОбработки, ТЗ_Новая_Заказ_Товары, СтрокаТовары, ТЗ_Заказ_Товары,
						Неопределено, СтрокаУпаковочныйЛистНоменклатура.ЭлементУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных,
						СтрокаУпаковочныйЛистНоменклатура.Скидка, СтрокаУпаковочныйЛистНоменклатура.ВидЦены);
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТоваровВКоробах(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, СтрокаУпаковочныйЛистНоменклатура,
	СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах, ТЗ_Новая_Заказ_ТоварыВКоробах,
	ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах, ТабКомплектация,
	СписокКодовСтрокиПоУпаковочнымЛистам, ТекстСообщения)
	
	СостояниеКороба = СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_СостояниеКороба;
	
	// Перебираем все варианты комплектации в находящиеся в заказе на совпадение варианта комплектации который указан в отгружаемым упаковочным листе.
	// Найденную строку пробуем отгрузить. В дополнение добавляем строки по истории работы с вариантами комплектаций,
	// какое количество было отгружено и какое осталось
	Для Каждого СтрокаТоварыВКоробах Из ТЗ_Заказ_ТоварыВКоробах Цикл
		
		Если СтрокаТоварыВКоробах.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			Продолжить;
		ИначеЕсли СтрокаТоварыВКоробах.ВариантКомплектации = СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация Тогда
			
			ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТоварыВКоробах, Истина);
			
			ПараметрыРазбиенияСтроки = ПараметрыРазбиенияСтроки();
			ПараметрыРазбиенияСтроки.ИмяПоляКоличество = "Количество"; // Меняем имя поля на "Количество", что бы воспользоваться строками кода из типового механизма
			
			// В цикле перебираются варианты комплектации последовательно, всегда по одному, поэтому передаем количестово один для разбиения строки
			Количество = 1;
			
			ПараметрыОбработки = ПолучитьПараметрыОбработки(ТЗ_Новая_Заказ_ТоварыВКоробах, ЭтаФорма, "", ПараметрыРазбиенияСтроки, ДополнительныеПараметры, Количество);
			
			СкидкаВКоробах = СтрокаТоварыВКоробах.Скидка;
			ОтказЗаписьУпаковочногоЛиста = Истина;
			
			МассивСтрок = ТЗ_ПричиныИзмененияТоварыВКоробах.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТоварыВКоробах.ИдентификаторСтроки));
			
			// Проверка истории по строке комплектации, если нет первой строки с историей, то добавим ее 
			Если МассивСтрок.Количество() = 0 Тогда
				Строка = ТЗ_ПричиныИзмененияТоварыВКоробах.Добавить();
				ЗаполнитьЗначенияСвойств(Строка, СтрокаТоварыВКоробах);
			ИначеЕсли МассивСтрок.Количество() = 1 И Не ЗначениеЗаполнено(МассивСтрок[0].Количество) Тогда
				ЗаполнитьЗначенияСвойств(МассивСтрок[0], СтрокаТоварыВКоробах);
			КонецЕсли;
			
			НеНайденУпаковочныйЛист = Ложь;
			
			ДобавитьСтрокуРазбиениемДляУпаковочногоЛиста(ПараметрыОбработки, ТЗ_Новая_Заказ_ТоварыВКоробах, СтрокаТоварыВКоробах, СтруктураПереданныхДанных,
				НеНайденУпаковочныйЛист, СтрокаУпаковочныйЛистНоменклатура.Скидка, СтрокаУпаковочныйЛистНоменклатура.ВидЦены);
			
			Если НеНайденУпаковочныйЛист Тогда
				Продолжить;
			КонецЕсли;
			
			ОтказЗаписьУпаковочногоЛиста = Ложь;
			
			Ответственный = ПользователиИнформационнойБазы.ТекущийПользователь();
			
			СтрокаПричиныИзменения = ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах.Добавить();
			СтрокаПричиныИзменения.ИдентификаторСтроки 	= СтрокаТоварыВКоробах.ИдентификаторСтроки;
			СтрокаПричиныИзменения.ВариантКомплектации 	= СтрокаТоварыВКоробах.ВариантКомплектации;
			СтрокаПричиныИзменения.Количество 			= Количество * (-1);
			СтрокаПричиныИзменения.Причина 				= Справочники.ПричиныОтменыЗаказовКлиентов.гф_Отгружено;
			СтрокаПричиныИзменения.Дата 				= ТекущаяДата();
			СтрокаПричиныИзменения.Комментарий 			= "";
			СтрокаПричиныИзменения.Ответственный 		= Справочники.Пользователи.НайтиПоНаименованию(Ответственный.ПолноеИмя);
			СтрокаПричиныИзменения.Скидка 				= СтрокаТоварыВКоробах.Скидка;
			СтрокаПричиныИзменения.ЦенаКороба 			= СтрокаТоварыВКоробах.ЦенаКороба;
			СтрокаПричиныИзменения.ЦенаКоробаСоСкидкой 	= СтрокаТоварыВКоробах.ЦенаКоробаСоСкидкой;
			СтрокаПричиныИзменения.ВидЦены 				= СтрокаТоварыВКоробах.ВидЦены;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтказЗаписьУпаковочногоЛиста Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не достаточно остатков в ""%1"" по ""%2"" на вкладке ""Товары в коробах"". Необходимо проверить количество в колонке для комплектации упаковочного листа'"),
			ОбъектЗаказ, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
		Возврат;
	КонецЕсли;
	
	// Пересорт
	Если СостояниеКороба = Справочники.гф_СостянияКоробов.Пересорт Тогда
		
		ОбработкаЗаполненияТоваровВКоробахПересорт(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары,
			СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,
			ТЗ_Новая_Заказ_ТоварыВКоробах, ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах,
			ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам, СкидкаВКоробах, Количество, ТекстСообщения);
			
	// НеПолный
	ИначеЕсли СостояниеКороба = Справочники.гф_СостянияКоробов.НеПолный Тогда
		
		 ОбработкаЗаполненияТоваровВКоробахНеПолный(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары,
		 	СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,
		 	ТЗ_Новая_Заказ_ТоварыВКоробах, ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах,
		 	ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам, СкидкаВКоробах, Количество, ТекстСообщения);
			
	// НеполныйИПересорт
	ИначеЕсли СостояниеКороба = Справочники.гф_СостянияКоробов.НеПолныйИПересорт Тогда
		
		ОбработкаЗаполненияТоваровВКоробахНеполныйИПересорт(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары,
			СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,
			ТЗ_Новая_Заказ_ТоварыВКоробах, ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах,
			ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам, СкидкаВКоробах, Количество, ТекстСообщения);
			
	// ПолныйКомплект	
	ИначеЕсли СостояниеКороба = Справочники.гф_СостянияКоробов.ПолныйКомплект Тогда
		
		ОбработкаЗаполненияТоваровВКоробахПолныйКомплект(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары,
			СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,
			ТЗ_Новая_Заказ_ТоварыВКоробах, ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах,
			ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам, СкидкаВКоробах, Количество);
			
	Иначе
		
		Отказ = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Состояние ""%1"" упаковочного листа ""%3"" по ""%2"" не соответствует состоянию отгрузки (ПолныйКомплект, Пересорт, НеПолный, НеполныйИПересорт)'"),
			СостояниеКороба, ОбъектЗаказ, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТоваровВКоробахПересорт(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, СтрокаУпаковочныйЛистНоменклатура,
	СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах, ТЗ_Новая_Заказ_ТоварыВКоробах,
	ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах, ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам,
	СкидкаВКоробах, Количество, ТекстСообщения)

    НайденныйЭлемент = Справочники.ВариантыКомплектацииНоменклатуры.НайтиПоНаименованию(СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация.Наименование);
	
	Если Не НайденныйЭлемент = Неопределено Тогда
		ТЗ_УпаковочныйЛистЭталонКомплектация = Новый ТаблицаЗначений;
		ТЗ_УпаковочныйЛистЭталонКомплектация = НайденныйЭлемент.Товары.Выгрузить();
		ТЗ_УпаковочныйЛистЭталонКомплектация.Свернуть("Номенклатура, Характеристика, КоличествоУпаковок");
	Иначе
		ОтказЗаписьУпаковочногоЛиста = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не возможно сравнить пересорт с эталоном комплектации, комплектация не найдена ""%1"" по ""%2"" для""%3""'"),
			СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация.Наименование, ОбъектЗаказ, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
		ВозвратПродолжить = Истина;
		Возврат;
	КонецЕсли;
	
	// Выгрузка актуальных данных из упаковочного листа
	ТЗ_УпаковочныйЛист = Новый ТаблицаЗначений;
	ТЗ_УпаковочныйЛист = СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.Товары.Выгрузить();
	ТЗ_УпаковочныйЛист.Свернуть("Номенклатура, Характеристика, КоличествоУпаковок");
	
	РазницаТаблиц = РазницаТаблицЗначений(ТЗ_УпаковочныйЛистЭталонКомплектация, ТЗ_УпаковочныйЛист);
	
	ТЗСНоменклатуройИКоличествомДляКорректировки = Новый ТаблицаЗначений;
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("Номенклатура");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("Характеристика");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("ДобавитьКоличество");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("УбратьКоличество");
	
	// Отрабатываем разницу по таблице один
	НайтиСтрокиРазницаТаблиц = РазницаТаблиц.НайтиСтроки(Новый Структура("Знак", 1));
	
	Для Каждого СтрокаРазницаВНоменклатуре Из НайтиСтрокиРазницаТаблиц Цикл
		
		НайтиСтрокиЭталон = ТЗ_УпаковочныйЛистЭталонКомплектация.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",
			СтрокаРазницаВНоменклатуре.Номенклатура, СтрокаРазницаВНоменклатуре.Характеристика));
		
		Если Не НайтиСтрокиЭталон = Неопределено И НайтиСтрокиЭталон.Количество() = 1  Тогда
			
			Если НайтиСтрокиЭталон[0].КоличествоУпаковок < СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда
				
				ДобавитьКоличество = СтрокаРазницаВНоменклатуре.КоличествоУпаковок - НайтиСтрокиЭталон[0].КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 			= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 			= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 		= ДобавитьКоличество;
				Стр.УбратьКоличество 		= 0;
				
			ИначеЕсли НайтиСтрокиЭталон[0].КоличествоУпаковок > СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда	
				
				УбратьКоличество = НайтиСтрокиЭталон[0].КоличествоУпаковок - СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 			= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 			= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 		= 0;
				Стр.УбратьКоличество 		= УбратьКоличество;
				
			КонецЕсли;
			
		Иначе
			
			// Добавление Номенклатуры в заказ
			Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
			Стр.Номенклатура 				= СтрокаРазницаВНоменклатуре.Номенклатура;
			Стр.Характеристика 				= СтрокаРазницаВНоменклатуре.Характеристика;
			Стр.ДобавитьКоличество 			= СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
			Стр.УбратьКоличество 			= 0;
			
		КонецЕсли;
		
	КонецЦикла;

	// Отрабатываем разницу по таблице ноль
	НайтиСтрокиРазницаТаблиц2 = РазницаТаблиц.НайтиСтроки(Новый Структура("Знак", 0));
	
	// Обработка отсутствующей номенклатуры в Упаковочном листе по сравнению с эталоном
	Для Каждого СтрокаРазницаВНоменклатуре Из НайтиСтрокиРазницаТаблиц2 Цикл
		
		НайтиСтрокиЭталон = ТЗ_УпаковочныйЛист.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрокаРазницаВНоменклатуре.Номенклатура,
			СтрокаРазницаВНоменклатуре.Характеристика));
		
		Если Не НайтиСтрокиЭталон = Неопределено И НайтиСтрокиЭталон.Количество() = 0  Тогда
			
			Найдена = Ложь;
			
			Для Каждого Строк Из ТЗ_УпаковочныйЛист Цикл
				
				Если СтрокаРазницаВНоменклатуре.Характеристика = Строк.Характеристика Тогда
					
					Найдена = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не Найдена Тогда
				
				УбратьКоличество = СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 					= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 					= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 				= 0;
				Стр.УбратьКоличество 				= УбратьКоличество;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляем или отменяем номенклатуру по пересорту упаковочного листа
	Для Каждого СтрокаРазница Из ТЗСНоменклатуройИКоличествомДляКорректировки Цикл
		
		НайтиСтроки_ВариантОбеспечения = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
		СтрокаРазница.Номенклатура, СтрокаРазница.Характеристика, СкидкаВКоробах, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
		
		Если Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
			
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];
			
			Если СтрокаРазница.ДобавитьКоличество > 0 Тогда
				
				НоваяСтрока = ТЗ_Заказ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
				
				НоваяСтрока.КоличествоУпаковок 		= СтрокаРазница.ДобавитьКоличество;
				НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
				НоваяСтрока.гф_ДобавленоПоПричине 	= Истина;
				НоваяСтрока.гф_ПричинаДобавления 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
				
				ПолучитьМаксНомерСтроки(ТЗ_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
								
				ДополнительныеПараметры = ПолучитьДополнительныеПараметрыПересорт(СтрокаТовары);
				
				СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
				
				СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
				
				// Берем итоговое количество, так как сумма складывается в строке заказа из этого количества
				// а нам нужно получить из этой суммы сумму по количесву в новой строке
				СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + СтрокаТовары[СтруктураПересчетаСуммы.ИмяПоляКоличество];
				
				// Получаем новые суммы по новому количеству, находим их по коэффициенту из количество и суммы в строке заказа
				ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
				
				// После пересчета выше, должно срабатывать нормально получение количества из количества упаковок, но пока на всякий случай
				// НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
								
			ИначеЕсли СтрокаРазница.УбратьКоличество > 0 Тогда
				
				Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
					ПроверкаОтказ = Истина;
					Возврат;
				КонецЕсли;
				
				УбратьКоличество = СтрокаРазница.УбратьКоличество;
				
				ДополнительныеПараметры = ПолучитьДополнительныеПараметрыПересорт(СтрокаТовары);
				
				Если СтрокаТовары.КоличествоУпаковок > УбратьКоличество Тогда
					
					НоваяСтрока = ТЗ_Заказ_Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
					
					НоваяСтрока.КоличествоУпаковок 	= УбратьКоличество;
					НоваяСтрока.Отменено 			= Истина;
					НоваяСтрока.ПричинаОтмены 		= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
					
					СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок - УбратьКоличество;
					
					ПолучитьМаксНомерСтроки(ТЗ_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
					
					СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
					
					СтруктураПересчетаСуммы.Строки.Добавить(СтрокаТовары);
					СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + СтрокаТовары[СтруктураПересчетаСуммы.ИмяПоляКоличество];
					
					СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
					СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
					
					ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
				// ++ Галфинд ВолковЕВ 2024/01/21	
				ИначеЕсли СтрокаТовары.КоличествоУпаковок = УбратьКоличество Тогда
					
					СтрокаТовары.Отменено = Истина;
					
					СтрокаТовары.ПричинаОтмены 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
					
				// -- Галфинд ВолковЕВ 2024/01/21	
				ИначеЕсли СтрокаТовары.КоличествоУпаковок = Количество Тогда
					
					СтрокаТовары.Отменено = Истина;
					
					СтрокаТовары.ПричинаОтмены 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
					
				Иначе
					
					ПроверкаОтказ = Истина;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			
			// ++ Галфинд ВолковЕВ 2024/01/21 Предполагается что количество в этом условии всегда больше нуля.
			Если СтрокаРазница.ДобавитьКоличество > 0 Тогда
				
				НоваяСтрока = ТЗ_Заказ_Товары.Добавить();
				
				// Используем данные другой номенклатуры по комплектации упаковочного листа, что бы заполнить цену и суммы в новой строке заказа.
				// При этом количетво ищем то что и в добавляемой номенклатуре, что бы сумму и сумму НДС не пересчитывать. 
				ВременнаяТЗ = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Количество, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
								СтрокаРазница.Номенклатура, СтрокаРазница.ДобавитьКоличество, СкидкаВКоробах, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
				// Временное решение, получение суммы из общего найденного количества по строке.				
				ВременнаяТЗ_1 = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Количество, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
									СтрокаРазница.Номенклатура, 1, СкидкаВКоробах, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
				// Временное решение, получение суммы из общего найденного количества по строке.					
				ВременнаяТЗ_2 = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Количество, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
									СтрокаРазница.Номенклатура, 2, СкидкаВКоробах, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));

                Если Не ВременнаяТЗ = Неопределено И ВременнаяТЗ.Количество() > 0 Тогда
					
					Для каждого СтрТЗ Из ВременнаяТЗ Цикл
						
						Если СтрТЗ.Цена > 0 Тогда
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЗ, , "Характеристика, Количество, КоличествоУпаковок");
							Прервать;
						КонецЕсли;	
						
					КонецЦикла;
				ИначеЕсли Не ВременнаяТЗ_1 = Неопределено И ВременнаяТЗ_1.Количество() > 0 Тогда
					// Временное решение, получение суммы по одной единице номенклатуры из общего найденного количества по строке.					
					Для каждого СтрТЗ Из ВременнаяТЗ_1 Цикл
						
						Если СтрТЗ.Цена > 0 Тогда
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЗ, , "Характеристика, Количество, КоличествоУпаковок");
							
							НоваяСтрока.Сумма 		= НоваяСтрока.Сумма * СтрокаРазница.ДобавитьКоличество;
							НоваяСтрока.СуммаСНДС 	= НоваяСтрока.Сумма * СтрокаРазница.ДобавитьКоличество;
							НоваяСтрока.СуммаНДС 	= НоваяСтрока.Сумма * СтрокаРазница.ДобавитьКоличество;
							Прервать;
						КонецЕсли;	
						
					КонецЦикла;
				ИначеЕсли Не ВременнаяТЗ_2 = Неопределено И ВременнаяТЗ_2.Количество() > 0 Тогда
					// Временное решение, получение суммы по двум единицам номенклатуры из общего найденного количества по строке.					
					Для каждого СтрТЗ Из ВременнаяТЗ_2 Цикл
						
						Если СтрТЗ.Цена > 0 Тогда
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЗ, , "Характеристика, Количество, КоличествоУпаковок");
							
							НоваяСтрока.Сумма 		= НоваяСтрока.Сумма / 2 * СтрокаРазница.ДобавитьКоличество;
							НоваяСтрока.СуммаСНДС 	= НоваяСтрока.Сумма / 2 * СтрокаРазница.ДобавитьКоличество;
							НоваяСтрока.СуммаНДС 	= НоваяСтрока.Сумма / 2 * СтрокаРазница.ДобавитьКоличество;
							Прервать;
						КонецЕсли;	
						
					КонецЦикла;
				КонецЕсли;
				
				НайтиСтроки_ВариантОбеспечения = ТабКомплектация.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",
					СтрокаРазница.Номенклатура, СтрокаРазница.Характеристика));
					
					// Ситуация при которой отменяемое количество 
				Если НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
					
					СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];	
					СтрокаТовары.КоличествоУпаковок = СтрокаРазница.ДобавитьКоличество;
					
					НоваяСтрока.Номенклатура 			= СтрокаРазница.Номенклатура;
					НоваяСтрока.Характеристика 			= СтрокаРазница.Характеристика;
					НоваяСтрока.Количество 				= СтрокаРазница.ДобавитьКоличество;
					НоваяСтрока.КоличествоУпаковок 		= СтрокаРазница.ДобавитьКоличество;
					НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
					НоваяСтрока.гф_ДобавленоПоПричине 	= Истина;
					НоваяСтрока.гф_ПричинаДобавления 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
					
					// Поиск любого совпадения, что бы взять данные для новой строки которой нет в комплектации
					ВременнаяТЗ_Сумма = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, ВариантОбеспечения, Отменено",
									СтрокаРазница.Номенклатура, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
					
					НоваяСтрока.Сумма 		= ВременнаяТЗ_Сумма[0].Цена * СтрокаРазница.ДобавитьКоличество;
					НоваяСтрока.СуммаНДС 	= НоваяСтрока.Сумма * ВременнаяТЗ_Сумма[0].СтавкаНДС.Ставка / 100;
					НоваяСтрока.СуммаСНДС 	= НоваяСтрока.Сумма + НоваяСтрока.СуммаНДС;
					
					НоваяСтрока.ПроцентРучнойСкидки 	= ВременнаяТЗ_Сумма[0].ПроцентРучнойСкидки;
					НоваяСтрока.СуммаРучнойСкидки 		= НоваяСтрока.Сумма * НоваяСтрока.ПроцентРучнойСкидки / 100;
					
					ПолучитьМаксНомерСтроки(ТЗ_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
					
				КонецЕсли;
			КонецЕсли;
		    // -- Галфинд ВолковЕВ 2024/01/21
			
		КонецЕсли;
		
	КонецЦикла;
	// Отгружаем непосредственно по комплектации упаковочного листа добавляя данные в отдельную таблицу "ТЗ_Новая_Заказ_Товары",
	// либо корректируя саму таблицу заказа, если не требуется разделять строки
	Для Каждого СтрокаКомплектацияРазбиение Из ТабКомплектация Цикл
		
		НайтиСтроки_ВариантОбеспечения = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
			СтрокаКомплектацияРазбиение.Номенклатура, СтрокаКомплектацияРазбиение.Характеристика, СкидкаВКоробах,
			Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
		
		Если Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 1 Тогда
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения;
		ИначеЕсли Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];	
		КонецЕсли;
		
		ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
		
		Количество = СтрокаКомплектацияРазбиение.Количество;
		
		// Когда найдено несколько записей в заказе, пробуем отгружать количество по одной строке или частям по каждой,
		// что бы в сумме отгрузка сравнялось по количеству
		Если Не ТипЗнч(СтрокаТовары) = Тип("Массив") Тогда
			
			Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
				ПроверкаОтказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если СтрокаТовары.КоличествоУпаковок > Количество Тогда
				
				// Записываем в отдельную таблицу, так как в основной не находились строки которые уже в цикле отгрузили по количеству
				НоваяСтрока = ТЗ_Новая_Заказ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
				
				НоваяСтрока.КоличествоУпаковок 	= Количество;
				НоваяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
				НоваяСтрока.ДатаОтгрузки 		= ТекущаяДата();
				
				СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок - Количество;
				
				ПолучитьМаксНомерСтроки(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
				
				ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
					НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
					
				ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
					НоваяСтрока, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);	
				
				СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
				
				СтруктураПересчетаСуммы.Строки.Добавить(СтрокаТовары);
				СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + СтрокаТовары[СтруктураПересчетаСуммы.ИмяПоляКоличество];
				
				СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
				СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
				
				ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
				
			ИначеЕсли СтрокаТовары.КоличествоУпаковок = Количество Тогда
				
				СтрокаТовары.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
				СтрокаТовары.ДатаОтгрузки 			= ТекущаяДата();
				
				ПолучитьКомментарийИСкидкиДляРТУ(СтрокаТовары.гф_КомментарийРТУ, СтрокаТовары.гф_СкидкаДляРТУ, СтрокаТовары.гф_ДатаДляРТУ,
					СтрокаТовары.ПроцентРучнойСкидки, СтруктураПереданныхДанных, СтрокаТовары.гф_ПрайсЛистДляРТУ);
						
				ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
					СтрокаТовары, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);	
				
			Иначе
				
				ПроверкаОтказ = Истина;
				Возврат;
				
			КонецЕсли;	
			
		Иначе
			 
			КоличествоОбщееНоменклатуры = 0;
			
			// Когда найдено несколько строк в которых возможно по количеству отгрузить номенклатуру из упаковочного листа
			// Перебираем каждую строку и смотрим общее количество в этих строках
			Для Каждого ЭлементМассива Из СтрокаТовары Цикл
				
				КоличествоОбщееНоменклатуры = КоличествоОбщееНоменклатуры + ЭлементМассива.КоличествоУпаковок;
				
			КонецЦикла;
			
			Если КоличествоОбщееНоменклатуры > Количество Тогда
				
				ДополнительноТребуетсяОтгрузитьКоличество = 0;
				
				// Сначала отгрузим ту номенклатуру, которая была добавлена плюсом из_за пересорта в таблицу заказа, а что не хватило
				// то это количество пробуем отгрузить по количеству которое уже было в заказе до добавления пересорта
				// Для этого используем переменную "ДополнительноТребуетсяОтгрузитьКоличество", фиксируя остаток количества
				Для Каждого ЭлементМассива Из СтрокаТовары Цикл
					
					Если ЭлементМассива.гф_ДобавленоПоПричине Тогда
						
						Если ЭлементМассива.КоличествоУпаковок = Количество Тогда
							
							ЭлементМассива.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
							ЭлементМассива.ДатаОтгрузки 		= ТекущаяДата();
							
							ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
								ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных,
								ЭлементМассива.гф_ПрайсЛистДляРТУ);
							ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
								ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);	
							Прервать;
							
						ИначеЕсли ЭлементМассива.КоличествоУпаковок > Количество Тогда
							
							// ++ Галфинд ВолковЕВ 2024/01/21 Выявилась ситуация когда пересорт сферх уникальных характеристик комплектации,
							// но количество по упаковочному листу и комплектации сходится
							
							// // Данная ситуация исключена, так как подобная номенклатура добавляемая по причине, добавляется в том количестве,
							// // которое необходимо для списания с учетом уже существующего количества в заказе
							// ПроверкаОтказ = Истина;
							// ТекстСообщения = НСтр("ru = 'Частный случай добавления номенклатуры в количестве превышающим требуемое, необходимо обратиться к администратору!""!'");
							// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							
							// Возврат;
							ЭлементМассива.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
							ЭлементМассива.ДатаОтгрузки 		= ТекущаяДата();
							
							ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
								ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки,
								СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
								
							ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
								ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
								
							ДополнительноТребуетсяОтгрузитьКоличество = Количество - ЭлементМассива.КоличествоУпаковок;
							Прервать;
							// -- Галфинд ВолковЕВ 2024/01/21
						ИначеЕсли Не ЭлементМассива.КоличествоУпаковок = 0 И ЭлементМассива.КоличествоУпаковок < Количество Тогда
							
							ЭлементМассива.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
							ЭлементМассива.ДатаОтгрузки 		= ТекущаяДата();
							
							ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
								ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки,
								СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
								
								
							ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
								ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
							
								
							ДополнительноТребуетсяОтгрузитьКоличество = Количество - ЭлементМассива.КоличествоУпаковок;
							
						Иначе
							ПроверкаОтказ = Истина;
							Возврат;
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла;
				
				Если ДополнительноТребуетсяОтгрузитьКоличество Тогда
					
					Для Каждого ЭлементМассива Из СтрокаТовары Цикл
						
						Количество = ДополнительноТребуетсяОтгрузитьКоличество;
						Если Не ЭлементМассива.гф_ДобавленоПоПричине Тогда
							
							Если ЭлементМассива.КоличествоУпаковок = Количество Тогда
								ЭлементМассива.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
								ЭлементМассива.ДатаОтгрузки 		= ТекущаяДата();
								
								ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
									ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
									
								ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
									ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
									
								Прервать;
								
							ИначеЕсли ЭлементМассива.КоличествоУпаковок > Количество Тогда
								
								НоваяСтрока = ТЗ_Новая_Заказ_Товары.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
								
								НоваяСтрока.КоличествоУпаковок = Количество;
								
								ЭлементМассива.КоличествоУпаковок = ЭлементМассива.КоличествоУпаковок - Количество;
								
								// Важно заполнять Количество, в типовой процедуре, откуда взят этот код, отсутвует параметр для заполнения количества,
								// только для КоличествоУпаковок
								// НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
								
								НоваяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
								НоваяСтрока.ДатаОтгрузки 		= ТекущаяДата();
								
								ПолучитьМаксНомерСтроки(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
								
								ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
									НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
								
								ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
									НоваяСтрока, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
								
								ДополнительныеПараметры = ПолучитьДополнительныеПараметры(ЭлементМассива, Ложь);
								
								РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ЭлементМассива);
								
							ИначеЕсли Не ЭлементМассива.КоличествоУпаковок = 0 И Количество > 0 И ЭлементМассива.КоличествоУпаковок < Количество Тогда
								// Пробуем отгрузить еще часть по количеству, возможно в следующей итерации цикла еще будет количество с которого
								// можно еще отгузить частично как здесть или же полностью но в условии выше
								
								ДополнительноТребуетсяОтгрузитьКоличество = Количество - ЭлементМассива.КоличествоУпаковок;
								
								ЭлементМассива.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
								ЭлементМассива.ДатаОтгрузки 		= ТекущаяДата();
								
								ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
									ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
									
								ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
									ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
								
							Иначе
								
								ПроверкаОтказ = Истина;
								Возврат;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли КоличествоОбщееНоменклатуры = Количество Тогда
				
				Для Каждого ЭлементМассива Из СтрокаТовары Цикл
					
					ЭлементМассива.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					ЭлементМассива.ДатаОтгрузки = ТекущаяДата();
					
					ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
						ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
						
					ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
						ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
					// Вроде как это лишнее здесь
					// РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ЭлементМассива);
					
				КонецЦикла;
				
			Иначе
				
				ПроверкаОтказ = Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбработкаЗаполненияТоваровВКоробахНеПолный(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, СтрокаУпаковочныйЛистНоменклатура,
	СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах, ТЗ_Новая_Заказ_ТоварыВКоробах,
	ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах, ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам,
	СкидкаВКоробах, Количество, ТекстСообщения)
	
	НайденныйЭлемент = Справочники.ВариантыКомплектацииНоменклатуры.НайтиПоНаименованию(СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация.Наименование);
	
	Если Не НайденныйЭлемент = Неопределено Тогда
		ТЗ_УпаковочныйЛистЭталонКомплектация = Новый ТаблицаЗначений;
		ТЗ_УпаковочныйЛистЭталонКомплектация = НайденныйЭлемент.Товары.Выгрузить();
		ТЗ_УпаковочныйЛистЭталонКомплектация.Свернуть("Номенклатура, Характеристика, КоличествоУпаковок");
	Иначе
		ОтказЗаписьУпаковочногоЛиста = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не возможно сравнить пересорт с эталоном комплектации, комплектация не найдена ""%1"" по ""%2"" для""%3""'"),
			СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация.Наименование, ОбъектЗаказ, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);

		ВозвратПродолжить = Истина;
		Возврат;
	КонецЕсли;
	
	// Выгрузка актуальных данных из упаковочного листа
	ТЗ_УпаковочныйЛист = Новый ТаблицаЗначений;
	ТЗ_УпаковочныйЛист = СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.Товары.Выгрузить();
	ТЗ_УпаковочныйЛист.Свернуть("Номенклатура, Характеристика, КоличествоУпаковок");
	
	// Знак "1" реальное количество в упаковочном листе, знак "0" эталонное количество по комплектации упаковочного листа
	РазницаТаблиц = РазницаТаблицЗначений(ТЗ_УпаковочныйЛистЭталонКомплектация, ТЗ_УпаковочныйЛист);
	
	ТЗСНоменклатуройИКоличествомДляКорректировки = Новый ТаблицаЗначений;
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("Номенклатура");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("Характеристика");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("ДобавитьКоличество");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("УбратьКоличество");
	
	НайтиСтрокиРазницаТаблиц = РазницаТаблиц.НайтиСтроки(Новый Структура("Знак", 1));
	
	Для Каждого СтрокаРазницаВНоменклатуре Из НайтиСтрокиРазницаТаблиц Цикл
		
		НайтиСтрокиЭталон = ТЗ_УпаковочныйЛистЭталонКомплектация.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",
			СтрокаРазницаВНоменклатуре.Номенклатура, СтрокаРазницаВНоменклатуре.Характеристика));
		
		Если Не НайтиСтрокиЭталон = Неопределено И НайтиСтрокиЭталон.Количество() = 1  Тогда
			
			Если НайтиСтрокиЭталон[0].КоличествоУпаковок = СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда
				УбратьКоличество = НайтиСтрокиЭталон[0].КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 				= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 				= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 			= 0;
				Стр.УбратьКоличество 			= УбратьКоличество;
				
			ИначеЕсли НайтиСтрокиЭталон[0].КоличествоУпаковок < СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда
				
				ДобавитьКоличество = СтрокаРазницаВНоменклатуре.КоличествоУпаковок - НайтиСтрокиЭталон[0].КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 				= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 				= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 			= ДобавитьКоличество;
				Стр.УбратьКоличество 			= 0;
				
			ИначеЕсли НайтиСтрокиЭталон[0].КоличествоУпаковок > СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда	
				
				УбратьКоличество = НайтиСтрокиЭталон[0].КоличествоУпаковок - СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 				= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 				= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 			= 0;
				Стр.УбратьКоличество 			= УбратьКоличество;
				
			КонецЕсли;
			
		Иначе
			
			// Добавление номенклатуры в заказ
			Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
			Стр.Номенклатура 					= СтрокаРазницаВНоменклатуре.Номенклатура;
			Стр.Характеристика 					= СтрокаРазницаВНоменклатуре.Характеристика;
			Стр.ДобавитьКоличество 				= СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
			Стр.УбратьКоличество 				= 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаРазница Из ТЗСНоменклатуройИКоличествомДляКорректировки Цикл
		
		НайтиСтроки_ВариантОбеспечения = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
		СтрокаРазница.Номенклатура, СтрокаРазница.Характеристика, СкидкаВКоробах, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
		
		Если Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
			
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];
			
			Если СтрокаРазница.ДобавитьКоличество > 0 Тогда
				
				ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
				
				ПараметрыРазбиенияСтроки = ПараметрыРазбиенияСтроки();
				Количество = СтрокаРазница.ДобавитьКоличество;
				
				ПараметрыОбработки = ПолучитьПараметрыОбработки(ТЗ_Новая_Заказ_Товары, ЭтаФорма, "", ПараметрыРазбиенияСтроки,
					ДополнительныеПараметры, Количество);
				
				ДобавитьСтрокуРазбиениемДобавитьКоличествоНеПолный(ПараметрыОбработки, СтрокаТовары, ТЗ_Заказ_Товары);
				
			ИначеЕсли СтрокаРазница.УбратьКоличество > 0 Тогда
				
				ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
				
				ПараметрыРазбиенияСтроки = ПараметрыРазбиенияСтроки();
				Количество = СтрокаРазница.УбратьКоличество;
				
				ПараметрыОбработки = ПолучитьПараметрыОбработки(ТЗ_Новая_Заказ_Товары, ЭтаФорма, "", ПараметрыРазбиенияСтроки,
					ДополнительныеПараметры, Количество);
				
				ДобавитьСтрокуРазбиениемУбратьКоличествоНеПолный(ПараметрыОбработки, СтрокаТовары, ТЗ_Заказ_Товары, ОтказЗаписьУпаковочногоЛиста);
							
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКомплектацияРазбиение Из ТабКомплектация Цикл
		
		НайтиСтроки_ВариантОбеспечения = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
		СтрокаКомплектацияРазбиение.Номенклатура, СтрокаКомплектацияРазбиение.Характеристика, СкидкаВКоробах,
			Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
		
		Если НайтиСтроки_ВариантОбеспечения.Количество() > 1 Тогда
			// Когда получено несколько строк, то тип проверяется в функции "ПолучитьПараметрыОбработки()"
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения;
		ИначеЕсли Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];
		Иначе
			ОтказЗаписьУпаковочногоЛиста = Истина;
			// Ситуация когда в табличной части заказа позиции номенклатуры отменены или отсутствуют
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В заказе ""%1"" отсутствуют неотгруженные позиции по ""%2""'"), ОбъектЗаказ,
				СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
			Прервать;
		КонецЕсли;
		
		ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
		
		ПараметрыРазбиенияСтроки = ПараметрыРазбиенияСтроки();
		
		Количество = СтрокаКомплектацияРазбиение.Количество;
		
		ПараметрыОбработки = ПолучитьПараметрыОбработки(ТЗ_Новая_Заказ_Товары, ЭтаФорма, "", ПараметрыРазбиенияСтроки,
								ДополнительныеПараметры, Количество);
		// проверить, обратно код из процедуры вынести сюда
		ДобавитьСтрокуРазбиениемНеПолный(ПараметрыОбработки, ТЗ_Новая_Заказ_Товары, СтрокаТовары, ТЗ_Заказ_Товары,
			ОтказЗаписьУпаковочногоЛиста, СписокКодовСтрокиПоУпаковочнымЛистам,
			СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист, СтруктураПереданныхДанных);
		
		// Вывод сообщения в процедуре уровнем выше
		Если ОтказЗаписьУпаковочногоЛиста Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не достаточно остатков в ""%1"" по ""%2""'"), ОбъектЗаказ, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТоваровВКоробахНеполныйИПересорт(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары,
	СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,
	ТЗ_Новая_Заказ_ТоварыВКоробах, ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах, ТабКомплектация,
	СписокКодовСтрокиПоУпаковочнымЛистам, СкидкаВКоробах, Количество, ТекстСообщения)
	
	НайденныйЭлемент = Справочники.ВариантыКомплектацииНоменклатуры.НайтиПоНаименованию(СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация.Наименование);
	
	Если Не НайденныйЭлемент = Неопределено Тогда
		ТЗ_УпаковочныйЛистЭталонКомплектация = Новый ТаблицаЗначений;
		ТЗ_УпаковочныйЛистЭталонКомплектация = НайденныйЭлемент.Товары.Выгрузить();
		ТЗ_УпаковочныйЛистЭталонКомплектация.Свернуть("Номенклатура, Характеристика, КоличествоУпаковок");
	Иначе
		ОтказЗаписьУпаковочногоЛиста = Истина;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не возможно сравнить пересорт с эталоном комплектации, комплектация не найдена ""%1"" по ""%2"" для""%3""'"),
			СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.гф_Комплектация.Наименование, ОбъектЗаказ, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
		ВозвратПродолжить = Истина;
		Возврат;
	КонецЕсли;
	
	// Выгрузка актуальных данных из упаковочного листа
	ТЗ_УпаковочныйЛист = Новый ТаблицаЗначений;
	ТЗ_УпаковочныйЛист = СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист.Товары.Выгрузить();
	ТЗ_УпаковочныйЛист.Свернуть("Номенклатура, Характеристика, КоличествоУпаковок");
	
	РазницаТаблиц = РазницаТаблицЗначений(ТЗ_УпаковочныйЛистЭталонКомплектация, ТЗ_УпаковочныйЛист);
	
	ТЗСНоменклатуройИКоличествомДляКорректировки = Новый ТаблицаЗначений;
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("Номенклатура");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("Характеристика");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("ДобавитьКоличество");
	ТЗСНоменклатуройИКоличествомДляКорректировки.Колонки.Добавить("УбратьКоличество");
	
	НайтиСтрокиРазницаТаблиц = РазницаТаблиц.НайтиСтроки(Новый Структура("Знак", 1));
	
	Для Каждого СтрокаРазницаВНоменклатуре Из НайтиСтрокиРазницаТаблиц Цикл
		
		НайтиСтрокиЭталон = ТЗ_УпаковочныйЛистЭталонКомплектация.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",
			СтрокаРазницаВНоменклатуре.Номенклатура, СтрокаРазницаВНоменклатуре.Характеристика));
		
		Если Не НайтиСтрокиЭталон = Неопределено И НайтиСтрокиЭталон.Количество() = 1  Тогда
			
			Если НайтиСтрокиЭталон[0].КоличествоУпаковок < СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда
				
				ДобавитьКоличество = СтрокаРазницаВНоменклатуре.КоличествоУпаковок - НайтиСтрокиЭталон[0].КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура = СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика = СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество = ДобавитьКоличество;
				Стр.УбратьКоличество = 0;
				
			ИначеЕсли НайтиСтрокиЭталон[0].КоличествоУпаковок > СтрокаРазницаВНоменклатуре.КоличествоУпаковок Тогда	
				
				УбратьКоличество = НайтиСтрокиЭталон[0].КоличествоУпаковок - СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура = СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика = СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество = 0;
				Стр.УбратьКоличество = УбратьКоличество;
				
			КонецЕсли;
			
		Иначе
			
			// Добавление Номенклатуры в заказ
			Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
			Стр.Номенклатура = СтрокаРазницаВНоменклатуре.Номенклатура;
			Стр.Характеристика = СтрокаРазницаВНоменклатуре.Характеристика;
			Стр.ДобавитьКоличество = СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
			Стр.УбратьКоличество = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НайтиСтрокиРазницаТаблиц2 = РазницаТаблиц.НайтиСтроки(Новый Структура("Знак", 0));
	
	// Обработка отсутствующей номенклатуры в Упаковочном листе по сравнению с эталоном
	Для Каждого СтрокаРазницаВНоменклатуре Из НайтиСтрокиРазницаТаблиц2 Цикл
		
		НайтиСтрокиЭталон = ТЗ_УпаковочныйЛист.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрокаРазницаВНоменклатуре.Номенклатура,
			СтрокаРазницаВНоменклатуре.Характеристика));
		
		Если Не НайтиСтрокиЭталон = Неопределено И НайтиСтрокиЭталон.Количество() = 0  Тогда
			
			Найдена = Ложь;
			
			Для Каждого Строк Из ТЗ_УпаковочныйЛист Цикл
				
				Если СтрокаРазницаВНоменклатуре.Характеристика = Строк.Характеристика Тогда
					
					Найдена = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не Найдена Тогда
				
				УбратьКоличество = СтрокаРазницаВНоменклатуре.КоличествоУпаковок;
				
				Стр = ТЗСНоменклатуройИКоличествомДляКорректировки.Добавить();
				Стр.Номенклатура 				= СтрокаРазницаВНоменклатуре.Номенклатура;
				Стр.Характеристика 				= СтрокаРазницаВНоменклатуре.Характеристика;
				Стр.ДобавитьКоличество 			= 0;
				Стр.УбратьКоличество 			= УбратьКоличество;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаРазница Из ТЗСНоменклатуройИКоличествомДляКорректировки Цикл
		
		НайтиСтроки_ВариантОбеспечения = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
			СтрокаРазница.Номенклатура, СтрокаРазница.Характеристика, СкидкаВКоробах, Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
		
		Если Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
			
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];
			
			Если СтрокаРазница.ДобавитьКоличество > 0 Тогда
				
				НоваяСтрока = ТЗ_Заказ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
				
				НоваяСтрока.КоличествоУпаковок 		= СтрокаРазница.ДобавитьКоличество;
				НоваяСтрока.ДатаОтгрузки 			= ТекущаяДата();
				НоваяСтрока.гф_ДобавленоПоПричине 	= Истина;
				
				НоваяСтрока.гф_ПричинаДобавления 	= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
				
				ПолучитьМаксНомерСтроки(ТЗ_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
								
				ДополнительныеПараметры = ПолучитьДополнительныеПараметрыПересорт(СтрокаТовары);
				
				СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
				
				СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
				
				// Берем итоговое количество, так как сумма складывается в строке заказа из этого количества
				// а нам нужно получить из этой суммы сумму по количесву в новой строке
				СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + СтрокаТовары[СтруктураПересчетаСуммы.ИмяПоляКоличество];
				
				// Получаем новые суммы по новому количеству, находим их по коэффициенту из количество и суммы в строке заказа
				ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
				
				// После пересчета выше,должно срабатывать нормально получение количества из количества упаковок, но пока на всякий случай
				// НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок;
				
			ИначеЕсли СтрокаРазница.УбратьКоличество > 0 Тогда
				
				Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
					ПроверкаОтказ = Истина;
					Возврат;
				КонецЕсли;
				
				УбратьКоличество = СтрокаРазница.УбратьКоличество;
				
				ДополнительныеПараметры = ПолучитьДополнительныеПараметрыПересорт(СтрокаТовары);
				
				Если СтрокаТовары.КоличествоУпаковок > УбратьКоличество Тогда
					
					НоваяСтрока = ТЗ_Заказ_Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
					
					НоваяСтрока.КоличествоУпаковок 	= УбратьКоличество;
					НоваяСтрока.Отменено 			= Истина;
					НоваяСтрока.ПричинаОтмены 		= Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
						
					СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок - УбратьКоличество;
					
					ПолучитьМаксНомерСтроки(ТЗ_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
					
					СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
					
					СтруктураПересчетаСуммы.Строки.Добавить(СтрокаТовары);
					СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + СтрокаТовары[СтруктураПересчетаСуммы.ИмяПоляКоличество];
					
					СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
					СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество + НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
					
					ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
					
				ИначеЕсли СтрокаТовары.КоличествоУпаковок = Количество Тогда
					
					СтрокаТовары.Отменено = Истина;
					
					СтрокаТовары.ПричинаОтмены = Справочники.ПричиныОтменыЗаказовКлиентов.гф_ФактическоеРасхождениеНаСкладе;
						
				Иначе
					
					ПроверкаОтказ = Истина;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаКомплектацияРазбиение Из ТабКомплектация Цикл
		
		НайтиСтроки_ВариантОбеспечения = ТЗ_Заказ_Товары.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, ПроцентРучнойСкидки, ВариантОбеспечения, Отменено",
			СтрокаКомплектацияРазбиение.Номенклатура, СтрокаКомплектацияРазбиение.Характеристика, СкидкаВКоробах,
			Перечисления.ВариантыОбеспечения.КОбеспечению, Ложь));
		
		Если Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 1 Тогда
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения;
		ИначеЕсли Не НайтиСтроки_ВариантОбеспечения = Неопределено И НайтиСтроки_ВариантОбеспечения.Количество() > 0 Тогда
			СтрокаТовары = НайтиСтроки_ВариантОбеспечения[0];
		КонецЕсли;
		
		ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
		
		Количество = СтрокаКомплектацияРазбиение.Количество;
		
		// Когда найдено несколько записей в заказе, пробуем отгружать количество по одной строке или частям по каждой,
		// что бы в сумме отгрузка сравнялось по количеству
		Если Не ТипЗнч(СтрокаТовары) = Тип("Массив") Тогда
			
			Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
				ПроверкаОтказ = Истина;
				Возврат;
			КонецЕсли;
			
			Если СтрокаТовары.КоличествоУпаковок > Количество Тогда
				
				// Записываем в отдельную таблицу, в основной не находились строки которые уже в цикле отгрузили по количеству
				НоваяСтрока = ТЗ_Новая_Заказ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
				
				НоваяСтрока.КоличествоУпаковок 	= Количество;
				НоваяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
				НоваяСтрока.ДатаОтгрузки 		= ТекущаяДата();
				
				СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок - Количество;
				
				ПолучитьМаксНомерСтроки(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
				
				ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
					НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
					
				ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
					НоваяСтрока, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);	
				
				
				СтруктураПересчетаСуммы = ДополнительныеПараметры.СтруктураПересчетаСуммы;
				
				СтруктураПересчетаСуммы.Строки.Добавить(СтрокаТовары);
				СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество
															+ СтрокаТовары[СтруктураПересчетаСуммы.ИмяПоляКоличество];
				
				СтруктураПересчетаСуммы.Строки.Добавить(НоваяСтрока);
				СтруктураПересчетаСуммы.ИтогКоличество = СтруктураПересчетаСуммы.ИтогКоличество
															+ НоваяСтрока[СтруктураПересчетаСуммы.ИмяПоляКоличество];
				
				ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
				
			ИначеЕсли СтрокаТовары.КоличествоУпаковок = Количество Тогда
				
				СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				СтрокаТовары.ДатаОтгрузки = ТекущаяДата();
				
				ПолучитьКомментарийИСкидкиДляРТУ(СтрокаТовары.гф_КомментарийРТУ, СтрокаТовары.гф_СкидкаДляРТУ, СтрокаТовары.гф_ДатаДляРТУ,
					СтрокаТовары.ПроцентРучнойСкидки, СтруктураПереданныхДанных, СтрокаТовары.гф_ПрайсЛистДляРТУ);
					
				ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
					СтрокаТовары, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
				
			Иначе
				
				ПроверкаОтказ = Истина;
				Возврат;
				
			КонецЕсли;	
			
		Иначе
			
			КоличествоОбщееНоменклатуры = 0;
			
			// Когда найдено несколько строк в которых возможно по количеству отгрузить номенклатуру из упаковочного листа
			// Перебираем каждую строку и смотрим общее количество в этих строках
			Для Каждого ЭлементМассива Из СтрокаТовары Цикл
				
				КоличествоОбщееНоменклатуры = КоличествоОбщееНоменклатуры + ЭлементМассива.КоличествоУпаковок;
				
			КонецЦикла;
			
			Если КоличествоОбщееНоменклатуры > Количество Тогда
				
				ДополнительноТребуетсяОтгрузитьКоличество = 0;
				
				// Сначала отгрузим ту номенклатуру, которая была добавлена плюсам из_за пересорта, а что останетсу отгрузим которая уже была в заказе
				// то это количество пробуем отгрузить по количеству которое уже было в заказе до добавления пересорта
				// Для этого используем переменную "ДополнительноТребуетсяОтгрузитьКоличество", фиксируя остаток количества
				Для Каждого ЭлементМассива Из СтрокаТовары Цикл
					
					Если ЭлементМассива.гф_ДобавленоПоПричине Тогда
						
						Если ЭлементМассива.КоличествоУпаковок = Количество Тогда
							
							ЭлементМассива.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
							ЭлементМассива.ДатаОтгрузки = ТекущаяДата();
							
							ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
								ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
							ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
								ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);	
								
							Прервать;
							
						ИначеЕсли ЭлементМассива.КоличествоУпаковок > Количество Тогда
							
							// Данная ситуация исключена, так как подобная номенклатура добавляемая по причине, добавляется в том количестве,
							// которое необходимо для списания с учетом уже существующего количества в заказе
							ПроверкаОтказ = Истина;
							ТекстСообщения = НСтр("ru = 'Частный случай добавления номенклатуры в количестве превышающим требуемое, необходимо обратиться к администратору!""!'");
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
							
							Возврат;
							
						ИначеЕсли Не ЭлементМассива.КоличествоУпаковок = 0 И ЭлементМассива.КоличествоУпаковок < Количество Тогда
							
							ЭлементМассива.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
							ЭлементМассива.ДатаОтгрузки = ТекущаяДата();
							
							ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
								ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);

							
							ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
								ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
							
							ДополнительноТребуетсяОтгрузитьКоличество = Количество - ЭлементМассива.КоличествоУпаковок;
							
						Иначе
							ПроверкаОтказ = Истина;
							Возврат;
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла;
				
				Если ДополнительноТребуетсяОтгрузитьКоличество Тогда
					
					Для Каждого ЭлементМассива Из СтрокаТовары Цикл
						
						Количество = ДополнительноТребуетсяОтгрузитьКоличество;
						Если Не ЭлементМассива.гф_ДобавленоПоПричине Тогда
							
							Если ЭлементМассива.КоличествоУпаковок = Количество Тогда
								ЭлементМассива.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
								ЭлементМассива.ДатаОтгрузки = ТекущаяДата();
								
								ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
									ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
								
								ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
									ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
								
								Прервать;
								
							ИначеЕсли ЭлементМассива.КоличествоУпаковок > Количество Тогда
								
								НоваяСтрока  = ТЗ_Новая_Заказ_Товары.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
								
								НоваяСтрока.КоличествоУпаковок = Количество;
								
								ЭлементМассива.КоличествоУпаковок = ЭлементМассива.КоличествоУпаковок - Количество;
								
								// Важно заполнять Количество, в типовой процедуре, откуда взят этот код, отсутвует параметр для заполнения количества,
								// только для КоличествоУпаковок
								
								НоваяСтрока.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
								НоваяСтрока.ДатаОтгрузки 		= ТекущаяДата();
								
								ПолучитьМаксНомерСтроки(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
								
								ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
									НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
								
								ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
									НоваяСтрока, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
								
								ДополнительныеПараметры = ПолучитьДополнительныеПараметры(ЭлементМассива, Ложь);
								
								РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ЭлементМассива);
								
							ИначеЕсли Не ЭлементМассива.КоличествоУпаковок = 0 И Количество > 0 И ЭлементМассива.КоличествоУпаковок < Количество Тогда
								// Пробуем отгрузить еще часть по количеству, возможно в следующей итерации цикла еще будет количество с которого
								// можно еще отгузить частично как здесть или же полностью но в условии выше
								
								ДополнительноТребуетсяОтгрузитьКоличество = Количество - ЭлементМассива.КоличествоУпаковок;
								
								ЭлементМассива.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.Отгрузить;
								ЭлементМассива.ДатаОтгрузки 		= ТекущаяДата();
								
								ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
									ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
								
								ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
									ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
								
							Иначе
								
								ПроверкаОтказ = Истина;
								Возврат;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли КоличествоОбщееНоменклатуры = Количество Тогда
				
				Для Каждого ЭлементМассива Из СтрокаТовары Цикл
					
					ЭлементМассива.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
					ЭлементМассива.ДатаОтгрузки = ТекущаяДата();
					
					ПолучитьКомментарийИСкидкиДляРТУ(ЭлементМассива.гф_КомментарийРТУ, ЭлементМассива.гф_СкидкаДляРТУ,
						ЭлементМассива.гф_ДатаДляРТУ, ЭлементМассива.ПроцентРучнойСкидки, СтруктураПереданныхДанных, ЭлементМассива.гф_ПрайсЛистДляРТУ);
					
					ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
						ЭлементМассива, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
					// Вроде как это лишнее здесь	
					// РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, ЭлементМассива);
					
				КонецЦикла;
				
			Иначе
				
				ПроверкаОтказ = Истина;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполненияТоваровВКоробахПолныйКомплект(Отказ, ВозвратПродолжить, ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары,
	СтрокаУпаковочныйЛистНоменклатура, СтруктураПереданныхДанных, ОтказЗаписьУпаковочногоЛиста, ОбъектЗаказ, ТЗ_Заказ_ТоварыВКоробах,
	ТЗ_Новая_Заказ_ТоварыВКоробах, ТЗ_ПричиныИзмененияТоварыВКоробах, ТЗ_Новая_Заказ_ПричиныИзмененияТоваровВКоробах,
	ТабКомплектация, СписокКодовСтрокиПоУпаковочнымЛистам, СкидкаВКоробах, Количество)

	Для Каждого СтрокаТовары Из ТЗ_Заказ_Товары Цикл
		
		Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			Продолжить;
		Иначе
			
			Для Каждого СтрокаКомплектацияРазбиение Из ТабКомплектация Цикл
				
				Если СтрокаКомплектацияРазбиение.Номенклатура = СтрокаТовары.Номенклатура
					И СтрокаКомплектацияРазбиение.Характеристика = СтрокаТовары.Характеристика
					И СкидкаВКоробах = СтрокаТовары.ПроцентРучнойСкидки
					// Есть заказы в которых подобная номенклатура имеет и не имеет отметку отмены, добавлено условие этого
					И Не СтрокаТовары.Отменено Тогда
					
					Если СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
						ПроверкаОтказ = Истина;
						Возврат;
					КонецЕсли;
					
					ДополнительныеПараметры = ПолучитьДополнительныеПараметры(СтрокаТовары, Ложь);
					
					ПараметрыРазбиенияСтроки = ПараметрыРазбиенияСтроки();
					
					Количество = СтрокаКомплектацияРазбиение.Количество;
					
					Если СтрокаТовары.КоличествоУпаковок > Количество Тогда
						
						НоваяСтрока = ТЗ_Новая_Заказ_Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
						
						НоваяСтрока.КоличествоУпаковок = Количество;
						
						СтрокаТовары.КоличествоУпаковок = СтрокаТовары.КоличествоУпаковок - Количество;
						
						НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
						НоваяСтрока.ДатаОтгрузки = ТекущаяДата();
						
						ПолучитьМаксНомерСтроки(ТЗ_Новая_Заказ_Товары, ТЗ_Заказ_Товары, НоваяСтрока);
						
						ПолучитьКомментарийИСкидкиДляРТУ(НоваяСтрока.гф_КомментарийРТУ, НоваяСтрока.гф_СкидкаДляРТУ, НоваяСтрока.гф_ДатаДляРТУ,
							НоваяСтрока.ПроцентРучнойСкидки, СтруктураПереданныхДанных, НоваяСтрока.гф_ПрайсЛистДляРТУ);
							
						ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
							НоваяСтрока, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
						
						// Если Неопределено то скидка в ордер идет из упаковочного листа иначе для номенклатуры запишем
						СкидкаДляРТУДляЗаписьВОрдер = НоваяСтрока.гф_СкидкаДляРТУ;
						ПрайсЛистДляРТУДляЗаписьВОрдер = НоваяСтрока.гф_ПрайсЛистДляРТУ;
						
						РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры, СтрокаТовары, Ложь);
						
					ИначеЕсли СтрокаТовары.КоличествоУпаковок = Количество Тогда
						
						СтрокаТовары.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
						СтрокаТовары.ДатаОтгрузки = ТекущаяДата();
						
						ПолучитьКомментарийИСкидкиДляРТУ(СтрокаТовары.гф_КомментарийРТУ, СтрокаТовары.гф_СкидкаДляРТУ, СтрокаТовары.гф_ДатаДляРТУ,
							СтрокаТовары.ПроцентРучнойСкидки, СтруктураПереданныхДанных, СтрокаТовары.гф_ПрайсЛистДляРТУ);
						
						ЗаполнитьЗначениеКодовСтрокиДляТоваровВКоробах(Объект.ТоварыВКоробках, СписокКодовСтрокиПоУпаковочнымЛистам,
							СтрокаТовары, СтрокаУпаковочныйЛистНоменклатура.УпаковочныйЛист);
						
						СкидкаДляРТУДляЗаписьВОрдер = СтрокаТовары.гф_СкидкаДляРТУ;
						ПрайсЛистДляРТУДляЗаписьВОрдер = СтрокаТовары.гф_ПрайсЛистДляРТУ;
						
					Иначе
						
						ПроверкаОтказ = Истина;
						Возврат;
						
					КонецЕсли;	
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещениеТоваров()
	
	ЗаказСПеремещением = Истина;
	
	Если ЗаказСПеремещением Тогда
		ОтгрузитьПродолжить();
	Иначе
		
		// Вроде не используется, так как все в общем модуле при изменении статуса Ордера
		Если ЗначениеЗаполнено(Объект.Склад) И Объект.ТоварыВКоробках Тогда
			СоздатьПеремещениеОбработкаДанныхТоварыВКоробках();
		Иначе
			СоздатьПеремещениеОбработкаДанныхТовары();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваров(Команда)
	
	СтруктураПараметров = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДействия", ЭтотОбъект, СтруктураПараметров);
	
	Отбор = Новый Структура();
	ПараметрыОткрытия = Новый Структура("Ключ", Отбор);
	
	Если ИмяФормы = "ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.Форма" Тогда
		ОткрытьФорму("ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.ФормаВыбораСкладаПеремещения", ПараметрыОткрытия,
			ЭтотОбъект, , , , Оповещение);
	Иначе
		ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаВыбораСкладаПеремещения", ПараметрыОткрытия,
			ЭтотОбъект, , , , Оповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПеремещениеОбработкаДанныхТовары()
	
	ТЗ_Заказы = ПолучитьОтмеченныеДанныеДереваЗначений();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПеремещениеОбработкаДанныхТоварыВКоробках()
	
	ТЗ_Заказы = ПолучитьОтмеченныеДанныеДереваЗначений();
	
	Для Каждого СтрокаЗаказы Из ТЗ_Заказы Цикл
		
		НачатьТранзакцию();
		
		Попытка
		
		НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
		
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Организация = СтрокаЗаказы.Организация;
		НовыйДокумент.СкладОтправитель = СтрокаЗаказы.Склад;
		НовыйДокумент.СкладПолучатель = СтрокаЗаказы.гф_СкладПолучатель;
		НовыйДокумент.Статус = Перечисления.СтатусыПеремещенийТоваров.Отгружено;
		НовыйДокумент.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		
		Для Каждого СтрокаУпаковочныйЛист Из СтрокаЗаказы.СписокУпаковочныйЛистИлиНоменклатура Цикл
			ОбъектУпаковочныйЛист = СтрокаУпаковочныйЛист.УпаковочныйЛист.ПолучитьОбъект();
			
			КоличествоПар = 0;
			
			Для Каждого Строка Из ОбъектУпаковочныйЛист.Товары Цикл
				Стр = НовыйДокумент.Товары.Добавить();
				Стр.Номенклатура 			= Строка.Номенклатура;
				Стр.Характеристика 			= Строка.Характеристика;
				Стр.Количество 				= Строка.Количество;
				Стр.КоличествоУпаковок 		= Строка.КоличествоУпаковок;
				Стр.НазначениеОтправителя 	= СтрокаЗаказы.Назначение;
				
				КоличествоПар = КоличествоПар + 1;
			КонецЦикла;
			
			Стр = НовыйДокумент.гф_ТоварыВКоробах.Добавить();
			Стр.УпаковочныйЛист 		= ОбъектУпаковочныйЛист.Ссылка;
			Стр.КоличествоПар 			= КоличествоПар;
			
		КонецЦикла;
		
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			КорректировкаНазначенияПроведен = Истина;
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьАктивнуюТранзакцию();
			КонецЕсли;
			
			КорректировкаНазначенияПроведен = Ложь;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'По заказу ""%1"" не удалось провести документ ""Перемещение товаров""'"),
				СтрокаЗаказы.Заказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
			
		КонецПопытки;
		
		Попытка
			Если ТранзакцияАктивна() Тогда
				ЗафиксироватьАктивнуюТранзакцию();
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Сформирован документ ""%1"". Внесены изменения в ""%2""'"), НовыйДокумент, ОбъектУпаковочныйЛист);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьАктивнуюТранзакцию();
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка фиксации транзакции снятия резерва по заказу ""%1"", поробуйте выполнить
			| операцию позднее. Возможно отсутствует доступ на формирование и изменение документов участвующих в снятии резерва'"), СтрокаЗаказы.Заказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтрокиДереваПомеченных(Команда)
	
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ДеревоДокументов");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтрокиДереваВыбораПомеченных(Команда)
	
	ВсеСтроки = Элементы.ДеревоДокументов;
	Для Каждого ДанныеСтроки Из ДеревоДокументов.ПолучитьЭлементы() Цикл
		ВсеСтроки.Свернуть(ДанныеСтроки.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтавкуНДС(СтавкаНДС)
	
	 Возврат СтавкаНДС.Ставка;
	  
КонецФункции

&НаКлиенте
Процедура УстановитьОрганизацию()
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		лОрганизация = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Склад, "гф_Организация");
		Объект.СкладОрганизация = лОрганизация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДокументовУпаковочныйЛистНомерОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение( ,ТекущийЭлемент.ТекущиеДанные.УпаковочныйЛистСсылка);
	
КонецПроцедуры
	
// ++ СадомцевСА 27.10.2022
// Обработчик завершения ввода данных для РТУ
// 
// Параметры:
// Результат - Массив
// ДополнительныеПараметры - Структура

&НаКлиенте
Процедура ДанныеДляРТУЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.СкидкиПоЗаказам.Очистить();
	Для Каждого ЭлементМассива Из Результат Цикл
		нс = Объект.СкидкиПоЗаказам.Добавить();
		ЗаполнитьЗначенияСвойств(нс, ЭлементМассива);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСкидки(Команда)
	ДополнительныеПараметры = Новый Структура();
	Оповещение = Новый ОписаниеОповещения("ДанныеДляРТУЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПараметрыФормы = ПолучитьПараметрыФормы();
	Если ИмяФормы = "ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.Форма" Тогда
		ОткрытьФорму("ВнешняяОбработка.гф_ОтгрузкаПоЗаказам3.Форма.ФормаДанныеДляРТУ", ПараметрыФормы,
		ЭтотОбъект, , , , Оповещение);
	Иначе
		ОткрытьФорму("Обработка.гф_ОтгрузкаПоЗаказам.Форма.ФормаДанныеДляРТУ", ПараметрыФормы,
		ЭтотОбъект, , , , Оповещение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормы()
	ПараметрыФормы = Новый Структура();
	
	ДеревоЗначений = РеквизитФормыВЗначение("ДеревоДокументов");
	ТаблицаЗначений = ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоЗначений);
	// Массив Заказы
	МассивЗаказы = Новый Массив;
	СезонныйЗаказ = Неопределено;
	Для Каждого СтрокаТЗ Из ТаблицаЗначений Цикл
		Если Не СтрокаТЗ.Отгрузить ИЛИ (СтрокаТЗ.КоличествоНоменклатуры = 0 И СтрокаТЗ.КоличествоОтгрузить = 0) Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьСезонныйЗаказ(СтрокаТЗ.Заказ, СезонныйЗаказ);
		флДобавитьЗаказ = ДобавитьЗаказ(СтрокаТЗ.Заказ, СезонныйЗаказ);
		Если флДобавитьЗаказ Тогда
			// ++ Окунев 17.01.2024   
			Сто = 100;
			
			СтрокаЗаказа = Новый Структура;  
			
			СтрокаЗаказа.Вставить("Заказ", СтрокаТЗ.Заказ); 
			Если РасчетЦен = 1 Тогда
				
				СтрокаЗаказа.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
				
			Иначе
				
				СтрокаЗаказа.Вставить("ВидЦены", Объект.ВидЦены);
				
			КонецЕсли;	
			
			Если СтрокаТЗ.КоличествоНоменклатуры Тогда // Товары в коробах 
				
				СтрокаЗаказа.Вставить("Количество",		СтрокаТЗ.КоличествоНоменклатуры);
				СтрокаЗаказа.Вставить("Цена",			СтрокаТЗ.Цена / ?(СТрокаТЗ.КоличествоНоменклатуры = 0 , 1, СтрокаТЗ.КоличествоНоменклатуры));   
				СтрокаЗаказа.Вставить("Номенклатура",	СтрокаТЗ.УпаковочныйЛистСсылка.Товары[0].Номенклатура);
				СтрокаЗаказа.Вставить("Скидка",			СтрокаТЗ.Скидка);
				// ++ Галфинд ВолковЕВ 04.03.2024 Вывод в Таблицу пользователя представление ставки НДС, а в расчете используется само числовое значение
				// ЦенаСоСкидкой = СтрокаТЗ.Цена * (Сто - СтрокаТЗ.Скидка) / Сто;               
				// Если ЦенаСоСкидкой = 0 Тогда
				//	ЦенаСоСкидкой = СтрокаТЗ.Стоимость;
				// КонецЕсли;	
				// СтрокаЗаказа.Вставить("СтавкаНДС",		Окр((СтрокаТЗ.Стоимость/ЦенаСоСкидкой - 1) * Сто));
				//
				// //СтрокаЗаказа.Цена = СтрокаЗаказа.Цена / (1 - ?(СтрокаЗаказа.Скидка = 100, 1, СтрокаЗаказа.Скидка/Сто));
				// -- Галфинд ВолковЕВ 04.03.2024
				СтрокаЗаказа.Вставить("СтавкаНДС",		Окр((СтрокаТЗ.Стоимость/СтрокаТЗ.Цена - 1) * Сто));
				
				СтрокаЗаказа.Цена = СтрокаЗаказа.Цена / (1 - ?(СтрокаЗаказа.Скидка = 100, 1, СтрокаЗаказа.Скидка/Сто));
				
			Иначе // Не в коробах
				
				СтрокаЗаказа.Вставить("Количество",		СтрокаТЗ.КоличествоОтгрузить);
				СтрокаЗаказа.Вставить("Цена",			СтрокаТЗ.Цена);
				СтрокаЗаказа.Вставить("Номенклатура",	СтрокаТЗ.Номенклатура);
				СтрокаЗаказа.Вставить("Скидка",			СтрокаТЗ.СкидкаИзЗаказа);
				// ++ Галфинд ВолковЕВ 04.03.2024 Вывод в Таблицу пользователя представление ставки НДС, а в расчете используется само числовое значение
				//СтрокаЗаказа.Вставить("СтавкаНДС",		ПолучитьСтавкуНДС(СтрокаТЗ.СтавкаНДС));
				СтрокаЗаказа.Вставить("СтавкаНДС",		СтрокаТЗ.СтавкаНДС);
				// -- Галфинд ВолковЕВ 04.03.2024
			КонецЕсли;	
			
			МассивЗаказы.Добавить(СтрокаЗаказа);  
			// -- Окунев 17.01.2024
		КонецЕсли;
	КонецЦикла;
	ПараметрыФормы.Вставить("МассивЗаказы", МассивЗаказы);
	
	// ТЗ Скидки по Заказам
	СкидкиПоЗаказам = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.СкидкиПоЗаказам Цикл
		Если МассивЗаказы.Найти(СтрокаТЧ.Заказ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СкидкаПоЗаказу = Новый Структура("Заказ, СкидкаДляРТУ");
		ЗаполнитьЗначенияСвойств(СкидкаПоЗаказу, СтрокаТЧ);
		СкидкиПоЗаказам.Добавить(СкидкаПоЗаказу);
	КонецЦикла;
	ПараметрыФормы.Вставить("СкидкиПоЗаказам", СкидкиПоЗаказам);
	
	ПараметрыФормы.Вставить("ПрименятьНаценки", Объект.ПрименятьНаценки);  
	ПараметрыФормы.Вставить("РасчетЦен", РасчетЦен);
	
	Возврат ПараметрыФормы;
КонецФункции

&НаСервереБезКонтекста
Функция ВыгрузитьДеревоЗначенийВТаблицуЗначений(Дерево, Таблица = Неопределено)
	
	Если Таблица = Неопределено Тогда
		Таблица = Новый ТаблицаЗначений;
		Для Каждого Колонка Из Дерево.Колонки Цикл
			Таблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
	КонецЕсли;
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), СтрокаДерева);
		ВыгрузитьДеревоЗначенийВТаблицуЗначений(СтрокаДерева, Таблица);
	КонецЦикла;
	Возврат Таблица;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСезонныйЗаказ(Заказ, СезонныйЗаказ)
	Если ЗначениеЗаполнено(Заказ) Тогда
		Если СезонныйЗаказ = Неопределено Тогда
			СезонныйЗаказ = Заказ.гф_СезонныйЗаказ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьЗаказ(Заказ, СезонныйЗаказ)
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СезонныйЗаказ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СезонныйЗаказ <> Заказ.гф_СезонныйЗаказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции
// -- Галфинд Окунев 2023.12.24

// ++ Галфинд Окунев 2023.12.24
// Пересчитывает общую скидку с учетом скидок, переданных в списке значений
// Написано исключительно для SonarQube
//
// Параметры:
//
// ОбщаяСкидка				- Число
// Скидки					- СписокЗначений
// МассивСтрокКомментария	- Массив 
// ЭтоНаценки				- Булево
//
&НаСервере
Процедура ПрименитьСкидкиКСтроке(ОбщаяСкидка, Скидки, МассивСтрокКомментария, ЭтоНаценки = Ложь)
	
	ЗначениеСто = 100;
	
	Для Каждого Элемент Из Скидки Цикл
		
		Если Элемент.Значение = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		Если ЭтоНаценки Тогда
			
			СкидкаКоэффициент = (ЗначениеСто + Элемент.Значение) / ЗначениеСто; 
			
		Иначе
			
			СкидкаКоэффициент = (ЗначениеСто - Элемент.Значение) / ЗначениеСто; 
			
		КонецЕсли;	
		
		ОбщаяСкидка = ОбщаяСкидка * СкидкаКоэффициент;
		
		Комментарий = СтрШаблон("%1 %2%%.", СокрЛП(Элемент.Представление), Элемент.Значение);
		
		МассивСтрокКомментария.Добавить(Комментарий);
		
	КонецЦикла;	
	
КонецПроцедуры                    

&НаСервере
Функция ПодготовитьПараметрыФормыНаСервере()
	ТЗ_Заказы = ПолучитьОтмеченныеДанныеДереваЗначений();
	ХЗ = Новый ХранилищеЗначения(ТЗ_Заказы);
	Возврат Новый Структура("ТЗ_Заказы", ХЗ);
КонецФункции

&НаКлиенте
Процедура ВыставитьСчета(Команда)
	ПараметрыФормы = ПодготовитьПараметрыФормыНаСервере();
	ОткрытьФорму("Обработка.гф_ВыставлениеСчетов.Форма", ПараметрыФормы);
КонецПроцедуры

// -- СадомцевСА 27.10.2022

// vvv Галфинд \ Sakovich 05.03.2024
&НаСервере
Функция ПолучитьЛимитыБлокировкиПоТипамЛимтов(Организация, Партнер, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК нпп_Лимиты,
	|	рсЛимиты.Период КАК Период,
	|	рсЛимиты.Партнер КАК Партнер,
	|	рсЛимиты.Организация КАК Организация,
	|	рсЛимиты.Статус КАК Статус,
	|	рсЛимиты.ВидЛимита КАК ВидЛимита,
	|	спрВидыЛимитов.ТипЛимита КАК ТипЛимита,
	|	рсЛимиты.Сумма КАК Сумма
	|ПОМЕСТИТЬ Лимиты
	|ИЗ
	|	РегистрСведений.гф_ЛимитыКонтрагентов.СрезПоследних(&Период, Партнер В (&Партнер)) КАК рсЛимиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_ВидыЛимитов КАК спрВидыЛимитов
	|		ПО (рсЛимиты.ВидЛимита = спрВидыЛимитов.Ссылка)
	|ГДЕ
	|	рсЛимиты.Статус.Активный = ИСТИНА
	|	И рсЛимиты.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АВТОНОМЕРЗАПИСИ() КАК нпп_Блокировки,
	|	рсБлокировки.Период КАК Период,
	|	рсБлокировки.Контрагент КАК Контрагент,
	|	рсБлокировки.Партнер КАК Партнер,
	|	рсБлокировки.Организация КАК Организация,
	|	рсБлокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	рсБлокировки.ВидБлокировки КАК ВидБлокировки,
	|	тчБлокируемыеТипы.ТипЛимита КАК ТипЛимита
	|ПОМЕСТИТЬ Блокировки
	|ИЗ
	|	РегистрСведений.гф_ПричиныБлокировок.СрезПоследних(&Период, Партнер В (&Партнер)) КАК рсБлокировки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гф_ВидыБлокировок.БлокируемыТипыЛимитов КАК тчБлокируемыеТипы
	|		ПО рсБлокировки.ВидБлокировки = тчБлокируемыеТипы.Ссылка
	|ГДЕ
	|	рсБлокировки.Заблокирован
	|	И тчБлокируемыеТипы.ТипЛимита ЕСТЬ НЕ NULL 
	|	И НЕ тчБлокируемыеТипы.ТипЛимита = ЗНАЧЕНИЕ(Перечисление.гф_ТипыЛимитов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лимиты.нпп_Лимиты КАК нпп_Лимиты,
	|	Лимиты.Период КАК Период,
	|	Лимиты.Партнер КАК Партнер,
	|	Лимиты.Организация КАК Организация,
	|	Лимиты.Статус КАК Статус,
	|	Лимиты.ТипЛимита КАК ТипЛимита,
	|	Лимиты.ВидЛимита КАК ВидЛимита,
	|	Лимиты.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт_БлокировкиПоПартнеру
	|ИЗ
	|	Лимиты КАК Лимиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Блокировки КАК Блокировки
	|		ПО Лимиты.Партнер = Блокировки.Партнер
	|			И Лимиты.ТипЛимита = Блокировки.ТипЛимита
	|			И (Блокировки.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|ГДЕ
	|	Блокировки.нпп_Блокировки ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лимиты.нпп_Лимиты КАК нпп_Лимиты,
	|	Лимиты.Период КАК Период,
	|	Лимиты.Партнер КАК Партнер,
	|	Лимиты.Организация КАК Организация,
	|	Лимиты.Статус КАК Статус,
	|	Лимиты.ТипЛимита КАК ТипЛимита,
	|	Лимиты.ВидЛимита КАК ВидЛимита,
	|	Лимиты.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт_БлокировкиПоПартнеруИОрганизации
	|ИЗ
	|	Лимиты КАК Лимиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Блокировки КАК Блокировки
	|		ПО Лимиты.Партнер = Блокировки.Партнер
	|			И Лимиты.Организация = Блокировки.Организация
	|			И Лимиты.ТипЛимита = Блокировки.ТипЛимита
	|			И (Блокировки.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|			И (НЕ Лимиты.нпп_Лимиты В
	|					(ВЫБРАТЬ
	|						т.нпп_Лимиты
	|					ИЗ
	|						вт_БлокировкиПоПартнеру КАК т))
	|ГДЕ
	|	Блокировки.нпп_Блокировки ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лимиты.нпп_Лимиты КАК нпп_Лимиты,
	|	Лимиты.Период КАК Период,
	|	Лимиты.Партнер КАК Партнер,
	|	Лимиты.Организация КАК Организация,
	|	Блокировки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Лимиты.Статус КАК Статус,
	|	Лимиты.ТипЛимита КАК ТипЛимита,
	|	Лимиты.ВидЛимита КАК ВидЛимита,
	|	Лимиты.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт_БлокировкиПоПартнеруИОрганизацииИДоговору
	|ИЗ
	|	Лимиты КАК Лимиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Блокировки КАК Блокировки
	|		ПО Лимиты.Партнер = Блокировки.Партнер
	|			И Лимиты.Организация = Блокировки.Организация
	|			И Лимиты.ТипЛимита = Блокировки.ТипЛимита
	|			И (НЕ Блокировки.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка))
	|			И (НЕ Лимиты.нпп_Лимиты В
	|					(ВЫБРАТЬ
	|						т.нпп_Лимиты
	|					ИЗ
	|						вт_БлокировкиПоПартнеру КАК т))
	|			И (НЕ Лимиты.нпп_Лимиты В
	|					(ВЫБРАТЬ
	|						т1.нпп_Лимиты
	|					ИЗ
	|						вт_БлокировкиПоПартнеруИОрганизации КАК т1))
	|ГДЕ
	|	Блокировки.нпп_Блокировки ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Лимиты.нпп_Лимиты КАК нпп_Лимиты,
	|	Лимиты.Период КАК Период,
	|	Лимиты.Партнер КАК Партнер,
	|	Лимиты.Организация КАК Организация,
	|	Лимиты.Статус КАК Статус,
	|	Лимиты.ТипЛимита КАК ТипЛимита,
	|	Лимиты.ВидЛимита КАК ВидЛимита,
	|	Лимиты.Сумма КАК Сумма
	|ПОМЕСТИТЬ вт_ЛимитыБезБлокировок
	|ИЗ
	|	Лимиты КАК Лимиты
	|ГДЕ
	|	НЕ Лимиты.нпп_Лимиты В
	|				(ВЫБРАТЬ
	|					т.нпп_Лимиты
	|				ИЗ
	|					вт_БлокировкиПоПартнеру КАК т)
	|	И НЕ Лимиты.нпп_Лимиты В
	|				(ВЫБРАТЬ
	|					т1.нпп_Лимиты
	|				ИЗ
	|					вт_БлокировкиПоПартнеруИОрганизации КАК т1)
	|	И НЕ Лимиты.нпп_Лимиты В
	|				(ВЫБРАТЬ
	|					т2.нпп_Лимиты
	|				ИЗ
	|					вт_БлокировкиПоПартнеруИОрганизацииИДоговору КАК т2)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЛимитыБезБлокировок.нпп_Лимиты КАК НомерЛимита,
	|	вт_ЛимитыБезБлокировок.Период КАК Период,
	|	вт_ЛимитыБезБлокировок.Партнер КАК Партнер,
	|	вт_ЛимитыБезБлокировок.Организация КАК Организация,
	|	вт_ЛимитыБезБлокировок.Статус КАК Статус,
	|	вт_ЛимитыБезБлокировок.ТипЛимита КАК ТипЛимита,
	|	вт_ЛимитыБезБлокировок.ВидЛимита КАК ВидЛимита,
	|	вт_ЛимитыБезБлокировок.Сумма КАК Сумма
	|ПОМЕСТИТЬ СвободныеЛимиты
	|ИЗ
	|	вт_ЛимитыБезБлокировок КАК вт_ЛимитыБезБлокировок
	|ГДЕ
	|	вт_ЛимитыБезБлокировок.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.нпп_Лимиты,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Период,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Партнер,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Организация,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Статус,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.ТипЛимита,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.ВидЛимита,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Сумма
	|ИЗ
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору КАК вт_БлокировкиПоПартнеруИОрганизацииИДоговору
	|ГДЕ
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Партнер КАК Партнер,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Организация КАК Организация,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.ДоговорКонтрагента КАК БлокировкаПоДоговору,
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору.Сумма КАК Сумма
	|ПОМЕСТИТЬ ДоговораИсключения
	|ИЗ
	|	вт_БлокировкиПоПартнеруИОрганизацииИДоговору КАК вт_БлокировкиПоПартнеруИОрганизацииИДоговору";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Период", Период);
	ПакетРезультатов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	Возврат ПакетРезультатов;
	
КонецФункции // ^^^ Галфинд \ Sakovich 05.03.2024

// -- СадомцевСА 27.10.2022

#КонецОбласти
