#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
   	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Пароль, "Пароль");
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
   	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "Пароль");
	
	УстановитьПривилегированныйРежим(Ложь);     
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура КомандаПроверитьДоступКТрекеруНаСервере(Ошибки)
	
	ТрекНомер = "ER000000000RU";
	
	ОтветОтСервера = гф_ПочтаРоссии.ПолучитьДанныеОтслеживанияСлужебный(Объект.Логин, Пароль, ТрекНомер, Ошибки); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьДоступКТрекеру(Команда)      
	
	Ошибки = Новый Массив;
	
	КомандаПроверитьДоступКТрекеруНаСервере(Ошибки);
	
	Если Ошибки.Количество() Тогда
		
		ПоказатьПредупреждение(, "Проверка доступа к трекеру завершилась неудачно. Проверьте логин и пароль.");
		
	Иначе
		
		ПоказатьПредупреждение(, "Проверка доступа к терекеру прошла успешно.");
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
