
&После("ПриЗаполненииОграниченияДоступа")
Процедура гф_ПриЗаполненииОграниченияДоступа(Ограничение)
	// #wortmann { 
	// Внесение изменений для ограничения чтения с производительным RLS
	// Галфинд_Домнышева 2022/11/11 
	//|Справочник.ГруппыДоступаНоменклатуры.Чтение.ГруппыНоменклатуры
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	| 	ЗначениеРазрешено(Ссылка)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Ссылка)";
	// } #wortmann
КонецПроцедуры

&Вместо("ВидимостьРеквизита")
Функция гф_ВидимостьРеквизита(Реквизит, ИмяРеквизита, РежимВидимостиПоказатьТолькоВажные, СтрокаНастройки)
	// vvv Галфинд \ Sakovich 17.08.2023
	Если ИмяРеквизита = "гф_РостовкаКороба" Тогда
		Возврат Истина;
	КонецЕсли;
	// ^^^ Галфинд \ Sakovich 17.08.2023
	Результат = ПродолжитьВызов(Реквизит, ИмяРеквизита, РежимВидимостиПоказатьТолькоВажные, СтрокаНастройки);
	Возврат Результат;
КонецФункции

