
Функция гф_СоздатьЗаказНаЭмиссиюКодовМаркировки(Основание, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("ОписаниеОшибки,"
	+ "ЗаказНаЭмиссиюКодовМаркировкиСУЗ,"
	+ "Организация,"
	+ "ЕстьОшибкиЗаполнения,"
	+ "Статус,"
	+ "ДальнейшееДействие,"
	+ "ЗаказКодовВозможен");

	Если Не ЗначениеЗаполнено(Основание) Тогда
		СтруктураВозврата["ОписаниеОшибки"] = "Не заполнено основание для создания ""Заказа на эмиссию кодов маркировки""";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ДокументОснование = Основание;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			СтруктураВозврата["ОписаниеОшибки"] = "Уже существует документ "
			+ Выборка["Ссылка"] + " с основанием " + Выборка["ДокументОснование"] + "
			|Документ ""Заказ на эмиссию кодов маркировки"" не создан.";
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		ЗаказНаМаркировку = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Организация");
		ЗаказНаМаркировку.Организация = Организация;
		ЗаказНаМаркировку.Дата = ТекущаяДатаСеанса();
		ЗаказНаМаркировку.Заполнить(ДокументОснование);
		Для каждого ТекущаяСтрока Из ЗаказНаМаркировку.Товары Цикл
			массивGNIN = ИнтеграцияИСМП.МассивЗначенийGTINДляВыбора(ТекущаяСтрока, ЗаказНаМаркировку, Ложь);
			Если ТипЗнч(массивGNIN) = Тип("Массив") И массивGNIN.ВГраница() > -1 Тогда
				ТекущаяСтрока["GTIN"] = массивGNIN[0];
			КонецЕсли;
		КонецЦикла;
		
		ЕстьОшибкиЗаполнения = ЗаказНаМаркировку.ПроверитьЗаполнение();
		Если ЕстьОшибкиЗаполнения Тогда
			
			СтруктураВозврата["ЕстьОшибкиЗаполнения"] = Истина;
			
		КонецЕсли;
		ЗаказНаМаркировку.Записать(РежимЗаписиДокумента.Проведение);
		
		СтруктураВозврата["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"] = ЗаказНаМаркировку.Ссылка;
		СтруктураВозврата["Организация"] = Организация;
		ЗаполнитьДальнейшиеДействияЭмиссии(ЗаказНаМаркировку, СтруктураВозврата);
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		ЗаказНаМаркировку = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Организация");
		ЗаказНаМаркировку.Организация = Организация;
		ЗаказНаМаркировку.Дата = ТекущаяДатаСеанса();
		ЗаказНаМаркировку.Заполнить(ДокументОснование);
		Товары = ЗаказНаМаркировку.Товары;
		Для каждого стрТч Из ДополнительныеПараметры["ВозвращаемыеТовары"] Цикл
			Если стрТч["гф_ЗаказатьКМ"] Тогда
				нс = Товары.Добавить();
				нс["Номенклатура"] = стрТч["Номенклатура"];
				нс["Характеристика"] = стрТч["Характеристика"];
				нс["Количество"] = стрТЧ["Количество"];
				нс["КоличествоУпаковок"] = стрТч["КоличествоУпаковок"];
				нс["Шаблон"] = Перечисления.ШаблоныКодовМаркировкиСУЗ.Обувь;
				нс["СпособФормированияСерийногоНомера"] = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Автоматически;
				нс["GTIN"] = ОпределитьГТИНПоРегиструШтрихкодыНоменклатуры(
				стрТч["Номенклатура"], стрТч["Характеристика"]);
				РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(стрТч["Номенклатура"], "Код, КодТНВЭД");
				нс["КодТНВЭД"] = РеквизитыНоменклатуры["КодТНВЭД"];
				нс["Код"] = РеквизитыНоменклатуры["Код"];
			КонецЕсли;
		КонецЦикла;
		
		ЕстьОшибкиЗаполнения = ЗаказНаМаркировку.ПроверитьЗаполнение();
		Если ЕстьОшибкиЗаполнения Тогда
			СтруктураВозврата["ЕстьОшибкиЗаполнения"] = Истина;
		КонецЕсли;
		ЗаказНаМаркировку.Записать(РежимЗаписиДокумента.Проведение);
		
		СтруктураВозврата["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"] = ЗаказНаМаркировку.Ссылка;
		СтруктураВозврата["Организация"] = Организация;
		ЗаполнитьДальнейшиеДействияЭмиссии(ЗаказНаМаркировку, СтруктураВозврата);
	КонецЕсли;

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		ЗаказНаМаркировку = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
		ЗаказНаМаркировку.ДокументОснование = Основание;
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Организация");
		ЗаказНаМаркировку.Организация = Организация;
		ЗаказНаМаркировку.Дата = ТекущаяДатаСеанса();
		ЗаказНаМаркировку.Заполнить(ДокументОснование);
		Товары = ЗаказНаМаркировку.Товары;
		Для каждого стрТч Из ДополнительныеПараметры["Товары"] Цикл
			нс = Товары.Добавить();
			нс["Номенклатура"] = стрТч["Номенклатура"];
			нс["Характеристика"] = стрТч["Характеристика"];
			нс["Количество"] = стрТЧ["Количество"];
			нс["КоличествоУпаковок"] = стрТч["КоличествоУпаковок"];
			нс["Шаблон"] = Перечисления.ШаблоныКодовМаркировкиСУЗ.Обувь;
			нс["СпособФормированияСерийногоНомера"] = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Автоматически;
			нс["GTIN"] = ОпределитьГТИНПоРегиструШтрихкодыНоменклатуры(
			стрТч["Номенклатура"], стрТч["Характеристика"]);
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(стрТч["Номенклатура"], "Код, КодТНВЭД");
			нс["КодТНВЭД"] = РеквизитыНоменклатуры["КодТНВЭД"];
			нс["Код"] = РеквизитыНоменклатуры["Код"];
		КонецЦикла;
		
		ЕстьОшибкиЗаполнения = ЗаказНаМаркировку.ПроверитьЗаполнение();
		Если ЕстьОшибкиЗаполнения Тогда
			СтруктураВозврата["ЕстьОшибкиЗаполнения"] = Истина;
		КонецЕсли;
		ЗаказНаМаркировку.Записать(РежимЗаписиДокумента.Проведение);
		
		СтруктураВозврата["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"] = ЗаказНаМаркировку.Ссылка;
		СтруктураВозврата["Организация"] = Организация;
		ЗаполнитьДальнейшиеДействияЭмиссии(ЗаказНаМаркировку, СтруктураВозврата);
	КонецЕсли;		
	
	Если ТипЗнч(Основание) = Тип("Структура")  Тогда
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Основание, "Источник")  = 
			"Обработка_гф_РабочееМестоКладовщика" Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода
			|ПОМЕСТИТЬ ЗначенияШтрихкодов
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			|ГДЕ
			|	ШтрихкодыУпаковокТоваров.Ссылка В(&КМ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию КАК ЗаказНаЭмиссию
			|ИЗ
			|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияШтрихкодов КАК Штрихкоды
			|		ПО ПулКодовМаркировкиСУЗ.КодМаркировки = Штрихкоды.ЗначениеШтрихкода");
			
			ТоварыУбрать = Основание["ТоварыУбрать"];
			МассивКМ = ТоварыУбрать.ВыгрузитьКолонку("КМ");
			Запрос.УстановитьПараметр("КМ", МассивКМ);
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				СтруктураВозврата["ОписаниеОшибки"] = 
				"Не найдено основание для создания ""Заказа на эмиссию кодов маркировки""";
				Возврат СтруктураВозврата;
			КонецЕсли;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ТоварыДобавить = Основание["ТоварыДобавить"];
			
			ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(0, 0, ДопустимыйЗнак.Любой));
			
			ТоварыДобавить.Колонки.Добавить("Количество", ОписаниеТипаЧисло);
			ТоварыДобавить.Колонки.Добавить("КоличествоУпаковок", ОписаниеТипаЧисло);
			ТоварыДобавить.ЗаполнитьЗначения(1, "Количество, КоличествоУпаковок");
			ТоварыДобавить.Свернуть("Номенклатура, Характеристика", "Количество, КоличествоУпаковок");
			
			ЗаказНаМаркировку = Выборка["ЗаказНаЭмиссию"].Скопировать();
			ЗаказНаМаркировку.СерийныеНомера.Очистить();
			ЗаказНаМаркировку.Товары.Очистить();
			ЗаказНаМаркировку.Дата = ТекущаяДатаСеанса();
			ЗаказНаМаркировку.Ответственный = Пользователи.АвторизованныйПользователь();
			
			Товары = ЗаказНаМаркировку.Товары;
			
			Для каждого СтрокаТЗ Из ТоварыДобавить Цикл
				нс = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЗ);
			КонецЦикла;
			
			//ЗаказНаМаркировку.Заполнить(Основание);
			Для каждого ТекущаяСтрока Из ЗаказНаМаркировку.Товары Цикл
				массивGNIN = ИнтеграцияИСМП.МассивЗначенийGTINДляВыбора(ТекущаяСтрока, ЗаказНаМаркировку, Ложь);
				Если ТипЗнч(массивGNIN) = Тип("Массив") И массивGNIN.ВГраница() > -1 Тогда
					ТекущаяСтрока["GTIN"] = массивGNIN[0];
				КонецЕсли;
				ТекущаяСтрока["СпособФормированияСерийногоНомера"] = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Автоматически;
			КонецЦикла;
			
			ЕстьОшибкиЗаполнения = ЗаказНаМаркировку.ПроверитьЗаполнение();
			Если ЕстьОшибкиЗаполнения Тогда
				СтруктураВозврата["ЕстьОшибкиЗаполнения"] = Истина;
			КонецЕсли;
			ЗаказНаМаркировку.Записать(РежимЗаписиДокумента.Проведение);
			
			СтруктураВозврата["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"] = ЗаказНаМаркировку.Ссылка;
			СтруктураВозврата["Организация"] = Организация;

			ЗаполнитьДальнейшиеДействияЭмиссии(ЗаказНаМаркировку, СтруктураВозврата);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗаполнитьДальнейшиеДействияЭмиссии(ЗаказНаМаркировку, СтруктураВозврата)

	МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЗаказНаМаркировку.Ссылка);
		Статус = МенеджерОбъекта.СтатусПоУмолчанию();
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбъектРасчета", ЗаказНаМаркировку);
		ДопустимыеДействия = МенеджерОбъекта.ДопустимыеДействия(ЗаказНаМаркировку);
		Если ЗначениеЗаполнено(ЗаказНаМаркировку.Ссылка) Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Статусы.Статус КАК Статус,
			|	ВЫБОР
			|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется)
			|		ИНАЧЕ Статусы.ДальнейшееДействие1
			|	КОНЕЦ КАК ДальнейшееДействие1,
			|	ВЫБОР
			|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется)
			|		ИНАЧЕ Статусы.ДальнейшееДействие2
			|	КОНЕЦ КАК ДальнейшееДействие2,
			|	ВЫБОР
			|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется)
			|		ИНАЧЕ Статусы.ДальнейшееДействие3
			|	КОНЕЦ КАК ДальнейшееДействие3
			|ИЗ
			|	РегистрСведений.СтатусыДокументовИСМП КАК Статусы
			|ГДЕ
			|	Статусы.Документ = &Документ");
			
			Запрос.УстановитьПараметр("Документ", ЗаказНаМаркировку.Ссылка);
			Запрос.УстановитьПараметр(
			"МассивДальнейшиеДействия", ИнтеграцияИСМП.НеотображаемыеВДокументахДальнейшиеДействия());
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Статус = Выборка.Статус;
				
				ДальнейшееДействие = Новый Массив;
				
				ДальнейшиеДействияРегистр = Новый Массив;
				ДальнейшиеДействияРегистр.Добавить(Выборка.ДальнейшееДействие1);
				ДальнейшиеДействияРегистр.Добавить(Выборка.ДальнейшееДействие2);
				ДальнейшиеДействияРегистр.Добавить(Выборка.ДальнейшееДействие3);
				
				Для Каждого ДальнейшееДействиеРегиср Из ДальнейшиеДействияРегистр Цикл
					
					ДобавляемоеДействие = ДальнейшееДействиеРегиср;
					Если ДопустимыеДействия.Найти(ДобавляемоеДействие) = Неопределено Тогда
						Если ДобавляемоеДействие =
							Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеGTINНаОстатки Тогда
							ДобавляемоеДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки;
						ИначеЕсли ДобавляемоеДействие =
							Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки Тогда
							ДобавляемоеДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеGTINНаОстатки;
						КонецЕсли;
					КонецЕсли;
					
					Если ДальнейшееДействие.Найти(ДобавляемоеДействие) = Неопределено Тогда
						ДальнейшееДействие.Добавить(ДобавляемоеДействие);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			ДальнейшееДействие = МенеджерОбъекта.ДальнейшееДействиеПоУмолчанию(СтруктураПараметров);
		КонецЕсли;
		
		СтруктураВозврата["Статус"] = Статус;
		Если ДальнейшееДействие.ВГраница() > -1  Тогда
			СтруктураВозврата["ДальнейшееДействие"] = ДальнейшееДействие[0];
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Черновик 
			И (ДальнейшееДействие.ВГраница() > -1 
			И ДальнейшееДействие[0] = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки)
			И (ДопустимыеДействия.ВГраница() > -1 
			И ДопустимыеДействия.Найти(Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки) <> Неопределено)  Тогда
			
			СтруктураВозврата["ЗаказКодовВозможен"] = Истина;
		КонецЕсли;

КонецПроцедуры

Функция СоздатьДокументМаркировкиТоваров(Товары, ЗаказНаЭмиссию, NVE) Экспорт
	
	мКМ = Товары.ВыгрузитьКолонку("КМ");

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Штрихкоды
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка В(&КМ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МаркировкаТоваровИСМПШтрихкодыУпаковок.Ссылка КАК ДокументМаркировки
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Штрихкоды КАК Штрихкоды
	|		ПО МаркировкаТоваровИСМПШтрихкодыУпаковок.ШтрихкодУпаковки = Штрихкоды.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВложенныйЗапрос.Склад КАК Склад
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА РасходныйОрдерНаТовары.Ссылка ЕСТЬ НЕ NULL 
	|				ТОГДА РасходныйОрдерНаТовары.Склад
	|			ИНАЧЕ NULL
	|		КОНЕЦ КАК Склад
	|	ИЗ
	|		Документ.УпаковочныйЛист КАК УпаковочныйЛист
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
	|			ПО УпаковочныйЛист.гф_Поставка = РасходныйОрдерНаТовары.Ссылка
	|	ГДЕ
	|		УпаковочныйЛист.Код = &NVE
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ПриобретениеТоваровУслуг.Ссылка ЕСТЬ НЕ NULL 
	|				ТОГДА ПриобретениеТоваровУслуг.Склад
	|			ИНАЧЕ NULL
	|		КОНЕЦ
	|	ИЗ
	|		Документ.УпаковочныйЛист КАК УпаковочныйЛист
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО УпаковочныйЛист.гф_Поставка = ПриобретениеТоваровУслуг.Ссылка
	|	ГДЕ
	|		УпаковочныйЛист.Код = &NVE) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Склад ЕСТЬ НЕ NULL
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ПулКодов.Номенклатура КАК Номенклатура,
	|	ПулКодов.Характеристика КАК Характеристика,
	|	ПулКодов.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ПулКодов.КодМаркировки КАК КодМаркировки
	|ИЗ
	|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодов
	|ГДЕ
	|	ПулКодов.ЗаказНаЭмиссию = &ЗаказНаЭмиссию");
	
	Запрос.УстановитьПараметр("КМ", мКМ);
	Запрос.УстановитьПараметр("NVE", NVE);
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказНаЭмиссию);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	РезультатДокументМаркировки = ПакетРезультатов[1];
	РезультатСклады = ПакетРезультатов[2];
	РезультатШтрихкоды = ПакетРезультатов[3];
	Если РезультатДокументМаркировки.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если РезультатШтрихкоды.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатДокументМаркировки.Выбрать();
	Выборка.Следующий();
	ДокументМаркировки = Выборка["ДокументМаркировки"].Скопировать();
	ДокументМаркировки.Дата = ТекущаяДатаСеанса();
	ДокументМаркировки.Ответственный = Пользователи.АвторизованныйПользователь();
	ДокументМаркировки.Товары.Очистить();
	ДокументМаркировки.ШтрихкодыУпаковок.Очистить();
	Если Не РезультатСклады.Пустой() Тогда
		ВыборкаСклады = РезультатСклады.Выбрать();
		ВыборкаСклады.Следующий();
		Если ЗначениеЗаполнено(ВыборкаСклады["Склад"]) Тогда
			ДокументМаркировки.ДополнительныеСвойства.Вставить("Склад", ВыборкаСклады["Склад"]);
		КонецЕсли;
	КонецЕсли;
	ВыборкаШтрихкоды = РезультатШтрихкоды.Выбрать();
	Пока ВыборкаШтрихкоды.Следующий() Цикл
		стрШтрихкоды = ДокументМаркировки.ШтрихкодыУпаковок.Добавить();
		стрШтрихкоды.ШтрихкодУпаковки = ВыборкаШтрихкоды["ШтрихкодУпаковки"];
		стрТовары = ДокументМаркировки.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(стрТовары, ВыборкаШтрихкоды);
		стрТовары["Количество"] = 1;
		стрТовары["КоличествоУпаковок"] = 1;
	КонецЦикла;
	
	ДокументМаркировки.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокументМаркировки.Ссылка;
	
КонецФункции

Функция ОпределитьГТИНПоРегиструШтрихкодыНоменклатуры(Номенклатура, Характеристика)
	
	Штрихкод = "";
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Характеристика = &Характеристика");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Штрихкод;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка["Штрихкод"];
	
КонецФункции // ()
