
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Закрыть(ТабДок);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбластьЗаголовок = ТабДок.Область(1,1,1,4);
	ОбластьЗаголовок.Шрифт = Новый Шрифт(ОбластьЗаголовок.Шрифт,,,Истина);
	ОбластьЗаголовок.ЦветФона = WebЦвета.Золотой;
	ОбластьЗаголовок.Защита = Истина;
	
	ОбластьЗаголовок = ТабДок.Область(1,1,1,1);
	ОбластьЗаголовок.Текст = "Артикул";

	ОбластьЗаголовок = ТабДок.Область(1,2,1,2);
	ОбластьЗаголовок.Текст = "Количество";

	ОбластьЗаголовок = ТабДок.Область(1,3,1,3);
	ОбластьЗаголовок.Текст = "НомерАдреса";

	ОбластьЗаголовок = ТабДок.Область(1,4,1,4);
	ОбластьЗаголовок.Текст = "НомерЗаказа";

КонецПроцедуры

