Функция СведенияОВнешнейОбработке() Экспорт   
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	ПараметрыРегистрации.Вид				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Наименование		= "гф_ЕженедельныйОтчетПоКоличествуЗаказов";
	ПараметрыРегистрации.Версия				= "1";
	ПараметрыРегистрации.БезопасныйРежим	= Истина;
	ПараметрыРегистрации.Информация			= "Еженедельный отчет по количеству заказов";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	
	НоваяКоманда.Использование			= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.Представление			= "Еженедельный отчет по количеству заказов";
	НоваяКоманда.Идентификатор			= "гф_ЕженедельныйОтчетПоКоличествуЗаказов";
	НоваяКоманда.ПоказыватьОповещение	= Истина;
	
    Возврат ПараметрыРегистрации;
	
КонецФункции
