#Область ОбработчикиСобытийЭлементовШапкиФормы

// #wortmann {
// Устанавливает значение Наименование исходя из значений Ростовки и Префикса 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=811fbcee7bda45d711ed1fa3e8e31966
// Галфинд_Домнышева 2022/08/22
//
// Параметры:
// Элемент - ПолеФормы.
//
// BSLLS:Typo-off
&НаКлиенте
Процедура РостовкаПриИзменении(Элемент)
// BSLLS:Typo-on
	Объект.Наименование = Строка(Объект.ПрефиксАртикула) + "(" + Строка(Объект.Ростовка) + ")";
КонецПроцедуры

#КонецОбласти