
&Вместо("ВыполнитьПакетЗапросов")
Функция гф_ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса, ВыгрузитьРезультат)
	// ++ Галфинд СадомцевСА 05.12.2023 Реализовал отбор документов РТУ
	// НЕ добавлять РТУ, у которых реквизит "Маркируемая продукция" ="Не выбывает из оборота".
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee92a2360bcf4a
	Для Каждого ТекстЗапроса ИЗ ТекстыЗапроса Цикл
		Если ТекстЗапроса.Представление = "ВыводИзОборотаИСМПОформите" Тогда
			ТекстЗапроса.Значение = ТекстЗапроса.Значение + "
			| И НЕ Статусы.Основание В(&МассивРТУ)";
			Запрос.УстановитьПараметр("МассивРТУ", гф_ПолучитьМассивРТУ());
		КонецЕсли;
	КонецЦикла;
	// -- Галфинд СадомцевСА 05.12.2023
	Результат = ПродолжитьВызов(Запрос, ТекстыЗапроса, ВыгрузитьРезультат);
	Возврат Результат;
КонецФункции

Функция гф_ПолучитьМассивРТУ() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|НЕ РеализацияТоваровУслуг.ВариантВыбытияМаркируемойПродукции В
	|(Значение(Перечисление.ВариантыВыбытияМаркируемойПродукции.ИспользованиеПокупателемДляСобственныхНужд),
	|Значение(Перечисление.ВариантыВыбытияМаркируемойПродукции.БезвозмезднаяПередачаПокупателю))";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	МассивРТУ = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассивРТУ;
КонецФункции

