

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	гф_СоздатьНовыеРеквизиты();
	
КонецПроцедуры

#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
////Код процедур и функций
//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы<ИмяТаблицыФормы>
////Код процедур и функций
//#КонецОбласти

//#Область ОбработчикиКомандФормы
////Код процедур и функций
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_СоздатьНовыеРеквизиты()
			
	ОписаниеТиповУпаковочныйЛист	= Новый ОписаниеТипов("ДокументСсылка.УпаковочныйЛист");
		
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитФормы_гф_IDКороба			= Новый РеквизитФормы("гф_IDКороба",
										ОписаниеТиповУпаковочныйЛист, , "ID короба", Истина);
    											
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_IDКороба);
			
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ТипПолеФормы = Тип("ПолеФормы");
		
	НовоеПоле = Элементы.Добавить("гф_IDКороба", ТипПолеФормы,
										Элементы.Товары);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.Товары.гф_IDКороба"; 
			
КонецПроцедуры	

#КонецОбласти