#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
// #wortmann {
// Добавление новых полей на форму	
// Галфинд Плотников 2022/09/14
	гф_ДобавитьНовыеРеквизиты();
// } #wortmann
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
// #wortmann {
// Добавление новых полей на форму	
// Галфинд Плотников 2022/09/14
Процедура гф_ДобавитьНовыеРеквизиты()
	
	ТипГруппаФормы						= Тип("ГруппаФормы");
	ТипПолеФормы						= Тип("ПолеФормы");
	КС									= Новый КвалификаторыСтроки(1024);

	ОписаниеТиповСтрока 				= Новый ОписаниеТипов("Строка", , КС);

	ОписаниеТиповАртикулАгрегата		= Новый ОписаниеТипов("СправочникСсылка.ВариантыКомплектацииНоменклатуры");
	ОписаниеТиповНомерГТД				= Новый ОписаниеТипов("СправочникСсылка.НомераГТД");
	ОписаниеТиповСтатус					= Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП");
	ОписаниеТиповАвтодействие			= Новый ОписаниеТипов("ПеречислениеСсылка.гф_АвтодействияКМ");
		
	НовыйЭлемент 						= ЭтотОбъект.Элементы.Добавить("гф_ГруппаДополнительно", ТипГруппаФормы);

	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаДополнительно, ЭтотОбъект.Элементы.ГруппаДанныеОНоменклатуре);

	НовыйЭлемент.Вид					= ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок				= "Дополнительно";
	НовыйЭлемент.ОтображатьЗаголовок	= Истина; 
	НовыйЭлемент.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыеРеквизиты = Новый Массив;
	
	РеквизитФормы_гф_АртикулАгрегата	= Новый РеквизитФормы("гф_АртикулАгрегата",
										ОписаниеТиповАртикулАгрегата, , "Артикул агрегата)", Истина);
  	РеквизитФормы_гф_НомерГТД			= Новый РеквизитФормы("гф_НомерГТД",
										ОписаниеТиповНомерГТД, , "Номер ГТД", Истина);	
	РеквизитФормы_гф_Статус				= Новый РеквизитФормы("гф_Статус",
										ОписаниеТиповСтатус, , "Статус ИС МП", Истина);	
  	РеквизитФормы_гф_Автодействие		= Новый РеквизитФормы("гф_Автодействие",
										ОписаниеТиповАвтодействие, , "Автодействие", Истина);	
	РеквизитФормы_гф_Комментарий		= Новый РеквизитФормы("гф_Комментарий",
										ОписаниеТиповСтрока, , "Комментарий)", Истина);	
										
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_АртикулАгрегата);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_НомерГТД);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_Статус);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_Автодействие);
	НовыеРеквизиты.Добавить(РеквизитФормы_гф_Комментарий);
	
	ИзменитьРеквизиты(НовыеРеквизиты);

	НовыйЭлемент 							= Элементы.Добавить("гф_АртикулАгрегата", ТипПолеФормы,
											Элементы.гф_ГруппаДополнительно);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 20;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_АртикулАгрегата";
									
	НовыйЭлемент 							= Элементы.Добавить("гф_НомерГТД", ТипПолеФормы,
											Элементы.гф_ГруппаДополнительно);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 20;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_НомерГТД";

	НовыйЭлемент 							= Элементы.Добавить("гф_Статус", ТипПолеФормы,
											Элементы.гф_ГруппаДополнительно);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 20;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_Статус";

	НовыйЭлемент 							= Элементы.Добавить("гф_Автодействие", ТипПолеФормы,
											Элементы.гф_ГруппаДополнительно);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Ширина						= 20;
	НовыйЭлемент.РастягиватьПоГоризонтали	= Ложь;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_Автодействие";
	
	НовыйЭлемент 							= Элементы.Добавить("гф_Комментарий", ТипПолеФормы,
											Элементы.гф_ГруппаДополнительно);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным				= "Объект.гф_Комментарий";
	
КонецПроцедуры	
// } #wortmann
	

#КонецОбласти  