
&Перед("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// #wortmann {
	// Галфинд_Домнышева_27_06_2023
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee14b4b760d601
	// У назначения "Холд (временно)" должно быть движение по складским регистрам.
	Если  Ссылка = ПредопределенноеЗначение("Справочник.Назначения.гф_Холд")
		И ДвиженияПоСкладскимРегистрам = Ложь Тогда
		  ДвиженияПоСкладскимРегистрам = Истина;
		  ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для назначения ""Холд (временно)"" должно быть движение по складским регистрам");  
	КонецЕсли;
	// } #wortmann 
КонецПроцедуры
