#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТипДокумента = Параметры.ТипДокумента;
	
	ВыбранныеПечатныеФормы.Загрузить(Параметры.ВыбранныеПечатныеФормы.Выгрузить());
	
	ЗаполнитьСписокВыбораПечатныхФорм();     
	
	Для Каждого Документ Из Параметры.МассивДокументов Цикл
		
		НоваяСтрока = ТаблицаДокументов.Добавить();
		
		НоваяСтрока.Документ = Документ;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти       

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПечатьНаСервере()
	
	
КонецПроцедуры


&НаКлиенте
Процедура Печать(Команда)
	
	Идентификаторы = "";
	
	Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
		
		Если ПечатнаяФорма.Пометка Тогда
			
			Идентификаторы = ?(Идентификаторы = "", ПечатнаяФорма.Значение, Идентификаторы + "," + ПечатнаяФорма.Значение);
			
		КонецЕсли;	
		
	КонецЦикла;	  

	ДокументыНаПечать = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		
		ДокументыНаПечать.Добавить(СтрокаТаблицы.Документ);
		
	КонецЦикла;	   
	
	ПараметрыПечати = УправлениеПечатьюКлиент.ПараметрыПечати();
	
	Если Команда.Имя = "ПечатьНаПринтер" Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер("Документ." + ТипДокумента, Идентификаторы, ДокументыНаПечать, ПараметрыПечати);
		
	Иначе	
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ." + ТипДокумента, Идентификаторы, ДокументыНаПечать, ЭтотОбъект, ПараметрыПечати);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораПечатныхФорм() 
	
	ПечатныеФормы.Очистить();
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда
		
		ОтборСтрок = Новый Структура;
		
		ОтборСтрок.Вставить("ТипДокумента", ТипДокумента);
		
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(Метаданные.Документы[ТипДокумента]);
		
		Для Каждого КомандаПечати Из КомандыПечати Цикл 
			
			Если Не ЗначениеЗаполнено(КомандаПечати.Обработчик) Тогда

				ОтборСтрок.Вставить("ПечатнаяФорма", КомандаПечати.Идентификатор);
	
				НайденныеСтроки = ВыбранныеПечатныеФормы.НайтиСтроки(ОтборСтрок);

				Пометка = НайденныеСтроки.Количество() > 0;
				
				ПечатныеФормы.Добавить(КомандаПечати.Идентификатор, КомандаПечати.Представление, Пометка);
				
			КонецЕсли;	
			
		КонецЦикла;	 
		
	КонецЕсли;	
	
КонецПроцедуры// } #wortmann

#КонецОбласти 
