#Область ОбработчикиСобытийФормы

// #wortmann {
// #
// Галфинд Окунев 2022/08/14
// Добавлена гиперссылка на форму списка 
// регистра гф_ОтслеживаемыеОригиналыПервичныхДокументов 
//
// Параметры:
//
// Отказ				- Булево
// СтандартнаяОбработка	- Булево
//
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)       
	
	Команда = Команды.Добавить("гф_ОтслеживаемыеОригиналыПервичныхДокументов");
	
	Команда.Действие = "гф_ОтслеживаемыеОригиналыПервичныхДокументов";
	
	Кнопка = Элементы.Добавить("гф_ОтслеживаемыеОригиналыПервичныхДокументов", 
								Тип("КнопкаФормы"), Элементы.ГруппаСостояниеОригиналовПервичныхДокументовНастройка);
								
	Кнопка.Вид					= ВидКнопкиФормы.Гиперссылка;								
	Кнопка.Заголовок			= "Отслеживаемые оригиналы первичных документов";
	Кнопка.ИмяКоманды			= "гф_ОтслеживаемыеОригиналыПервичныхДокументов";   
	Кнопка.ОтображениеПодсказки	= ОтображениеПодсказки.ОтображатьСнизу;
	
	Кнопка.РасширеннаяПодсказка.Заголовок = "Список отслеживаемых видов документов и их печатных форм. "
											+ "Если список не заполнен, отслеживаются все виды документов.";

КонецПроцедуры// } #wortmann

#КонецОбласти

#Область ОбработчикиКомандФормы

// #wortmann {
// #
// Галфинд Окунев 2022/08/14
// Открывает форму списка регистра гф_ОтслеживаемыеОригиналыПервичныхДокументов 
//
// Параметры:
//
// Команда	- КомандаФормы
//
&НаКлиенте
Процедура гф_ОтслеживаемыеОригиналыПервичныхДокументов(Команда)

	ОткрытьФорму("РегистрСведений.гф_ОтслеживаемыеОригиналыПервичныхДокументов.ФормаСписка");	
	
КонецПроцедуры

// #wortmann {
// #
// Галфинд Окунев 2022/08/14
// Устанавливает доступность элементов формы
//
// Параметры:
//
// РеквизитПутьКДанным	- Строка
//
&НаСервере
&После("УстановитьДоступность")
Процедура гф_УстановитьДоступность(РеквизитПутьКДанным)
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьУчетОригиналовПервичныхДокументов" ИЛИ РеквизитПутьКДанным = ""
		И ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов")
		И Элементы.Найти("гф_ОтслеживаемыеОригиналыПервичныхДокументов") <> Неопределено Тогда
		
		Элементы.гф_ОтслеживаемыеОригиналыПервичныхДокументов.Видимость = НаборКонстант.ИспользоватьУчетОригиналовПервичныхДокументов;
		
	КонецЕсли;
	
КонецПроцедуры// } #wortmann

#КонецОбласти

