&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//++ Плотников 22.07.22
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаШапкаЧетвертаяЛиния", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	Элементы.Переместить(ЭтотОбъект.Элементы.гф_ГруппаШапкаЧетвертаяЛиния, ЭтотОбъект.Элементы.ГруппаШапка);
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Штрихкод", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина=10;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Штрихкод";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ВесКороба", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина=5;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ВесКороба";

	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ОбъемКороба", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаШапкаЧетвертаяЛиния);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ТолькоПросмотр = Истина;
	НовыйЭлемент.Ширина=5;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ОбъемКороба";

//-- Плотников 22.07.22

	
КонецПроцедуры
