 #Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ Галфинд_Домнышева_30_06_2022
	НовыйЭлемент = Элементы.Вставить("Код", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.Код";
	НовыйЭлемент.Заголовок = "Код"; 
		
    НовыйЭлемент = Элементы.Вставить("гф_Номер", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_Номер";
	НовыйЭлемент.Заголовок = "Номер";

	Элементы.Переместить(ЭтотОбъект.Элементы.Наименование, Элементы.Список, 
						ЭтотОбъект.Элементы.Список.ПодчиненныеЭлементы.гф_Номер);
	
	НовыйЭлемент = Элементы.Вставить("гф_Год", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_Год";
	НовыйЭлемент.Заголовок = "Год";
	
	НовыйЭлемент = Элементы.Вставить("гф_ТехническийЛимит", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ТехническийЛимит";
	НовыйЭлемент.Заголовок = "Технический лимит";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаФормированияЗаказов", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаНачалаФормированияЗаказов";
	НовыйЭлемент.Заголовок = "Формирование заказов Начало"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияФормированияЗаказов", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаОкончанияФормированияЗаказов";
	НовыйЭлемент.Заголовок = "Формирование заказов Окончание"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаОтгрузкиЗаказов", Тип("ПолеФормы"), 
					Элементы.Список, ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаНачалаОтгрузкиЗаказов";
	НовыйЭлемент.Заголовок = "Отгрузка заказов Начало";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияОтгрузкиЗаказов", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаОкончанияОтгрузкиЗаказов";
	НовыйЭлемент.Заголовок = "Отгрузка заказов Окончание";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияРедактированияСкидок", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаОкончанияРедактированияСкидок";
	НовыйЭлемент.Заголовок = "Дата окончания редактирования скидок"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаИзготовления", Тип("ПолеФормы"), Элементы.Список, 
					ЭтотОбъект.Элементы.ДатаНачалаЗакупок);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.ПутьКДанным = "Список.гф_ДатаИзготовления";
	НовыйЭлемент.Заголовок = "Дата изготовления"; 
    // -- Галфинд_Домнышева_30_06_2022

КонецПроцедуры

#КонецОбласти