#Область СлужебныйПрограммныйИнтерфейс

// #wortmann {
// #4.2.03
// Добавляем вызов создания полей контрагента
// Галфинд Окунев 2022/07/05
// Параметры:
// КонтрагентОбъект - параметр процедуры ПередЗаписьюКонтрагентаПартнера модуля конфигурации
// Форма - параметр процедуры ПередЗаписьюКонтрагентаПартнера модуля конфигурации
&После("ПередЗаписьюКонтрагентаПартнера")
Процедура гф_ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, Форма) Экспорт
	
	КонтрагентОбъект.гф_Код					= Форма.гф_Код;
	КонтрагентОбъект.гф_ОсновнойКонтрагент	= Форма.гф_ОсновнойКонтрагент;
	КонтрагентОбъект.гф_Логистика			= Форма.гф_Логистика;
	КонтрагентОбъект.гф_RC_GLN_номер		= Форма.гф_RC_GLN_номер;
	КонтрагентОбъект.гф_Комментарий			= Форма.гф_Комментарий;
	КонтрагентОбъект.гф_Зарегистрирован		= Форма.гф_Зарегистрирован;
	
	КонтрагентОбъект.гф_АдресаДоставки.Загрузить(Форма.гф_АдресаДоставки.Выгрузить());
	
	КонтрагентОбъект.гф_ОтветственныйМенеджер.Загрузить(Форма.гф_ОтветственныйМенеджер.Выгрузить());
	
КонецПроцедуры// } #wortmann

#КонецОбласти