#Область СлужебныйПрограммныйИнтерфейс

// #wortmann {
// #4.2.03
// Добавляем вызов создания полей контрагента
// Галфинд Окунев 2022/07/05
// Параметры:
// КонтрагентОбъект - параметр процедуры ПередЗаписьюКонтрагентаПартнера модуля конфигурации
// Форма - параметр процедуры ПередЗаписьюКонтрагентаПартнера модуля конфигурации
&После("ПередЗаписьюКонтрагентаПартнера")
Процедура гф_ПередЗаписьюКонтрагентаПартнера(КонтрагентОбъект, Форма) Экспорт
	
	// #wortmann {
	// #4.2.03
	// удалил заполнение неиспользуемого реквизита гф_Код
	// Журавлев Чугуев 2022/07/12
	//КонтрагентОбъект.гф_Код					= Форма.гф_Код;
	// } #wortmann
	
	КонтрагентОбъект.гф_ОсновнойКонтрагент	= Форма.гф_ОсновнойКонтрагент;
	КонтрагентОбъект.гф_Логистика			= Форма.гф_Логистика;
	КонтрагентОбъект.гф_GLN_номер			= Форма.гф_GLN_номер;
	КонтрагентОбъект.гф_Комментарий			= Форма.гф_Комментарий;
	КонтрагентОбъект.гф_Зарегистрирован		= Форма.гф_Зарегистрирован;
	
	КонтрагентОбъект.гф_АдресаДоставки.Загрузить(Форма.гф_АдресаДоставки.Выгрузить());
	
	КонтрагентОбъект.гф_ОтветственныйМенеджер.Загрузить(Форма.гф_ОтветственныйМенеджер.Выгрузить());
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=811dbcee7bda45d711ed130ce78add5e
	// заполнение для реквизита гф_ОсновнойДоговорКонтрагента
	// Галфинд Домнышева 2022/08/04
	КонтрагентОбъект.гф_ОсновнойДоговорКонтрагента	= Форма.гф_ОсновнойДоговорКонтрагента;
	// } #wortmann
	
КонецПроцедуры// } #wortmann

#КонецОбласти