
&НаКлиенте
Процедура B2B_НастройкаB2BПосле(Команда)

	ОткрытьФорму("Обработка.ВыгрузкаБУС.Форма.ФормаУпр", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура B2B_НастройкиПосле(Команда)

	ОткрытьФорму("Справочник.B2B_w_Настройки.ФормаСписка", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура B2B_ИерархияКаталогаНаСайтеПосле(Команда)
	ОткрытьФорму("Справочник.B2B_Б_ПользовательскиеГруппыТоваров.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура B2B_СправочникТипыНоменклатурыУПППосле(Команда)
	ОткрытьФорму("Справочник.B2B_СЭ_ТипНоменклатуры.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура B2B_УППНоменклатураПосле(Команда)
	ОткрытьФорму("Справочник.B2B_СправочникНоменклатураУПП.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура B2B_ИдентификаторыСвойствНоменклатурыБитриксПосле(Команда)
	ОткрытьФорму("РегистрСведений.B2B_РИ_ИдентификаторыСвойствНоменклатурыБитрикс.ФормаСписка", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура гф_ПодстановкаОрганизацииПоНоменклатуреПосле(Команда)
	ОткрытьФорму("РегистрСведений.B2B_СоответствиеГруппДоступаНоменклатурыИОрганизаций.ФормаСписка", , ЭтаФорма);
КонецПроцедуры
