
&НаКлиенте
Процедура Назначить(Команда)
	СтруктураВозврата = Новый Структура("НазначениеПодтверждено, NVE", Ложь, ПодтверждаемыйNVE);
	Если ПодтверждаемыйNVE = ОбрабатываемыйNVE И ПодтверждаемыйNVE <> "" Тогда
		СтруктураВозврата["НазначениеПодтверждено"] = Истина;
	КонецЕсли;
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	СтруктураВозврата = Новый Структура("НазначениеПодтверждено, NVE", Ложь, ПодтверждаемыйNVE);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбрабатываемыйNVE = Параметры["ОбрабатываемыйNVE"]
КонецПроцедуры
