
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	парамОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамОрганизация"));
	Если парамОрганизация.Использование Тогда
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "Организация", парамОрганизация.Значение, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		КомпоновкаДанныхКлиентСервер.УдалитьОтбор(Настройки.Отбор, "Организация");
	КонецЕсли;
	
	парамКонтрагент = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамКонтрагент"));
	Если парамКонтрагент.Использование Тогда
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "Контрагент", парамКонтрагент.Значение, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		КомпоновкаДанныхКлиентСервер.УдалитьОтбор(Настройки.Отбор, "Контрагент");
	КонецЕсли;
	
	парамДоговор = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамДоговор"));
	Если парамДоговор.Использование Тогда
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "Договор", парамДоговор.Значение, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		КомпоновкаДанныхКлиентСервер.УдалитьОтбор(Настройки.Отбор, "Договор");
	КонецЕсли;
	
	парамСезон = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("парамСезон"));
	Если парамСезон.Использование Тогда
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "Сезон", парамСезон.Значение, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		КомпоновкаДанныхКлиентСервер.УдалитьОтбор(Настройки.Отбор, "Сезон");
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
КонецПроцедуры
