#Если Сервер ИЛИ ТолстыйКлиент Тогда

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	
	ПараметрыРегистрации.Версия = "1.4";
	
	ПараметрыРегистрации.Наименование =  Метаданные().Представление();
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Идентификатор = Метаданные().Имя;
    Команда.Представление = Метаданные().Представление();
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецЕсли