#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// ++ Галфинд_Домнышева_01_07_2022
	
	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
	ТипКнопкаФормы = Тип("КнопкаФормы");
	ТипТаблицаФормы = Тип("ТаблицаФормы");
	
	НовыйЭлемент = Элементы.Вставить("гф_СтраницаТипСкидки", ТипГруппаФормы, Элементы.ГруппаСтраницы, 
					Элементы.СтраницаУчетнаяИнформация);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Тип скидки";
	НовыйЭлемент.Подсказка = "Тип скидки";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	НовыйЭлемент = Элементы.Вставить("гф_Сезон", ТипПолеФормы, Элементы.гф_СтраницаТипСкидки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Сезон";
	НовыйЭлемент.Заголовок = "Сезон";
	
	ТаблицаФормы = Элементы.Вставить("гф_Скидки", ТипТаблицаФормы, Элементы.гф_СтраницаТипСкидки);
	ТаблицаФормы.ПутьКДанным = "Объект.гф_Скидки";
	
	// Создаем колонку для выбора и ввода
	НовыйЭлемент  = Элементы.Добавить("гф_Скидки_гф_ТипСкидки", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Скидки.гф_ТипСкидки";
	
	НовыйЭлемент  = Элементы.Добавить("гф_Скидки_гф_Скидка", ТипПолеФормы, ТаблицаФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Скидки.гф_Скидка";
	
    НовыйЭлемент = Элементы.Вставить("гф_СтраницаДополнительно", ТипГруппаФормы, Элементы.ГруппаСтраницы,
					Элементы.СтраницаУчетнаяИнформация);
	НовыйЭлемент.Вид = ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок = "Служебное";
	НовыйЭлемент.Подсказка = "Служебное";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Вставить("Код", ТипПолеФормы, Элементы.ГруппаНомерДата);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Код"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_УстановленСрокОплатыДляРезервов", ТипПолеФормы,
					Элементы.гф_СтраницаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_УстановленСрокОплатыДляРезервов";
	
	НовыйЭлемент = Элементы.Вставить("гф_РазмерПредоплатыПоЗаказуПокупателя", ТипПолеФормы,
					Элементы.гф_СтраницаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_РазмерПредоплатыПоЗаказуПокупателя";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	НовыйЭлемент = Элементы.Вставить("гф_ВестиУчетАвансовПоДоговоруВРазрезеНоменклатуры", ТипПолеФормы, 
					Элементы.гф_СтраницаДополнительно);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ВестиУчетАвансовПоДоговоруВРазрезеНоменклатуры";
	  	
    НовыйЭлемент = Элементы.Добавить("гф_ДатыЗагрузки", ТипГруппаФормы, Элементы.гф_СтраницаДополнительно);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Загрузка данных";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаИспользованияДоговораПриЗагрузкеДанных", ТипПолеФормы, 
					Элементы.гф_ДатыЗагрузки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаИспользованияДоговораПриЗагрузкеДанных"; 
	
    НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияИспользованияДоговораПриЗагрузкеДанных", ТипПолеФормы, 
					Элементы.гф_ДатыЗагрузки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияИспользованияДоговораПриЗагрузкеДанных"; 

    НовыйЭлемент = Элементы.Добавить("гф_Блокировки", ТипГруппаФормы, Элементы.гф_СтраницаДополнительно);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Вставить("гф_Заблокирован", ТипПолеФормы, Элементы.гф_Блокировки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Заблокирован";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
    НовыйЭлемент = Элементы.Вставить("гф_ОписаниеБлокировки", ТипПолеФормы, Элементы.гф_Блокировки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ОписаниеБлокировки";  
    // ++ Галфинд(Просто)_Боцманова_17_09_2022	
	НовыйЭлемент.ТолькоПросмотр = Истина; 
    // ++ Галфинд(Просто)_Боцманова_17_09_2022	
	
	Команда = Команды.Добавить("гф_КомандаПричиныБлокировки");
	Команда.Действие = "гф_КомандаПричиныБлокировки";
	
	НовыйЭлемент = Элементы.Вставить("гф_ПричиныБлокировки", ТипКнопкаФормы, КоманднаяПанель);
	НовыйЭлемент.Заголовок = "Причины блокировки";
	НовыйЭлемент.ИмяКоманды = "гф_КомандаПричиныБлокировки";
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	// -- Галфинд_Домнышева_04_07_2022
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаКлиенте
Процедура гф_КомандаПричиныБлокировки(Команда)
	// ++ Галфинд_Домнышева_04_07_2022
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Открывать РС ""Причины блокировок"" (ТЗ 4.1.15)");
	// Команда будет заполнена после проектирования РС ПричиныБлокировок
	// -- Галфинд_Домнышева_04_07_2022

КонецПроцедуры  

#КонецОбласти