&Вместо ("НомерСчетаФактурыНаПечать")
Функция гф_НомерСчетаФактурыНаПечать(Номер, УдалитьПользовательскийПрефикс, ОбособленноеПодразделение, ЦифровойИндексОбособленногоПодразделения) Экспорт
	НомерНаПечать = ПродолжитьВызов(Номер, УдалитьПользовательскийПрефикс, ОбособленноеПодразделение, ЦифровойИндексОбособленногоПодразделения);
	
	НомерОрдера = "";
	ПозицияПодчеркивания = СтрНайти(НомерНаПечать, "_");
	Если ПозицияПодчеркивания > 0 Тогда
		НомерОрдера = Лев(НомерНаПечать, ПозицияПодчеркивания);
	КонецЕсли; 
	ЭтотНомерБезНомераОрдера = Сред(НомерНаПечать, ПозицияПодчеркивания + 1);
	ЭтотНомерБезНомераОрдераИНулей = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(ЭтотНомерБезНомераОрдера, "0");
	
	Если НомерОрдера = "_" Тогда
		НомерНаПечать = ЭтотНомерБезНомераОрдераИНулей;
	Иначе	
		НомерНаПечать = НомерОрдера + ЭтотНомерБезНомераОрдераИНулей;
	КонецЕсли;

	Возврат НомерНаПечать;
	
КонецФункции
