#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаГлобальныеКоманды);
	
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ++ Галфинд СадомцевСА 18.04.2024 Реализовано:
	// Добавил команду Печать - "Печатная форма Счета для Спецификации покупателя",
	// чтобы указать какую печ. форму Счета использовать при отправке ПФ Спецификации по почте.
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eefcd193bae294 (п.1)
	НоваяКоманда = Команды.Добавить("гф_ПечатнаяФормаСчетаДляСпецификации");
	НоваяКоманда.Заголовок = "Печатная форма Счета для Спецификации покупателя";
	НоваяКоманда.Подсказка = "Печатная форма Счета для Спецификации покупателя";
	НоваяКоманда.Действие = "гф_ПечатнаяФормаСчетаДляСпецификации";
	// НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
	// НоваяКоманда.Картинка = БиблиотекаКартинок.ЗагрузкаИзВнешнегоИсточника;

	НовыйЭлемент = Элементы.Вставить("гф_ПечатнаяФормаСчетаДляСпецификации",
		Тип("КнопкаФормы"), Элементы.ПодменюПечать);
	НовыйЭлемент.Заголовок = "Печатная форма Счета для Спецификации покупателя";
	НовыйЭлемент.ИмяКоманды = "гф_ПечатнаяФормаСчетаДляСпецификации";
	// -- Галфинд СадомцевСА 18.04.2024
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
//
// Параметры:
//
//   Команда - Строка
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
	
КонецПроцедуры

//
// Параметры:
//
//   ПараметрыВыполнения		- Произвольный
//   ДополнительныеПараметры	- Произвольный
//
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	
КонецПроцедуры

//
// Параметры:
//
//   ПараметрыВыполнения - Произвольный
//
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
// Параметры:
//
//   Команда - Строка
//
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры

// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура гф_ПечатнаяФормаСчетаДляСпецификации(Команда)
	
	ОткрытьФорму("Документ.гф_СпецификацияПокупателя.Форма.гф_ФормаВыбораПечатнойСчетаФормыДляСпецификации");
	
КонецПроцедуры

#КонецОбласти
