
&НаКлиенте
Процедура ТолькоБезПеревода(Команда)
	
	ТолькоБезПеревода = не ТолькоБезПеревода;
	Элементы.ФормаТолькоБезПеревода.Пометка = ТолькоБезПеревода;
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Заголовок = Заголовок + " (" + ЯзыкПеревода + ")";
	ТолькоБезПеревода = ИСТИНА;
	Элементы.ФормаТолькоБезПеревода.Пометка = ТолькоБезПеревода;
	
	ОбновитьДанные();
	
КонецПроцедуры 

Процедура ОбновитьДанные()
	
	ТаблицаОбъекты.Очистить();
	
	Для Каждого СтрокаОбъекты Из Объект.Объекты Цикл
		
		Если ТолькоБезПеревода И Не ПустаяСтрока(СтрокаОбъекты.Перевод) Тогда Продолжить КонецЕсли;
		СтрокаТаблицыОбъекты = ТаблицаОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыОбъекты, СтрокаОбъекты);
		
	КонецЦикла;
	
	ТаблицаОбъекты.Сортировать("ТипОбъекта");
	
КонецПроцедуры





