
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	гф_СоздатьНовыеРеквизиты();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура гф_ПартнерПриИзменении(Элемент)
	
	гф_ПартнерПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура гф_АдресНачалоВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	гф_АдресДоставкиНачалоВыбораНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура гф_АдресДоставкиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//а = гф_АдресДоставкиАвтоПодборНаСервере();
	//Если Не а Тогда;
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_СоздатьНовыеРеквизиты()
	
	ТипПолеФормы = Тип("ПолеФормы");
		
	// Данные по "гф_Контрагент" не выводим на форму, а заполняем автоматически по реквизиту "гф_Партнер" 	
	НовоеПоле = Элементы.Добавить("гф_Партнер", ТипПолеФормы, Элементы.ГруппаДополнительно);
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Заголовок 	= "Клиент";
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_Партнер";
	НовоеПоле.УстановитьДействие("ПриИзменении", "гф_ПартнерПриИзменении"); 
	
	НовоеПоле = Элементы.Добавить("гф_АдресДоставки", ТипПолеФормы, Элементы.ГруппаДополнительно);
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_АдресДоставки";
	НовоеПоле.КнопкаВыбора 				= Истина;
	НовоеПоле.КнопкаВыпадающегоСписка 	= Истина;
	// Установка связи для отбора при открытии окна выбора адресов по контрагенту
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.гф_Контрагент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовоеПоле.СвязиПараметровВыбора	= Новый ФиксированныйМассив(НовыйМассив);
	НовоеПоле.УстановитьДействие("НачалоВыбора", "гф_АдресНачалоВыбора");
	НовоеПоле.УстановитьДействие("АвтоПодбор", "гф_АдресДоставкиАвтоПодбор");
	
КонецПроцедуры

&НаСервере
Процедура гф_ПартнерПриИзмененииНаСервере()
	
	гф_РаботаСАдресами.ПартнерПриИзмененииНаФормеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура гф_АдресДоставкиНачалоВыбораНаСервере()
	
	гф_РаботаСАдресами.АдресДоставкиНачалоВыбораНаФормеДокумента(Объект)
	
КонецПроцедуры

&НаСервере
Функция гф_АдресДоставкиАвтоПодборНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Партнер) И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Если Не Объект.Партнер = Объект.Контрагент.Партнер Тогда
			Возврат Ложь;	
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти