
#Область ПрограммныйИнтерфейс      

Функция ЗначениеДополнительнойНастройки(Идентификатор, ВместеСХранилищем = Ложь) Экспорт 
	
	Возврат БФД_ПовторногоИспользования.ЗначениеДополнительнойНастройки(Идентификатор, ВместеСХранилищем);
						
КонецФункции

Функция СравнитьКолонкиТаблицыЗначений(Таблица1, ИмяКолонки1, Таблица2, ИмяКолонки2) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица1.&КолонкаТаблицы1 КАК КолонкаТаблицы1
		|ПОМЕСТИТЬ Таблица1
		|ИЗ
		|	&Таблица1 КАК Таблица1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица2.&КолонкаТаблицы2 КАК КолонкаТаблицы2
		|ПОМЕСТИТЬ Таблица2
		|ИЗ
		|	&Таблица2 КАК Таблица2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица1.КолонкаТаблицы1 КАК &КолонкаТаблицы1Таблицы1,
		|	Таблица2.КолонкаТаблицы2 КАК &КолонкаТаблицы2Таблицы2
		|ИЗ
		|	Таблица1 КАК Таблица1
		|		ПОЛНОЕ СОЕДИНЕНИЕ Таблица2 КАК Таблица2
		|		ПО Таблица1.КолонкаТаблицы1 = Таблица2.КолонкаТаблицы2
		|ГДЕ
		|	Таблица1.КолонкаТаблицы1 ЕСТЬ NULL ИЛИ Таблица2.КолонкаТаблицы2 ЕСТЬ NULL";  
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КолонкаТаблицы1", ИмяКолонки1);    
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КолонкаТаблицы2", ИмяКолонки2);
	Запрос.УстановитьПараметр("Таблица1", Таблица1); 
	Запрос.УстановитьПараметр("Таблица2", Таблица2);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();				
	
КонецФункции

#КонецОбласти