
&Вместо("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, Замещение)
	
	// #wortmann { 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee6354a1ca173e 
	// Галфинд_Домнышева 2023/10/05
	Если ЭтотОбъект.Количество() = 0 И ЭтотОбъект.Модифицированность() = Истина Тогда
	МассивШтрихкодов = Новый Массив;

	Для Каждого СтрокаНабора Из ЭтотОбъект.Отбор Цикл
		Если ТипЗнч(СтрокаНабора.Значение) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
			 МассивШтрихкодов.Добавить(СтрокаНабора.Значение); 
		КонецЕсли;
	КонецЦикла;
    ЭтотОбъект.ДополнительныеСвойства.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	КонецЕсли;
    // } #wortmann
	ПродолжитьВызов(Отказ, Замещение);
КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура гф_ПриЗаписи(Отказ, Замещение)
	// #wortmann { 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee6354a1ca173e 
	// Галфинд_Домнышева 2023/10/05
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("МассивШтрихкодов") Тогда
		МассивШтрихкодов = ЭтотОбъект.ДополнительныеСвойства.МассивШтрихкодов;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковочныйЛист.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.УпаковочныйЛист КАК УпаковочныйЛист
			|ГДЕ
			|	УпаковочныйЛист.гф_Агрегация В (&МассивШ)";
		
		Запрос.УстановитьПараметр("МассивШ", МассивШтрихкодов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			УЛОбъект = Выборка.Ссылка.ПолучитьОбъект();
			УЛОбъект.гф_NVE_распечатан = Ложь;
			УЛОбъект.ОбменДанными.Загрузка = Истина;
			УЛОбъект.Записать();
			
		КонецЦикла;	
		
	КонецЕсли;
    // } #wortmann
	ПродолжитьВызов(Отказ, Замещение);
КонецПроцедуры
