 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
// #wortmann {
// Формируем движения документа
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&Вместо("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, Режим)
	Движения.гф_ЛимитыКонтрагентов.Записывать = Истина;
	Движение = Движения.гф_ЛимитыКонтрагентов.Добавить();
	Движение.Период = НачалоДня(Дата);
	Движение.Контрагент = Контрагент;
	Движение.Организация = Организация;
	Движение.ВидЛимита = ВидЛимита;
	Движение.Статус = Статус;
	Движение.Сумма = Сумма;
	Движение.Партнер = Партнер;
КонецПроцедуры

// } #wortmann
// #wortmann {
// Заполнение поля Ответственный по текущему пользователю 
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&Вместо("ОбработкаЗаполнения")
Процедура гф_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный  = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("ВидОперации", ВидОперации);
	КонецЕсли;
	
КонецПроцедуры
// } #wortmann 

// #wortmann {
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&После("ПриКопировании")
Процедура гф_ПриКопировании(ОбъектКопирования)
		ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee5219ab65a092
	// Галфинд_Домнышева_14_09_2023
	Ответственный = Пользователи.ТекущийПользователь();
	Комментарий = "";
	// } #wortmann
КонецПроцедуры
// } #wortmann

// } #wortmann
// #wortmann {
// Заполнение поля Контрагент по реквизиту Партнер 
// #4.1.15
// Галфинд Волков 2023/02/20
&Вместо("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент, Истина);
	//ПродолжитьВызов(Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры // } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee5219ab65a092
// Галфинд_Домнышева_14_09_2023
&Вместо("ПриУстановкеНовогоНомера")
Процедура гф_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Организация.Префикс;
КонецПроцедуры
// } #wortmann

#КонецОбласти

#КонецЕсли
