
&ИзменениеИКонтроль("ВывестиВДокументРезультатОбластиМакета")
Процедура гф_ВывестиВДокументРезультатОбластиМакета(ДокументРезультат, Макет, ИменаОбластейМакета, Данные, Данные1, Данные2, Данные3, Данные4, Данные5, Данные6, Данные7, Данные8, Данные9)

	ИменаОбластей = СтрРазделить(ИменаОбластейМакета, ",");
	Для Каждого ИмяОбласти Из ИменаОбластей Цикл

		Область = Макет.ПолучитьОбласть(ИмяОбласти);
		ЗаполнитьПараметрыОбластиМакета(Область, Данные, 
		Данные1, Данные2, Данные3, Данные4, 
		Данные5, Данные6, Данные7, Данные8, 
		Данные9);
		#Вставка
		// Галфинд СадомцевСА 12.04.2024  "Приказ об увольнении (Т-8)"
		// Исправил ошибку "Поле объекта не обнаружено (СсылкаНаОбъект)":
		// Добавил проверку чтобы доработки "работали" только для документа Премия
		// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eef80932c302fb
		Если ТипЗнч(Данные) = Тип("СтрокаДереваЗначений") Тогда
			СтруктураДляПроверки = Новый Структура("СсылкаНаОбъект", Неопределено);
			ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, Данные);
			Если ТипЗнч(СтруктураДляПроверки["СсылкаНаОбъект"]) = Тип("ДокументСсылка.Премия") Тогда
				// ++ ЕсиповАВ Галфинд 09.04.24
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ДополнительныеСведения.Объект КАК Объект,
				|	ДополнительныеСведения.Свойство КАК Свойство,
				|	ДополнительныеСведения.Значение КАК Значение
				|ИЗ
				|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
				|ГДЕ
				|	ДополнительныеСведения.Свойство.Наименование = &Наименование
				|	И ДополнительныеСведения.Объект = &Объект";
				Запрос.УстановитьПараметр("Наименование", "Мотив поощрения");
				Запрос.УстановитьПараметр("Объект", Данные.СсылкаНаОбъект);
				Таб = Запрос.Выполнить().Выгрузить();
				Если Не Таб.Количество() = 0 Тогда
					Область.Параметры.СсылкаНаОбъектМотивПоощрения = Таб[0].Значение.Наименование; 
				КонецЕсли;
				// ++ ЕсиповАВ Галфинд 09.04.24
			КонецЕсли;
		КонецЕсли;
		#КонецВставки

		ДокументРезультат.Вывести(Область);

	КонецЦикла;

КонецПроцедуры
