
&ИзменениеИКонтроль("ВывестиВДокументРезультатОбластиМакета")
Процедура гф_ВывестиВДокументРезультатОбластиМакета(ДокументРезультат, Макет, ИменаОбластейМакета, Данные, Данные1, Данные2, Данные3, Данные4, Данные5, Данные6, Данные7, Данные8, Данные9)

	ИменаОбластей = СтрРазделить(ИменаОбластейМакета, ",");
	Для Каждого ИмяОбласти Из ИменаОбластей Цикл

		Область = Макет.ПолучитьОбласть(ИмяОбласти);
		ЗаполнитьПараметрыОбластиМакета(Область, Данные, 
		Данные1, Данные2, Данные3, Данные4, 
		Данные5, Данные6, Данные7, Данные8, 
		Данные9);
		#Вставка
		// ++ ЕсиповАВ Галфинд 09.04.24
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство.Наименование = &Наименование
		|	И ДополнительныеСведения.Объект = &Объект";
		Запрос.УстановитьПараметр("Наименование", "Мотив поощрения");
		Запрос.УстановитьПараметр("Объект", Данные.СсылкаНаОбъект);
		Таб = Запрос.Выполнить().Выгрузить();
		Если Не Таб.Количество() = 0 Тогда
			Область.Параметры.СсылкаНаОбъектМотивПоощрения = Таб[0].Значение.Наименование; 
		КонецЕсли;
		// ++ ЕсиповАВ Галфинд 09.04.24
		#КонецВставки

		ДокументРезультат.Вывести(Область);

	КонецЦикла;

КонецПроцедуры
