#Область ПрограммныйИнтерфейс

// #wortmann {
// #Спецификация покупателя
//
// Галфинд Окунев 2022/07/1007/05
//
// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати
//
&После("ПриОпределенииОбъектовСКомандамиПечати")
Процедура гф_ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.гф_СпецификацияПокупателя);
	
КонецПроцедуры// } #wortmann

#КонецОбласти
