#Область ОбработчикиСобытийФормы
// #wortmann {
// Устанавливает ПорядокОбработки в новом объекте "+1" от предидущего 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=811dbcee7bda45d711ecf78ee2ff45f8
// Галфинд_Домнышева 2022/08/12
&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Параметры.Ключ.Пустая() Тогда
		
		Запрос = Новый Запрос (
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоследовательностьПроведения.ПорядокОбработки КАК ПорядокОбработки
		|ИЗ
		|	Справочник.гф_ПоследовательностьПроведения КАК ПоследовательностьПроведения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокОбработки УБЫВ" );
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда		
			 Объект.ПорядокОбработки = Выборка.ПорядокОбработки + 1;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры// } #wortmann

// #wortmann {
// Вызывает серверную процедуру ПриОткрытии 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=811dbcee7bda45d711ecf78ee2ff45f8
// Галфинд_Домнышева 2022/08/12
//
// Параметры:
//	Отказ - Булево - признак отказа.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры// } #wortmann

// #wortmann {
// Проверяет заполненность интерфейса и наличие элемента с таким же наименованием. 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=811dbcee7bda45d711ecf78ee2ff45f8
// Галфинд_Домнышева 2022/08/12 
//
// Параметры:
//	Отказ - Булево - признак отказа.
//	ПараметрыЗаписи - Структура - структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Интерфейс) Тогда
	    Отказ = Истина;
		Предупреждение("Перед записью элемента справочника должен быть выбран интерфейс! ");
	КонецЕсли;
	
	ЭлементСТакимЖеИменем	= НайтиТакойЭлемент(); 
	Если НЕ ЭлементСТакимЖеИменем = Объект.Ссылка 
		И НЕ ЭлементСТакимЖеИменем = Неопределено 
		И НЕ ЭлементСТакимЖеИменем.Пустая() Тогда
		Отказ = Истина;
		Предупреждение("Элемент справочника Последовательности проведения для интерфейса " 
		+ Объект.Наименование + " уже существует!");
	КонецЕсли;

КонецПроцедуры// } #wortmann 

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

// #wortmann {
// Устанавливает значение Наименование равное значению Интерфейсу 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=811dbcee7bda45d711ecf78ee2ff45f8
// Галфинд_Домнышева 2022/08/12
//
// Параметры:
// Элемент – ПолеФормы.
//
&НаКлиенте
Процедура ИнтерфейсПриИзменении(Элемент)
	Если НЕ Объект.Наименование = СокрЛП(Объект.Интерфейс) Тогда
		Объект.Наименование = СокрЛП(Объект.Интерфейс); 
	КонецЕсли;
КонецПроцедуры// } #wortmann

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

// #wortmann {
// Ищет аналогичный элемент в справочнике гф_ПоследовательностьПроведения 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=811dbcee7bda45d711ecf78ee2ff45f8
// Галфинд_Домнышева 2022/08/12
//
// Возвращаемое значение: 
//  <СправочникСсылка.гф_ПоследовательностьПроведения> - если элемент найден ссылка заполнена, иначе Пустая Ссылка
//
&НаСервере
Функция НайтиТакойЭлемент()
	 
	Возврат Справочники.гф_ПоследовательностьПроведения.НайтиПоНаименованию(Объект.Наименование); 
	 
КонецФункции// } #wortmann
 
#КонецОбласти