
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Ключ.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;
	
	Если Объект.ТипЗначения.Типы().Количество() > 1 Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Объект.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоГлобальноеЗначение", Объект.Ссылка);
КонецПроцедуры 

#КонецОбласти
