#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Ключ.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;
	
	Если Объект.ТипЗначения.Типы().Количество() > 1 Тогда
		Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Объект.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
	КонецЕсли;   
	
	Если Объект.Ссылка = 
		ПредопределенноеЗначение("ПланВидовХарактеристик.гф_ГлобальныеЗначения.гф_ПодразделениеСтатьяДляРоялти") Тогда
		
		Элементы.ГруппаДоговоры.Видимость		= Ложь;
		Элементы.ГруппаПодразделения.Видимость	= Истина;
		Элементы.ГруппаСписок.Видимость			= Ложь;
		Элементы.ТипЗначения.Видимость			= Ложь;
		Элементы.Значение.Видимость				= Ложь;
		
		Если Не ЗначениеЗаполнено(Объект.ТипЗначения) Тогда
			
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций");
			
			Объект.ТипЗначения = ТипЗначения;
			Объект.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
			
		КонецЕсли;	
		
	ИначеЕсли Объект.Ссылка = 
		ПредопределенноеЗначение("ПланВидовХарактеристик.гф_ГлобальныеЗначения.гф_ДоговорДляРоялти") Тогда
		
		Элементы.ГруппаДоговоры.Видимость		= Истина;
		Элементы.ГруппаПодразделения.Видимость	= Ложь;
		Элементы.ГруппаСписок.Видимость			= Ложь;
		Элементы.ТипЗначения.Видимость			= Ложь;
		Элементы.Значение.Видимость				= Ложь;
		
		Если Не ЗначениеЗаполнено(Объект.ТипЗначения) Тогда
			
			ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов");
			
			Объект.ТипЗначения = ТипЗначения;
			Объект.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
			
		КонецЕсли;	
		
	Иначе
		
		Элементы.ГруппаДоговоры.Видимость		= Ложь;
		Элементы.ГруппаПодразделения.Видимость	= Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоГлобальноеЗначение", Объект.Ссылка);
КонецПроцедуры 

#КонецОбласти
