
//Процедура ПометкаКОтгрузкеУпаковочногоЛиста(УпаковочныйЛист, ТекущийОрдер)
//	
//	
//	
//КонецПроцедуры

Процедура гфОтгрузкаУпаковочногоЛистаОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковочныйЛист.гф_ТекущийОрдер КАК гф_ТекущийОрдер,
	|	УпаковочныйЛист.гф_Агрегация КАК гф_Агрегация,
	|	УпаковочныйЛист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УпаковочныйЛист КАК УпаковочныйЛист
	|ГДЕ
	|	УпаковочныйЛист.гф_ТекущийОрдер = &гф_ТекущийОрдер";
	
	Запрос.УстановитьПараметр("гф_ТекущийОрдер", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.гф_Агрегация <> Неопределено Тогда
			
			Агрегация = ВыборкаДетальныеЗаписи.гф_Агрегация.ПолучитьОбъект();
			Агрегация.гф_Автодействие = Перечисления.гф_АвтодействияКМ.ОтгрузкаКМ;
			Агрегация.Записать();
			
			УпаковочныйЛист = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			УпаковочныйЛист.гф_ТекущийОрдер = Неопределено;
			УпаковочныйЛист.Записать();
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
