#Область ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр гф_ИсторияИзмененияСкидок
	Движения.гф_ИсторияИзмененияСкидок.Записывать = Истина;
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.гф_ИсторияИзмененияСкидок.Добавить();
		Движение.Организация = Организация;
		Если ЗначениеЗаполнено(Сезон) Тогда
			Движение.Сезон = Сезон;
		Иначе
			Движение.Сезон = ТекСтрокаСкидки.Договор.гф_Сезон;
		КонецЕсли;
		Движение.Период = ТекСтрокаСкидки.Период;
		Движение.Контрагент = ТекСтрокаСкидки.Контрагент;
		Движение.Договор = ТекСтрокаСкидки.Договор;
		Движение.ВидСкидки = ТекСтрокаСкидки.ВидСкидки;
		Движение.Скидка = ТекСтрокаСкидки.Скидка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
