
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура гф_ПриОткрытииПосле(Отказ)
	
	Форма = ЭтотОбъект;
	
	ФормаВладелец = Форма.ВладелецФормы;
    Пока ТипЗнч(ФормаВладелец) <> Тип("ФормаКлиентскогоПриложения") Цикл
        ФормаВладелец = ФормаВладелец.Родитель; 
    КонецЦикла;
	
	//Катютин 071022 НАЧ
	Попытка     
		КоробнойСклад = Неопределено;
		ОкнаПриложения = ПолучитьОкна();
		Для каждого ОкноПриложения Из ОкнаПриложения Цикл
			// Анализ заголовка окна
			Если Найти(ОкноПриложения.Заголовок, "оробной склад") > 0 Тогда
				// Получение формы
				НайденнаяФорма = ОкноПриложения.Содержимое[0];
				// Анализ реквизита формы    
				КоробнойСклад = НайденнаяФорма.КоробнойСклад_; 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КоробнойСклад <> Неопределено Тогда
		//КоробнойСклад = ФормаВладелец.КоробнойСклад_;
			Если КоробнойСклад = 1 Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТоварыВКоробах",
										Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				Элементы.Список.Отображение = ОтображениеТаблицы.Список;
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТоварыВКоробах",
										Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
				Элементы.Список.Отображение = ОтображениеТаблицы.Список
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//Катютин 071022 КОН
	
	Попытка
		ОбъектФормыВладельца = ФормаВладелец.Объект;
	Исключение
		Возврат;
	КонецПопытки;	
		
	Если ОбъектФормыВладельца.Свойство("Организация") Тогда
		
		Если ЗначениеЗаполнено(ОбъектФормыВладельца.Организация) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка.гф_Организация",
									ОбъектФормыВладельца.Организация, ВидСравненияКомпоновкиДанных.Равно, , Истина);
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Иначе
	
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Поле """ + ФормаВладелец.Элементы.Организация.Имя + """ не заполнено!";
			Сообщение.Поле = "ОбъектФормыВладельца.Организация";
			Сообщение.ПутьКДанным = "";
			Сообщение.УстановитьДанные(ОбъектФормыВладельца);
			Сообщение.Сообщить();
			
			Форма.Закрыть();
			
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти