
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Отчет.Вид = "РеализацииПокупателей";
	УстановитьВидимостьРеквизитов(); 
	УстановитьВариантОтчета()
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтчета()
	
	Если Отчет.ФормироватьВПарах Тогда
		  УстановитьТекущийВариант("ВПарах");
	Иначе
		 УстановитьТекущийВариант("ВКоробах");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитов()
	
	Если Отчет.Вид = "РеализацииПокупателей" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость = Истина;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина; 
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Истина;				
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;
		
	ИначеЕсли Отчет.Вид = "ЗаказыКлиентов" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость = Истина;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		Элементы.ТаблицаДокументы.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Истина;		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;
	ИначеЕсли Отчет.Вид = "ПриобретениеТоваровИУслуг" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Истина; 
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		Элементы.ТаблицаДокументы.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Истина;		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;
		
	ИначеЕсли Отчет.Вид = "ВнутренниеЗаказы" Тогда
		
		Элементы.ФормироватьВПарах.Видимость = Ложь;
		Элементы.НачалоПериода.Видимость = Истина;
		Элементы.КонецПериода.Видимость = Истина;
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		Элементы.ТаблицаДокументы.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыПометка.Видимость = Истина;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДокумент.Видимость = Истина;	
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыКонтрагент.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыДоговорКонтрагента.Видимость = Ложь;		
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладОтправитель.Видимость = Ложь;
		Элементы.ТаблицаДокументы.ПодчиненныеЭлементы.ТаблицаДокументыСкладПолучатель.Видимость = Ложь;	
		
	ИначеЕсли Отчет.Вид = "СвободныеОстатки" Тогда
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.СкладПолучатель.Заголовок = "Склад";
		Элементы.ДатаОстатков.Видимость = Истина;
		Элементы.ЦенаСоСкидкой.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.Видимость = Ложь; 
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
				
	ИначеЕсли Отчет.Вид = "ФактическиеОстатки" Тогда
		
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Истина;
		Элементы.СкладПолучатель.Заголовок = "Склад";
		Элементы.ДатаОстатков.Видимость = Истина;
		Элементы.ЦенаСоСкидкой.Видимость = Истина;
		
		Элементы.ТаблицаДокументы.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Ложь;
		
	ИначеЕсли Отчет.Вид = "Ассортимент" Тогда	
		
		Элементы.ФормироватьВПарах.Видимость = Истина;
		Элементы.НачалоПериода.Видимость = Ложь;
		Элементы.КонецПериода.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.СкладОтправитель.Видимость = Ложь;
		Элементы.СкладПолучатель.Видимость = Ложь;
		Элементы.КомпоновщикОтбораНоменклатурыНастройкиОтбор.Видимость = Истина;
		
		Элементы.ДатаОстатков.Видимость = Ложь;
		Элементы.ЦенаСоСкидкой.Видимость = Ложь;		
		Элементы.ТаблицаДокументы.Видимость = Ложь;
				
	КонецЕсли; 	
	
КонецПроцедуры	

&НаКлиенте
Процедура Отметить(Команда)
	
	Для каждого Строка из Отчет.ТаблицаДокументы Цикл
			Строка.Пометка = Истина;		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда) 
	
	Для каждого Строка из Отчет.ТаблицаДокументы Цикл
			Строка.Пометка = Ложь;		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьДокументыНаСервере()
	
	Отчет.ТаблицаДокументы.Очистить();
	
	Если Отчет.Вид = "РеализацииПокупателей" Тогда
		 ЗаполнитьДокументы_РеализацииПокупателей();
	ИначеЕсли Отчет.Вид = "ЗаказыКлиентов" Тогда	
		 ЗаполнитьДокументы_ЗаказыКлиентов();
	ИначеЕсли Отчет.Вид = "ПриобретениеТоваровИУслуг" Тогда	
		 ЗаполнитьДокументы_ПриобретениеТоваровИУслуг();
	ИначеЕсли Отчет.Вид = "Перемещения" Тогда
		 ЗаполнитьДокументы_Перемещения();			
	ИначеЕсли Отчет.Вид = "ВнутренниеЗаказы" Тогда	
		 ЗаполнитьДокументы_ВнутренниеЗаказы();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы_РеализацииПокупателей()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА РеализацияТоваровУслуг.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА РеализацияТоваровУслуг.Договор = &ДоговорКонтрагента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("ОтборПоДоговору",ЗначениеЗаполнено(Отчет.ДоговорКонтрагента));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДокументы_ЗаказыКлиентов() 
		
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Документ,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаказКлиента.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ЗаказКлиента.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА ЗаказКлиента.Договор = &ДоговорКонтрагента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("ОтборПоДоговору",ЗначениеЗаполнено(Отчет.ДоговорКонтрагента));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДокументы_ПриобретениеТоваровИУслуг()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Документ,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Договор КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПриобретениеТоваровУслуг.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ПриобретениеТоваровУслуг.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА ПриобретениеТоваровУслуг.Договор = &ДоговорКонтрагента
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы_Перемещения()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Документ,
	|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПеремещениеТоваров.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоСкладуОтправителя
	|				ТОГДА ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоСкладуПолучателя
	|				ТОГДА ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоСкладуОтправителя", ЗначениеЗаполнено(Отчет.СкладОтправитель));
	Запрос.УстановитьПараметр("ОтборПоСкладуПолучателя", ЗначениеЗаполнено(Отчет.СкладПолучатель));
	Запрос.УстановитьПараметр("СкладОтправитель", Отчет.СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", Отчет.СкладПолучатель);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументы_ВнутренниеЗаказы()
	
	Запрос = новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Документ,
	|	ВнутреннееПотреблениеТоваров.гф_Контрагент КАК Контрагент	
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВнутреннееПотреблениеТоваров.Проведен = ИСТИНА
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ВнутреннееПотреблениеТоваров.гф_Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",НачалоДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",ЗначениеЗаполнено(Отчет.Контрагент));
	Запрос.УстановитьПараметр("Контрагент",Отчет.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Отчет.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 НоваяСтрока = Отчет.ТаблицаДокументы.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументы(Команда)
	ПолучитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтборы(Команда)  
	
	Если Элементы.СкрытьОтборы.Заголовок = "Скрыть отборы" Тогда 
		Элементы.ГруппаОтборы.Видимость = Ложь;
		Элементы.СкрытьОтборы.Заголовок = "Показать отборы";		
	Иначе
		Элементы.ГруппаОтборы.Видимость = Истина;
		Элементы.СкрытьОтборы.Заголовок = "Скрыть отборы"
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьВПарахПриИзменении(Элемент)
	УстановитьВариантОтчета();	
КонецПроцедуры

