
&НаСервере
Процедура ВыполнитьЗапросыCactusНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьОсновныеДействия();	

КонецПроцедуры

&НаКлиенте 
Процедура ВыполнитьЗапросыCactus(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗапросыCactusВопросОрганизация", ЭтаФорма), "Не указана организация. Выполнить запрос по всем организациям, для которых есть настройки?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ВыполнитьЗапросыCactusПродолжитьВызов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросыCactusВопросОрганизация(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ОтказВыполнения = Истина;
	КонецЕсли;
	
	ВыполнитьЗапросыCactusПродолжитьВызов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросыCactusПродолжитьВызов()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗапросыCactusВопросДатаНачала", ЭтаФорма, Новый Структура("ДатаНачала",Объект.ДатаНачала)), "Не указана дата начала получения изменений. Запросить изменения со вчерашнего дня?", РежимДиалогаВопрос.ДаНет); 
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗапросыCactusВызовНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапросыCactusВопросДатаНачала(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		ОтказВыполнения = Истина;
	КонецЕсли;

	ВыполнитьЗапросыCactusВызовНаСервере();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ВыполнитьЗапросыCactusВызовНаСервере()
	
	Если НЕ ОтказВыполнения Тогда
		ВыполнитьЗапросыCactusНаСервере();
	КонецЕсли;

КонецПроцедуры