
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Закрыть(ТабДок);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбластьАртикул = ТабДок.Область(1,1,1,1);
	ОбластьАртикул.Текст = "Артикул";
	
	ОбластьЦена = ТабДок.Область(1,2,1,2);
	ОбластьЦена.Текст = "Цена";      
	
    ОбластьЗаголовок = ТабДок.Область(1,1,1,2);
	ОбластьЗаголовок.Шрифт = Новый Шрифт(ОбластьЦена.Шрифт,,,Истина);
	ОбластьЗаголовок.ЦветФона = WebЦвета.Золотой;
	ОбластьЗаголовок.Защита = Истина;
КонецПроцедуры

