
&После("ЗаполнитьПоДокументуОснованию")
Процедура гф_ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)
	// ++ Галфинд_Домнышева 2023/04/10
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8131bcee7bda45d711edd1f8febddfd6
	// При формировании на осн КорректировкаРеализации (отсутствуют движения при гф_возвратWMN)
	// рквизиты КППКонтрагента и ИННКонтрагента не заполнены - заполняем их.
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) И
		(Не ДанныеЗаполнения.Свойство("ИННКонтрагента") ИЛИ Не ДанныеЗаполнения.Свойство("КППКонтрагента")) Тогда
		ДанныеЗаполнения.Вставить("КППКонтрагента", ДанныеЗаполнения.Контрагент.КПП);
		ДанныеЗаполнения.Вставить("ИННКонтрагента", ДанныеЗаполнения.Контрагент.ИНН);
	КонецЕсли;
    // -- Галфинд_Домнышева 2023/04/10
КонецПроцедуры
