
// Выполняет подготовку к передаче в сервис ИС МП сообщения по документу и начинает процедуру обмена
//		см. ИнтеграцияИСМПКлиент.ПодготовитьКПередаче()
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ВходящиеДанные - Массив Из (См. ИнтерфейсИСМПКлиентСервер.ПараметрыОбработкиДокументов)
Процедура гф_ПодготовитьКПередаче(Форма, ВходящиеДанные) Экспорт

	РезультатОбмена = ИнтеграцияИСМПВызовСервера.ПодготовитьКПередаче(ВходящиеДанные, Форма.УникальныйИдентификатор);
	ИнтеграцияИСМПСлужебныйКлиент.ОбработатьРезультатОбмена(РезультатОбмена, Форма);

КонецПроцедуры
