#Область ОбработчикиСобытийФормы

&НаКлиенте
&После("ПриОткрытии")
Процедура гф_ПриОткрытии(Отказ)
	// vvv Галфинд \ Sakovich 07.03.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eedbbb98f1041d
	Если ВладелецФормы.ИмяФормы = "Обработка.АктСверкиПоГруппеКлиентов.Форма.ФормаУправляемая" И
		УникальныйИдентификаторХранилища = ВладелецФормы.УникальныйИдентификатор Тогда
		гф_СформироватьПараметрыОтправкиАктСверкиПоГруппеКлиентов();
	КонецЕсли;
	// ^^^ Галфинд \ Sakovich 07.03.2024
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура гф_СформироватьПараметрыОтправкиАктСверкиПоГруппеКлиентов()
	МассивПредставленийДокументов = Новый Массив;
	Для каждого ЭлКоллекции Из ВладелецФормы.Объект.ПоДаннымОрганизации Цикл
		НаименованиеПартнера = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(
		ЭлКоллекции["Контрагент"], "Партнер.НаименованиеПолное");
		ПредставлениеДокумента = ЭлКоллекции["Представление"] + " " + НаименованиеПартнера;
		МассивПредставленийДокументов.Добавить(ПредставлениеДокумента); 
	КонецЦикла;
	ПараметрыВывода.ПараметрыОтправки.Тема = СтрСоединить(МассивПредставленийДокументов, Символы.ПС);
	гф_СформроватьПолучателяПоПартнеру(ВладелецФормы.Объект.Партнер);
КонецПроцедуры

&НаСервере
Процедура гф_СформроватьПолучателяПоПартнеру(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Контакт,
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК Адрес,
	|	ПартнерыКонтактнаяИнформация.Ссылка.НаименованиеПолное КАК Представление
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
	|	И ПартнерыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПартнера)
	|";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	//НовыйАдрес = Новый Структура;
	//Для каждого Колонка Из Результат.Колонки Цикл
	//	НовыйАдрес.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	//КонецЦикла;
	НовыйАдрес = Выборка.Адрес;
	ПараметрыВывода.ПараметрыОтправки.Получатель = НовыйАдрес;
КонецПроцедуры

#КонецОбласти





