
&НаКлиенте
Процедура гф_ПриОткрытииПосле(Отказ)
	// Галфинд СадомцевСА 21.09.2023 Реализовал "подписание" документов Заказ на эмиссию КМ внешней обработкой
	// гф_ПодписатьЗаказНаЭмиссию.epf
	Если Параметры.КлючНазначенияИспользования = "ПодписатьДокумент" Тогда
		Если УстановитьКонстанту() Тогда
			ПараметрыОбработкиДокументов = ИнтеграцияИСМПСлужебныйКлиентСервер.ПараметрыОбработкиДокументов();
			ПараметрыОбработкиДокументов.Ссылка             = Объект.Ссылка;
			ПараметрыОбработкиДокументов.Организация        = Объект.Организация;
			ПараметрыОбработкиДокументов.ДальнейшееДействие = ПредопределенноеЗначение(
			"Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки");
			
			ОписаниеПриЗавершении = Новый ОписаниеОповещения(
			"Подключаемый_ПриЗавершенииОперации", ЭтотОбъект, ПараметрыОбработкиДокументов);
			
			ИнтеграцияИСМПКлиент.ПодготовитьКПередаче(
			ЭтотОбъект,
			ПараметрыОбработкиДокументов,
			ОписаниеПриЗавершении);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция УстановитьКонстанту()
	ЗаказНаЭмиссиюКМ = Константы.гф_ЗаказНаЭмиссиюКМПодписать.Получить();
	Если ЗначениеЗаполнено(ЗаказНаЭмиссиюКМ) Тогда
		Возврат Ложь;
	КонецЕсли;
	Константы.гф_ЗаказНаЭмиссиюКМПодписать.Установить(Объект.Ссылка);
	Возврат Истина;
КонецФункции

&НаСервере
Процедура ОчиститьКонстанту()
	Константы.гф_ЗаказНаЭмиссиюКМПодписать.Установить(Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
&После("Подключаемый_ПриЗавершенииОперации")
Процедура гф_Подключаемый_ПриЗавершенииОперации(Результат, ДополнительныеПараметры)
	// Галфинд СадомцевСА 21.09.2023 Реализовал "подписание" документов Заказ на эмиссию КМ внешней обработкой
	// гф_ПодписатьЗаказНаЭмиссию.epf
	Если Параметры.КлючНазначенияИспользования = "ПодписатьДокумент" Тогда
		ОчиститьКонстанту();
		Закрыть();
	КонецЕсли;
КонецПроцедуры
