
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ Галфинд_Домнышева_30_06_2022
	НовыйЭлемент = Этаформа.Элементы.Добавить("гф_ГруппаНаименованиеКод",Тип("ГруппаФормы"), );
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = ЛОЖЬ; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("Код",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_ГруппаНаименованиеКод);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Код";
	
	Элементы.Переместить(ЭтаФорма.Элементы.Наименование, ЭтаФорма.Элементы.гф_ГруппаНаименованиеКод, ЭтаФорма.Элементы.Код);
	
    НовыйЭлемент = Этаформа.Элементы.Добавить("гф_НомерГодЛимит",Тип("ГруппаФормы"), );
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = ЛОЖЬ; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_Номер",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Номер";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_Год",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Год";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ТехническийЛимит",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТехническийЛимит";   
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("гф_ГруппаФормированиеЗаказов",Тип("ГруппаФормы"), );
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = ИСТИНА;
	НовыйЭлемент.Заголовок = "Формирование заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ДатаНачалаФормированияЗаказов",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаФормированияЗаказов";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ДатаОкончанияФормированияЗаказов",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияФормированияЗаказов"; 
	
	НовыйЭлемент = Этаформа.Элементы.Добавить("гф_ГруппаОтгрузкиЗаказов",Тип("ГруппаФормы"), );
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = ИСТИНА;
	НовыйЭлемент.Заголовок = "Отгрузка заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ДатаНачалаОтгрузкиЗаказов",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаОтгрузкиЗаказов";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ДатаОкончанияОтгрузкиЗаказов",Тип("ПолеФормы"),ЭтаФорма.Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияОтгрузкиЗаказов"; 
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ДатаОкончанияРедактированияСкидок",Тип("ПолеФормы"),);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияРедактированияСкидок";
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("гф_ДатаИзготовления",Тип("ПолеФормы"),);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаИзготовления";

	НовыйЭлемент = Этаформа.Элементы.Добавить("гф_ГруппаЕРП", Тип("ГруппаФормы"), );
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = ЛОЖЬ;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	Элементы.Переместить(ЭтаФорма.Элементы.Родитель, ЭтаФорма.Элементы.гф_ГруппаЕРП, ); 
	Элементы.Переместить(ЭтаФорма.Элементы.ГруппаДатаНачалаОкончания, ЭтаФорма.Элементы.гф_ГруппаЕРП, ЭтаФорма.Элементы.Родитель);
	Элементы.Переместить(ЭтаФорма.Элементы.ГруппаУправлениеКоллекцией, ЭтаФорма.Элементы.гф_ГруппаЕРП, ЭтаФорма.Элементы.ГруппаДатаНачалаОкончания);
	// -- Галфинд_Домнышева_30_06_2022

КонецПроцедуры
