#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ Галфинд_Домнышева_30_06_2022

	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаНаименованиеКод", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("Код", ТипПолеФормы, ЭтотОбъект.Элементы.гф_ГруппаНаименованиеКод);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Код";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.Наименование, ЭтотОбъект.Элементы.гф_ГруппаНаименованиеКод, 
						ЭтотОбъект.Элементы.Код);
	
    НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_НомерГодЛимит", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Номер", ТипПолеФормы, ЭтотОбъект.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Номер";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Год", ТипПолеФормы, ЭтотОбъект.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Год";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ТехническийЛимит", ТипПолеФормы,
	               ЭтотОбъект.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТехническийЛимит";   
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаФормированиеЗаказов", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Формирование заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаНачалаФормированияЗаказов", ТипПолеФормы,
				ЭтотОбъект.Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаФормированияЗаказов";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаОкончанияФормированияЗаказов", ТипПолеФормы,
				ЭтотОбъект.Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияФормированияЗаказов"; 
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаОтгрузкиЗаказов", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Отгрузка заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаНачалаОтгрузкиЗаказов", ТипПолеФормы,
					ЭтотОбъект.Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаОтгрузкиЗаказов";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаОкончанияОтгрузкиЗаказов", ТипПолеФормы,
					ЭтотОбъект.Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияОтгрузкиЗаказов"; 
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаОкончанияРедактированияСкидок", ТипПолеФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияРедактированияСкидок";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаИзготовления", ТипПолеФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаИзготовления";

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаЕРП", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	Элементы.Переместить(ЭтотОбъект.Элементы.Родитель, ЭтотОбъект.Элементы.гф_ГруппаЕРП); 
	Элементы.Переместить(ЭтотОбъект.Элементы.ГруппаДатаНачалаОкончания, ЭтотОбъект.Элементы.гф_ГруппаЕРП, 
						ЭтотОбъект.Элементы.Родитель);
	Элементы.Переместить(ЭтотОбъект.Элементы.ГруппаУправлениеКоллекцией, ЭтотОбъект.Элементы.гф_ГруппаЕРП, 
						ЭтотОбъект.Элементы.ГруппаДатаНачалаОкончания);
	// -- Галфинд_Домнышева_30_06_2022

КонецПроцедуры

#КонецОбласти