#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ Галфинд_Домнышева_30_06_2022
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаНаименованиеКод", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("Код", Тип("ПолеФормы"), ЭтотОбъект.Элементы.гф_ГруппаНаименованиеКод);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Код";
	
	Элементы.Переместить(ЭтотОбъект.Элементы.Наименование, ЭтотОбъект.Элементы.гф_ГруппаНаименованиеКод, 
						ЭтотОбъект.Элементы.Код);
	
    НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_НомерГодЛимит", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Номер", Тип("ПолеФормы"), ЭтотОбъект.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Номер";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_Год", Тип("ПолеФормы"), ЭтотОбъект.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Год";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ТехническийЛимит", Тип("ПолеФормы"),
	               ЭтотОбъект.Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТехническийЛимит";   
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаФормированиеЗаказов", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Формирование заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаНачалаФормированияЗаказов", Тип("ПолеФормы"),
				ЭтотОбъект.Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаФормированияЗаказов";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаОкончанияФормированияЗаказов", Тип("ПолеФормы"),
				ЭтотОбъект.Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияФормированияЗаказов"; 
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаОтгрузкиЗаказов", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Отгрузка заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаНачалаОтгрузкиЗаказов", Тип("ПолеФормы"),
					ЭтотОбъект.Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаОтгрузкиЗаказов";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаОкончанияОтгрузкиЗаказов", Тип("ПолеФормы"),
					ЭтотОбъект.Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияОтгрузкиЗаказов"; 
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаОкончанияРедактированияСкидок", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияРедактированияСкидок";
	
	НовыйЭлемент = ЭтотОбъект.Элементы.Вставить("гф_ДатаИзготовления", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаИзготовления";

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_ГруппаЕРП", Тип("ГруппаФормы"));
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	Элементы.Переместить(ЭтотОбъект.Элементы.Родитель, ЭтотОбъект.Элементы.гф_ГруппаЕРП); 
	Элементы.Переместить(ЭтотОбъект.Элементы.ГруппаДатаНачалаОкончания, ЭтотОбъект.Элементы.гф_ГруппаЕРП, 
						ЭтотОбъект.Элементы.Родитель);
	Элементы.Переместить(ЭтотОбъект.Элементы.ГруппаУправлениеКоллекцией, ЭтотОбъект.Элементы.гф_ГруппаЕРП, 
						ЭтотОбъект.Элементы.ГруппаДатаНачалаОкончания);
	// -- Галфинд_Домнышева_30_06_2022

КонецПроцедуры

#КонецОбласти