
Функция СформироватьДоступныеРостовки(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатуры.Владелец КАК Номенклатура,
	|	ВариантыКомплектацииНоменклатуры.Характеристика.Наименование КАК ХарактеристикаНаименование
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|ГДЕ
	|	ВариантыКомплектацииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|	И ВариантыКомплектацииНоменклатуры.Владелец = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХарактеристикаНаименование";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ПерваяСтрока = Истина;
	ДоступныеРостовки = "";
	Пока Результат.Следующий() Цикл
		
		Если ПерваяСтрока Тогда
			ДоступныеРостовки = Результат.ХарактеристикаНаименование;
			ПерваяСтрока = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДоступныеРостовки = ДоступныеРостовки + " ; " + Результат.ХарактеристикаНаименование; 
		
	КонецЦикла;	
	
	Возврат ДоступныеРостовки;
	
КонецФункции	
	
	