
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ЕстьОграничения = Справочники.КонтактныеЛицаПартнеров.гф_ЕстьОграниченияДоступаКонтакныхЛиц(ТекущийПользователь);
	ГруппаДоступа = Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();
	Если НЕ ЕстьОграничения Тогда
		Если Параметры.Свойство("ГруппаДоступа") Тогда
			ГруппаДоступа = Параметры.ГруппаДоступа
		КонецЕсли;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЕстьОграничения", ЕстьОграничения, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ГруппаДоступа", ГруппаДоступа, Истина);
КонецПроцедуры
