
&Вместо("ОтразитьДанныеДокументовВРеестре")
Процедура гф_ОтразитьДанныеДокументовВРеестре(ОбъектыМетаданных)
	
	// vvv Галфинд \ Sakovich 17.04.2023
	ОбъектыМетаданных.Удалить(Метаданные.Документы.гф_СпецификацияПокупателя);
	// ^^^ Галфинд \ Sakovich 17.04.2023
	
	ПродолжитьВызов(ОбъектыМетаданных);
КонецПроцедуры

&ИзменениеИКонтроль("ТипыДокументовРеестра")
Функция гф_ТипыДокументовРеестра()

	ТипыСсылки = Метаданные.РегистрыСведений.РеестрДокументов.Измерения.Ссылка.Тип.Типы();

	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.ВводОстатков"));
	//++ Локализация
	ИсключаемыеТипы.Очистить();
	//-- Локализация

	#Вставка
	// vvv Галфинд \ Sakovich 17.04.2023
	ИсключаемыеТипы.Добавить(Тип("ДокументСсылка.гф_СпецификацияПокупателя"));
	// ^^^ Галфинд \ Sakovich 17.04.2023 
	#КонецВставки
	Если ИсключаемыеТипы.Количество() Тогда
		ТипыДокументов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ТипыСсылки, ИсключаемыеТипы);
	Иначе
		ТипыДокументов = ТипыСсылки;
	КонецЕсли;

	Возврат ТипыДокументов;

КонецФункции
