
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ЕстьОграничения = Справочники.КонтактныеЛицаПартнеров.гф_ЕстьОграниченияДоступаКонтакныхЛиц(ТекущийПользователь);
	Если ЕстьОграничения Тогда
		Список.ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СправочникКонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	СправочникКонтактныеЛицаПартнеров.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникКонтактныеЛицаПартнеров.Предопределенный КАК Предопределенный,
		|	СправочникКонтактныеЛицаПартнеров.Владелец КАК Владелец,
		|	СправочникКонтактныеЛицаПартнеров.Наименование КАК Наименование,
		|	СправочникКонтактныеЛицаПартнеров.ДолжностьПоВизитке КАК ДолжностьПоВизитке,
		|	СправочникКонтактныеЛицаПартнеров.ДатаРегистрацииСвязи КАК ДатаРегистрацииСвязи,
		|	СправочникКонтактныеЛицаПартнеров.ДатаПрекращенияСвязи КАК ДатаПрекращенияСвязи,
		|	СправочникКонтактныеЛицаПартнеров.Автор КАК Автор,
		|	СправочникКонтактныеЛицаПартнеров.Комментарий КАК Комментарий,
		|	СправочникКонтактныеЛицаПартнеров.Представление КАК Представление,
		|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица КАК РольКонтактногоЛица,
		|	СправочникКонтактныеЛицаПартнеров.Пол КАК Пол,
		|	СправочникКонтактныеЛицаПартнеров.ДатаРождения КАК ДатаРождения
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК СправочникКонтактныеЛицаПартнеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
		|		ПО СправочникКонтактныеЛицаПартнеров.Ссылка = КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка
		|			И (КонтактныеЛицаПартнеровРолиКонтактногоЛица.НомерСтроки = 1)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			КонтактныеЛицаПартнеровгф_ГруппыДоступа.Ссылка КАК Ссылка
		|		ИЗ
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		// #wortmann { 
		// Сейчас пользователи находятся в составе группы пользователей 
		// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee3c16091b60dc
		// Галфинд_Домнышева 2023/08/21
		//|				ГруппыДоступаПользователи.Ссылка КАК Ссылка
		//|			ИЗ
		//|				Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		//|			ГДЕ
		//|				ГруппыДоступаПользователи.Пользователь = &ТекущийПользователь)
		|		ГруппыДоступаПользователи.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|	ГДЕ
		|		(ГруппыДоступаПользователи.Пользователь = &ТекущийПользователь
		|				ИЛИ ГруппыДоступаПользователи.Пользователь В
		|					(ВЫБРАТЬ
		|						ГруппыПользователейСостав.Ссылка
		|					ИЗ
		|						Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
		|					ГДЕ
		|						ГруппыПользователейСостав.Пользователь = &ТекущийПользователь)))
		// } #wortmann
		|				КАК ГруппыДоступаПользователя
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.гф_ГруппыДоступа КАК КонтактныеЛицаПартнеровгф_ГруппыДоступа
		|				ПО ГруппыДоступаПользователя.Ссылка = КонтактныеЛицаПартнеровгф_ГруппыДоступа.ГруппаДоступа) КАК РазрешенныеПоГруппамДоступа
		|		ПО СправочникКонтактныеЛицаПартнеров.Ссылка = РазрешенныеПоГруппамДоступа.Ссылка";
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущийПользователь", ТекущийПользователь, Истина);
	КонецЕсли;

КонецПроцедуры
