&ИзменениеИКонтроль("ПредставлениеНоменклатуры")
Функция гф_ПредставлениеНоменклатуры(Номенклатура, Характеристика, Упаковка = "", Серия = "", Назначение = "") Экспорт

	СтрПредставление = СокрЛП(Номенклатура);
	#Вставка
	// Галфинд \ Shtak  2024/01/30  =>
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		СтруктураРеквизитов = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Номенклатура, "Артикул");
		Артикул = СтруктураРеквизитов.Артикул;
		СтрПредставление = СокрЛП(Артикул) + " / " +СтрПредставление;
	КонецЕсли;
	// Галфинд \ Shtak  2024/01/30 <=
	#КонецВставки

	Если ЗначениеЗаполнено(Характеристика)Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Характеристика);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Назначение) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Назначение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Серия) Тогда
		СтрПредставление = СтрПредставление + " / " + СокрЛП(Серия);
	КонецЕсли;

	Возврат СтрПредставление;

КонецФункции
