
&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, Замещение)
	// #wortmann { 
	// Проверка на Уникальность ШК
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eeb9c2a2c92914
	// Галфинд_Домнышева 2024/01/23	
	Для Каждого Запись из ЭтотОбъект Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_ПересортицаУдаляемыеШК.Пересортица КАК Пересортица,
		|	гф_ПересортицаУдаляемыеШК.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	РегистрСведений.гф_ПересортицаУдаляемыеШК КАК гф_ПересортицаУдаляемыеШК
		|ГДЕ
		|	гф_ПересортицаУдаляемыеШК.ШтрихкодУпаковки = &ШтрихкодУпаковки";
		
		Запрос.УстановитьПараметр("ШтрихкодУпаковки", Запись.ШтрихкодУпаковки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сообщение = "По выбранному КМ " + Выборка.ШтрихкодУпаковки + " уже есть запись по документу " + Выборка.Пересортица;
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, ЭтотОбъект, ЭтотОбъект, Сообщение);

		КонецЦикла;
		  Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	// } #wortmann
КонецПроцедуры
