#Область ОбработчикиСобытийФормы 
// #wortmann {
// Условное оформление для формы
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	УстановитьУсловноеОформление();
 	
КонецПроцедуры
// } #wortmann

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы 
// #wortmann {
// Условное оформление для формы
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
 УстановитьУсловноеОформление();
КонецПроцедуры
// } #wortmann 

// #wortmann {
// В зависимости от вида операции,указание опреденных статусов документа.
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/01
&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка=Ложь; 
	
	Если Объект.ВидОперации=ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.гф_ВидыОперацийЛимита.УстановкаЛимита") Тогда
		
		Массив=Новый Массив;
		Массив.Добавить(Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Действующий")));
		Массив.Добавить(Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Запрошен")));
		Массив.Добавить(Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Утвержден")));
		
		Отбор=Новый	Структура;
		Отбор.Вставить("Наименование",Массив);  
	Иначе
		Отбор=Новый	Структура;
		Отбор.Вставить("Наименование",Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Приостановлен")));  	
	КонецЕсли;  
	П=Новый Структура("Отбор",Отбор);
	ОткрытьФорму("Справочник.гф_СтатусыЛимитов.ФормаВыбора",П); 
	
КонецПроцедуры
// } #wortmann

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область УсловноеОформление
// #wortmann {
// Если вид операции "снятие лимита",сумма недоступна для редактирования   и установка статус для данного вида операции
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30
&НаСервере
Процедура УстановитьУсловноеОформление()   
	
	Если Объект.ВидОперации=Перечисления.гф_ВидыОперацийЛимита.СнятиеЛимита Тогда 
	    Элементы.Сумма.Доступность=Ложь;
		Объект.Сумма=0;
		Объект.Статус=ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Приостановлен");  
	КонецЕсли;  

КонецПроцедуры
// } #wortmann
#КонецОбласти
#КонецОбласти
