#Область ОбработчикиСобытийФормы 
// #wortmann {
// Условное оформление для формы
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	УстановитьУсловноеОформление();
 	
КонецПроцедуры
// } #wortmann

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы 
// #wortmann {
// Условное оформление для формы
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
 УстановитьУсловноеОформление();	
КонецПроцедуры
// } #wortmann 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область УсловноеОформление
// #wortmann {
// При установленном виде операции "снятие лимита",сумма недоступна для редактирования
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30
&НаСервере
Процедура УстановитьУсловноеОформление()   
	
	Если Объект.ВидОперации=Перечисления.гф_ВидыОперацийЛимита.СнятиеЛимита Тогда 
	    Элементы.Сумма.Доступность=Ложь;
		Объект.Сумма=0;
	КонецЕсли;  

КонецПроцедуры
// } #wortmann
#КонецОбласти
#КонецОбласти
