#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edc30156a893ed
	// гф_возвратWMN устанавливается в ИСТИНА, если корректировка реализации создается по кнопке
	//из документа "ЗаявкаНаВозвратТоваровОтКлиента"
	// Галфинд Sakovich 2023/03/16
	Если гф_возвратWMN Тогда
		// не делать движений по рС ОтражениеДокументовВМеждународномУчете
		НаборОтражениеДокументовВМеждународномУчете = Движения.ОтражениеДокументовВМеждународномУчете;
		НаборОтражениеДокументовВМеждународномУчете.Прочитать();
		Если НаборОтражениеДокументовВМеждународномУчете.Количество() Тогда
			НаборОтражениеДокументовВМеждународномУчете.Очистить();
			НаборОтражениеДокументовВМеждународномУчете.Записать();
		КонецЕсли;
		ДополнительныеСвойства.Вставить("НеРегистрироватьКОтражениюВМеждународномУчете", Истина);
	КонецЕсли;
	// } #wortmann
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли