#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edc30156a893ed
	// гф_возвратWMN устанавливается в ИСТИНА, если корректировка реализации создается по кнопке
	//из документа "ЗаявкаНаВозвратТоваровОтКлиента"
	// Галфинд Sakovich 2023/03/15
	Если гф_возвратWMN Тогда
		//документ не делает никаких движений
		Для каждого НаборДвижений Из Движения Цикл
			НаборДвижений.Записывать = Ложь;
		КонецЦикла;	
	КонецЕсли;
	// } #wortmann
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли