#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяЗапись	= Параметры.УчетнаяЗапись;
	АдресНастроек	= Параметры.АдресНастроек;   
	
    СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновки");    
	
	АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки , УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновки);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(ПолучитьИзВременногоХранилища(АдресНастроек));
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПоместитьНастройкиВХранилище()
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПоместитьВоВременноеХранилище(Настройки, АдресНастроек);
	
КонецПроцедуры	

&НаКлиенте
Процедура Выбрать(Команда)              
	
	ПоместитьНастройкиВХранилище();
	
	Результат = Новый Структура;
	
	Результат.Вставить("УчетнаяЗапись",	УчетнаяЗапись);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
