
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ЗначениеВыбора = Параметры.Значение;
	
	Если ЗначениеВыбора = 1 Тогда
		ЗаполнитьТаблицуСвойствами();
	Иначе  
		ЗаполнитьТаблицуРеквизитами();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСвойствами()
	
	НаборСвойствНоменклатураРодитель = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Номенклатура"); 
	НаборСвойствНоменклатура = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Общие",,НаборСвойствНоменклатураРодитель); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Наименование КАК Наименование,
		|	ДополнительныеРеквизитыИСведения.Заголовок КАК Заголовок
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";
	
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойствНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    ТаблицаСвойств = РезультатЗапроса.Выгрузить();
	
	ТаблицаСвойств.Сортировать("Наименование");
	Для Каждого Свойство Из ТаблицаСвойств Цикл 
		СписокЗначенийРС.Добавить(Свойство.Наименование, Свойство.Заголовок);		
	КонецЦикла;
 	СписокЗначенийРС.Добавить("ШтрихКод", "Штрих-код");		
   //СписокЗначенийРС.СортироватьПоПредставлению();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитами()
	
	Для Каждого Реквизит Из Метаданные.Справочники.Номенклатура.Реквизиты Цикл 
		СписокЗначенийРС.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	//Для Каждого Реквизит Из Метаданные.Справочники.Номенклатура.СтандартныеРеквизиты Цикл 
	//	СписокЗначенийРС.Добавить(Реквизит.Имя, Реквизит.Синоним);
	//КонецЦикла;

	//Для Каждого Элемент Из СписокЗначенийРС Цикл
	//	Если Элемент.Представление = "" ИЛИ Элемент.Значение = "Предопределенный"
	//		ИЛИ Элемент.Значение = "ПометкаУдаления" Тогда
	//		 СписокЗначенийРС.Удалить(Элемент);
	//	 КонецЕсли;
	//КонецЦикла;

	СписокЗначенийРС.Добавить("Наименование", "Наименование");
	СписокЗначенийРС.Добавить("Родитель", "Родитель");
	СписокЗначенийРС.Добавить("Код", "Код");
	
	//СписокЗначенийРС.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийРСВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("Значение", СписокЗначенийРС[Значение].Значение);
	СтруктураЗначений.Вставить("Представление", СписокЗначенийРС[Значение].Представление);
    СтруктураЗначений.Вставить("ТипДопСведения", ?(ЗначениеВыбора = 1, "Свойство", "Реквизит"));
	
	Закрыть(СтруктураЗначений);

КонецПроцедуры
