
&После("ЗаполнитьПоДокументуОснованию")
Процедура гф_ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)
	// ++ Галфинд_Домнышева 2023/04/10
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8131bcee7bda45d711edd1f8febddfd6
	// При формировании на осн КорректировкаРеализации (отсутствуют движения при гф_возвратWMN)
	// рквизиты КППКонтрагента и ИННКонтрагента не заполнены - заполняем их.
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) И
		(Не ДанныеЗаполнения.Свойство("ИННКонтрагента") ИЛИ Не ДанныеЗаполнения.Свойство("КППКонтрагента")) Тогда
		ДанныеЗаполнения.Вставить("КППКонтрагента", ДанныеЗаполнения.Контрагент.КПП);
		ДанныеЗаполнения.Вставить("ИННКонтрагента", ДанныеЗаполнения.Контрагент.ИНН);
	КонецЕсли;
    // -- Галфинд_Домнышева 2023/04/10
КонецПроцедуры

&После("ПриЗаписи")
Процедура гф_ПриЗаписи(Отказ)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("гф_УстановленНовыйНомер") Тогда
		НомерОрдера = "0000000";
		ЕстьРТиУ = Ложь;
		// Номер ордера
		Для каждого СтрДок Из ЭтотОбъект.ДокументыОснования Цикл
			ТекДок = СтрДок.ДокументОснование;
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ЕстьРТиУ = Истина;
				текРасходныйОрдер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДок, "гф_РасходныйОрдер");
				Если ЗначениеЗаполнено(текРасходныйОрдер) Тогда
					НомерОрдера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текРасходныйОрдер, "Номер");
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьРТиУ Тогда
			Номер =  Документы.РеализацияТоваровУслуг.ПолучитьНомерДокументаСУчетомРасходногоОрдера(Номер, НомерОрдера);
			УстановитьПредставлениеНомера();
		КонецЕсли;
		
		ДополнительныеСвойства.Удалить("гф_УстановленНовыйНомер");
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура гф_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДополнительныеСвойства.Вставить("гф_УстановленНовыйНомер"); 
КонецПроцедуры

