
&После("ЗаполнитьПоДокументуОснованию")
Процедура гф_ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)
	// ++ Галфинд_Домнышева 2023/04/10
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8131bcee7bda45d711edd1f8febddfd6
	// При формировании на осн КорректировкаРеализации (отсутствуют движения при гф_возвратWMN)
	// рквизиты КППКонтрагента и ИННКонтрагента не заполнены - заполняем их.
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) И
		(Не ДанныеЗаполнения.Свойство("ИННКонтрагента") ИЛИ Не ДанныеЗаполнения.Свойство("КППКонтрагента")) Тогда
		ДанныеЗаполнения.Вставить("КППКонтрагента", ДанныеЗаполнения.Контрагент.КПП);
		ДанныеЗаполнения.Вставить("ИННКонтрагента", ДанныеЗаполнения.Контрагент.ИНН);
	КонецЕсли;
    // -- Галфинд_Домнышева 2023/04/10
КонецПроцедуры

&После("ПриЗаписи")
Процедура гф_ПриЗаписи(Отказ)
	// Галфинд СадомцевСА 14.02.2024 Перенес код в процедуру Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Если Отказ Тогда
	//	Возврат;
	//КонецЕсли;

	//Если ДополнительныеСвойства.Свойство("гф_УстановленНовыйНомер") Тогда
	//	НомерОрдера = "0000000";
	//	ЕстьРТиУ = Ложь;
	//	// Номер ордера
	//	Для каждого СтрДок Из ЭтотОбъект.ДокументыОснования Цикл
	//		ТекДок = СтрДок.ДокументОснование;
	//		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	//			ЕстьРТиУ = Истина;
	//			текРасходныйОрдер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДок, "гф_РасходныйОрдер");
	//			Если ЗначениеЗаполнено(текРасходныйОрдер) Тогда
	//				НомерОрдера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текРасходныйОрдер, "Номер");
	//			КонецЕсли;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если ЕстьРТиУ Тогда
	//		Номер =  Документы.РеализацияТоваровУслуг.ПолучитьНомерДокументаСУчетомРасходногоОрдера(Номер, НомерОрдера);
	//		УстановитьПредставлениеНомера();
	//	КонецЕсли;
	//	
	//	ДополнительныеСвойства.Удалить("гф_УстановленНовыйНомер");
	//	Записать(РежимЗаписиДокумента.Запись);
	//КонецЕсли;
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура гф_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДополнительныеСвойства.Вставить("гф_УстановленНовыйНомер"); 
КонецПроцедуры


&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// ++ Галфинд СадомцевСА 14.02.2024 Перенес код из процедуры Процедура гф_ПриЗаписи(Отказ)
	// в процедуру Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eec0143b77b47b
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("гф_УстановленНовыйНомер") Тогда
		НомерОрдера = "0000000";
		ЕстьРТиУ = Ложь;
		// Номер ордера
		Для каждого СтрДок Из ЭтотОбъект.ДокументыОснования Цикл
			ТекДок = СтрДок.ДокументОснование;
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ЕстьРТиУ = Истина;
				текРасходныйОрдер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДок, "гф_РасходныйОрдер");
				Если ЗначениеЗаполнено(текРасходныйОрдер) Тогда
					НомерОрдера = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текРасходныйОрдер, "Номер");
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьРТиУ Тогда
			Номер =  Документы.РеализацияТоваровУслуг.ПолучитьНомерДокументаСУчетомРасходногоОрдера(Номер, НомерОрдера);
			УстановитьПредставлениеНомера();
		КонецЕсли;
		
		ДополнительныеСвойства.Удалить("гф_УстановленНовыйНомер");
		// Убрал лишний вызов т.к. платформа сама запишет изменения
		// Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	// -- Галфинд СадомцевСА
КонецПроцедуры

