
&НаКлиенте
Процедура Применить(Команда)
	Результат = Новый Структура();
	Результат.Вставить("ВидимостьКонтрагент", ВидимостьКонтрагент);
	Результат.Вставить("ВидимостьСклад", ВидимостьСклад);
	Результат.Вставить("ВидимостьСумма", ВидимостьСумма);
	Результат.Вставить("ВидимостьКомментарий", ВидимостьКомментарий);
	Закрыть(Результат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьКонтрагент = Параметры["ВидимостьКонтрагент"];
	ВидимостьСклад = Параметры["ВидимостьСклад"];
	ВидимостьСумма = Параметры["ВидимостьСумма"];
	ВидимостьКомментарий = Параметры["ВидимостьКомментарий"];
КонецПроцедуры
