&После("ОбработкаРасшифровки")
Процедура гф_ОбработкаРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	ПолноеИмяОтчета = ФормаОтчета.НастройкиОтчета.ПолноеИмя;
	КлючТекущегоВарианта = ФормаОтчета.КлючТекущегоВарианта;
	Если ПолноеИмяОтчета = "Отчет.гф_ОтчетПоДебиторскойЗадолженности" 
		И КлючТекущегоВарианта="receivablec" Тогда

		СтандартнаяОбработка = Ложь;
		гф_ОбработатьРасшифровку_receivablec(ФормаОтчета, Расшифровка);
	КонецЕсли;
КонецПроцедуры

// Вызывается для отчета "Карта продаж по регионам"
//
Процедура гф_ОбработатьРасшифровку_receivablec(ФормаОтчета, Расшифровка)
	
	СписокПараметров = Новый Массив;
	
	СписокПараметров.Добавить("ДанныеОтчета");
	
	ПоляРасшифровки = Новый Массив;
	ПоляРасшифровки.Добавить("РасчетныйДокумент");
	ПоляРасшифровки.Добавить("Партнер");
	ПоляРасшифровки.Добавить("Договор");
	
	ДанныеРасшифровкиОтчета = КомпоновкаДанныхВызовСервера.ПараметрыФормыРасшифровки(
	Расшифровка,
	ФормаОтчета.ОтчетДанныеРасшифровки,
	СписокПараметров,
	ПоляРасшифровки);
	
	Если ДанныеРасшифровкиОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта",                   "receivablecПоДокументам");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",        Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов",Ложь);
	ПараметрыФормы.Вставить("РежимРасшифровки",               Истина);
	
	Отбор = Новый Структура;
	Для каждого ЭС  Из ДанныеРасшифровкиОтчета Цикл
		Если ЭС.Ключ = "Отбор" Тогда
			
		Иначе	
			Отбор.Вставить(ЭС.Ключ, ЭС.Значение); 
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Отчет.гф_ОтчетПоДебиторскойЗадолженности.Форма", ПараметрыФормы, ФормаОтчета, Истина);
КонецПроцедуры
