
&НаСервереБезКонтекста
Функция ИК_ПроверитьПодключениеНаСервере(Организация)

	ПараметрыПодключения = гф_ИнтеграцияСервер.ПолучитьПараметрыПодключенияКHTTPСервису(Организация);
	СоединениеССервисом = гф_ИнтеграцияСервер.ПолучитьСоединениеСHTTPСервисом(ПараметрыПодключения);

	//ИмяПубликации = ПараметрыПодключения.ИмяПубликации;
	//Если Лев(ИмяПубликации, 1) <> "/" Тогда
	//	ИмяПубликации = "/" + ИмяПубликации;
	//КонецЕсли;

	Ключ = "?apikey=" + ПараметрыПодключения.Ключ;
	Запрос = "/v3/brands" + Ключ;

	АдресЗапроса = Запрос; // произвольный запрос	
	HTTPЗапрос = Новый HTTPЗапрос(АдресЗапроса);

	Возврат гф_ИнтеграцияСервер.ОтправитьЗапросЧерезСоединение(HTTPЗапрос, СоединениеССервисом, Истина);

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ПроверитьПодключение")
Процедура ИК_ПроверитьПодключение(Команда)

	Если Модифицированность Тогда
		ПоказатьПредупреждение(,"Перед проверкой необходимо записать настройки подключения!", 20);
		Возврат;
	КонецЕсли;

#Вставка
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		ПоказатьПредупреждение(,"В настройках не заполнена Организация!", 20);
		Возврат;
	КонецЕсли;	
	
	РезультатПодключения = ИК_ПроверитьПодключениеНаСервере(Запись.Организация);
#КонецВставки
#Удаление
	РезультатПодключения = ПроверитьПодключениеНаСервере();
#КонецУдаления

	Если РезультатПодключения.КодСостояния = 200 Тогда
		ПоказатьПредупреждение(,"Подключение к сервису интеграции с национальным каталогом успешно установлено", 20);
	Иначе
		Сообщить("Не удалось подключиться к сервису национального каталога" + ?(ЗначениеЗаполнено(РезультатПодключения.КодСостояния), " (код ответа: " + РезультатПодключения.КодСостояния + ")", "") + ":  
		|" + ?(ЗначениеЗаполнено(РезультатПодключения.ТекстОтвета), РезультатПодключения.ТекстОтвета, РезультатПодключения.ТекстОшибки));
	КонецЕсли;

КонецПроцедуры
