
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	гф_СоздатьНовыеРеквизиты();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_СоздатьНовыеРеквизиты()
	
	КвалификаторыСтроки	= Новый КвалификаторыСтроки(256);
	
	ОписаниеТиповОрганизация		= Новый ОписаниеТипов("СправочникСсылка.Организации");
	ОписаниеТиповКонтрагенты		= Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ОписаниеТиповБулево				= Новый ОписаниеТипов("Булево");
	ОписаниеТиповСтрока 			= Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);

	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитФормы_гф_Контрагент		= Новый РеквизитФормы("гф_Контрагент",
										ОписаниеТиповКонтрагенты, , "Контрагент", Истина);

	РеквизитФормы_гф_Организация	= Новый РеквизитФормы("гф_Организация",
										ОписаниеТиповОрганизация, , "Организация", Истина);	
										
	РеквизитФормы_гф_БезРезерва		= Новый РеквизитФормы("гф_БезРезерва",
										ОписаниеТиповБулево, , "Без резерва", Истина);	
										
	РеквизитФормы_гф_Комментарий	= Новый РеквизитФормы("гф_Комментарий",
										ОписаниеТиповСтрока, , "Комментарий", Истина);
										
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_Контрагент);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_Организация);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_БезРезерва);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_Комментарий);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ТипПолеФормы = Тип("ПолеФормы");
	
	НовоеПоле = Элементы.Добавить("гф_Организация", ТипПолеФормы, Элементы.ОсновноеПраво);
	
	НовоеПоле.Вид							= ВидПоляФормы.ПолеВвода;
	НовоеПоле.АвтоОтметкаНезаполненного 	= Истина;
	НовоеПоле.Видимость						= Истина;
	НовоеПоле.ПутьКДанным					= "Объект.гф_Организация";
	
	НовоеПоле = Элементы.Добавить("гф_Контрагент", ТипПолеФормы, Элементы.ОсновноеПраво);
	
	НовоеПоле.Вид					= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость				= Истина;
	НовоеПоле.ПутьКДанным			= "Объект.гф_Контрагент"; 	
		
	НовоеПоле = Элементы.Добавить("гф_БезРезерва", ТипПолеФормы, Элементы.ОсновноеПраво);
	
	НовоеПоле.Вид					= ВидПоляФормы.ПолеФлажка;
	НовоеПоле.Видимость				= Истина;
	НовоеПоле.ПутьКДанным			= "Объект.гф_БезРезерва"; 
	
	НовоеПоле = Элементы.Добавить("гф_Комментарий", ТипПолеФормы);
	
	НовоеПоле.Вид					= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость				= Истина;
	НовоеПоле.ПутьКДанным			= "Объект.гф_Комментарий";
	
	НовоеПоле = Элементы.Добавить("гф_АгентскийСклад", Тип("ПолеФормы"), Элементы.ГруппаТипСкладаКолонки);
	
	НовоеПоле.Вид 					= ВидПоляФормы.ПолеПереключателя;
	НовоеПоле.Видимость				= Истина;
	НовоеПоле.ПутьКДанным 			= "Объект.гф_АгентскийСклад";
	НовоеПоле.Заголовок 			= "АгентскийСклад";
	НовоеПоле.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Право;
	
КонецПроцедуры	

#КонецОбласти      