Процедура УУ() Экспорт 

КонецПроцедуры

//Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
//	
//	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
//	
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гф_ПечатьЭтикетокГС1") Тогда
//		
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
//		КоллекцияПечатныхФорм,
//		"гф_ПечатьЭтикетокГС1",
//		НСтр("ru = 'гф_ПечатьЭтикетокГС1';
//		|en = 'gf_LabelPrint'"),
//		Обработки.гф_ПечатьЭтикетокГС1.ПечатьЭтикетки(Ложь));
//		
//	КонецЕсли;
//КонецПроцедуры


// Функция выводит на печать табличный документ.
// Открывает форму Печати документов, хаполняет печатный документ формы.
//
// Параметры:
//  ПечДокумент - ТабличныйДокумент
//  КоличествоЭкземпляров - число
//  НаПринтер - булево
//  Заголовок - строка, заголовок формы печати
//  Ссылка - Ссылка объекта печати
//
Функция НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", Ссылка = Неопределено, ПараметрыПечДокумента = Неопределено) Экспорт

	Если ПечДокумент = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;

	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;

	Если НЕ ПечДокумент.АвтоМасштаб
	   И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;

	Если ТипЗнч(НаПринтер) = Тип("Булево") Тогда
		Если НаПринтер Тогда
			ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
			ПечДокумент.Напечатать();
		Иначе
			//+CRM
			//Если  ПараметрыСеанса.CRM_ИспользоватьCRM = Истина Тогда
				//// Отобразить печатный документ на экране
				//ПечДокумент.ОтображатьЗаголовки = Ложь;
				//ПечДокумент.ОтображатьСетку     = Ложь;
				//// Волков
				////ПечДокумент.Защита              = УправлениеДопПравамиПользователей.ЗащитаТаблиц();
				//// Волков
				////		ПечДокумент.ТолькоПросмотр      = Истина;
				////		ПечДокумент.Показать(Заголовок);
				//
				//// Отобразить печатный документ на экране
				//КлючУникальности	= Новый УникальныйИдентификатор();
				//ФормаПечати			= ПолучитьОбщуюФорму("CRM_ПечатнаяФормаДокументов",,КлючУникальности);
				//ТабличныйДокумент	= ФормаПечати.ЭлементыФормы.ТабличныйДокумент;
				//
				//// Перенесем все настройки из табличного документа в поле табличного документа формы печати
				////+CRM УПП  при переходе на 8.2 перестали читаться неокторые свойсва
				////CRM УППСписокКопируемыхСвойств = "АвтоМасштаб,Защита,ИмяПараметровПечати,ИмяПринтера,ИмяСохраненияПоложенияОкна,ИтогиСнизу,ИтогиСправа,КодЯзыкаМакета,КоличествоЭкземпляров,НаправлениеПерехода,ОбластьПечати,ОриентацияСтраницы,ОтображатьГруппировки,ОтображатьЗаголовки,ОтображатьСетку,ПовторятьПриПечатиКолонки,ПовторятьПриПечатиСтроки,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,СохранятьСвойстваОтображения,ТекущаяОбласть,ТолькоПросмотр,ФиксацияСверху,ФиксацияСлева,ФиксированныйФон,ФоноваяКартинка,ЦветТекстаГруппировки,ЦветТекстаЗаголовков,ЦветФонаГруппировки,ЦветФонаЗаголовков,ЧерноБелыйПросмотр";
				//СписокКопируемыхСвойств = "АвтоМасштаб,Защита,ИмяПараметровПечати,ИмяПринтера,ИмяСохраненияПоложенияОкна,ИтогиСнизу,ИтогиСправа,КодЯзыкаМакета,КоличествоЭкземпляров,НаправлениеПерехода,ОбластьПечати,ОриентацияСтраницы,ОтображатьГруппировки,ОтображатьЗаголовки,ОтображатьСетку,ПовторятьПриПечатиКолонки,ПовторятьПриПечатиСтроки,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,СохранятьСвойстваОтображения,ТекущаяОбласть,ТолькоПросмотр,ФиксацияСверху,ФиксацияСлева,ФиксированныйФон,ФоноваяКартинка,ЧерноБелыйПросмотр";				
				////-CRM УПП
				//ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечДокумент,СписокКопируемыхСвойств);
				//ТабличныйДокумент.МасштабПечати			= ?(ПечДокумент.МасштабПечати			= Неопределено, 100,ПечДокумент.МасштабПечати);
				//ТабличныйДокумент.РазборПоКопиям		= ?(ПечДокумент.РазборПоКопиям			= Неопределено,ЛОЖЬ,ПечДокумент.РазборПоКопиям);
				//ТабличныйДокумент.ЧерноБелаяПечать		= ?(ПечДокумент.ЧерноБелаяПечать		= Неопределено,ЛОЖЬ,ПечДокумент.ЧерноБелаяПечать);
				////ТабличныйДокумент.ЭкземпляровНаСтранице	= ?(ПечДокумент.ЭкземпляровНаСтранице	= Неопределено,   0,ПечДокумент.ЭкземпляровНаСтранице);
				//
				//ФормаПечати.ЭлементыФормы.ТабличныйДокумент.Вывести(ПечДокумент);
				//
				//// Заполним необходимые переменные и откроем форму
				//ФормаПечати.Объект						= Ссылка;
				////		ФормаПечати.ДополнительноКПредставлению	= НазваниеПечатнойФормы;
				//Если ПараметрыПечДокумента <> Неопределено Тогда
				//	//+CRM_УПП добавлена проверка на тип "Структура"
				//	Если ТипЗнч(ПараметрыПечДокумента) = Тип("Структура") И ПараметрыПечДокумента.Свойство("СсылкаНаВнешнююОбработку") Тогда
				//	//-CRM_УПП	
				//		ПредставлениеЗаголовка = ПараметрыПечДокумента.СсылкаНаВнешнююОбработку.Наименование;
				//		Если ЗначениеЗаполнено(Ссылка) Тогда 
				//			ПредставлениеЗаголовка = ПредставлениеЗаголовка + " № " + ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка)
				//                  + " от " + Формат(Ссылка.Дата, "ДФ='дд ММММ гггг'") + " г.";
				//		КонецЕсли;
				//		ФормаПечати.ОбъектПредставление = ПредставлениеЗаголовка;
				//	Иначе
				//		ФормаПечати.ОбъектПредставление = Заголовок;
				//	КонецЕсли;	
				//Иначе
				//	ФормаПечати.ОбъектПредставление = Заголовок;
				//КонецЕсли;
				//ФормаПечати.Открыть();
				////CRM УПП Возврат;
				////+CRM УПП
			//Иначе
				//ФормаПечати = ПолучитьОбщуюФорму("ПечатьДокументов",, Новый УникальныйИдентификатор);
				ФормаПечати = ПолучитьФорму("ОбщаяФорма.ПечатьДокументов"); 
				ФормаПечати.ОбъектПечати     = Ссылка;
				ФормаПечати.ПечатныйДокумент = ПечДокумент;
				ФормаПечати.Заголовок        = Заголовок;
				// Волков
				//ФормаПечати.Защита           = УправлениеДопПравамиПользователей.ЗащитаТаблиц();
				// Волков
				ФормаПечати.ПараметрыПечатногоДокумента		= ПараметрыПечДокумента;
				ФормаПечати.Открыть();
			//КонецЕсли;
			//-CRM УПП
			//-CRM			
			Возврат ФормаПечати;
		КонецЕсли;
	ИначеЕсли ТипЗнч(НаПринтер) = Тип("Массив") Тогда
		ПечДокумент.Вывод = ИспользованиеВывода.Разрешить;
		ПечДокумент.Напечатать();

		НаПринтер.Добавить(ПечДокумент);
	КонецЕсли;
	Возврат Неопределено;
КонецФункции // НапечататьДокумент()
