#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
// #wortmann {
// Заполнение поля Ответственный по текущему пользователю 
// Заполнение документа при создании на основании
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&Вместо("ОбработкаЗаполнения")
Процедура гф_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.гф_БлокировкаРазблокировкаОтгрузок") Тогда
		ВидБлокировки = ДанныеЗаполнения.ВидБлокировки;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;  
		Если ДанныеЗаполнения.Заблокирован Тогда
			Заблокирован = Ложь;
		КонецЕсли;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный  = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры
// } #wortmann

// #wortmann {
// Формируем движения документа
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/05
&Вместо("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, Режим)
	
	Если Не ЗначениеЗаполнено(ВидБлокировки) Тогда
		 Отказ = Истина;
		 Сообщить("Не заполнен реквизит ""Вид блокировки""");
	     Возврат;
	КонецЕсли;
	 
	Если Заблокирован Тогда
		Движения.гф_ПричиныБлокировок.Записывать = Истина;
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Контрагент = Контрагент; 
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Заблокирован;
		Движение.Партнер = Партнер;
	Иначе
		Если Исключения Тогда 
		Движения.гф_ПричиныБлокировок.Записывать = Истина;
		// Разблокировка на текущую дату
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Контрагент = Контрагент;
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Заблокирован;
		Движение.Партнер = Партнер;
		// Блокировка на дату значения реквизита «действует до».
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = ДействуетДо;
		Движение.Контрагент = Контрагент;  
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Истина;
		Движение.Партнер = Партнер;
	Иначе
		
		Движения.гф_ПричиныБлокировок.Записывать = Истина;
		Движение = Движения.гф_ПричиныБлокировок.Добавить();
		Движение.Период = НачалоДня(Дата);
		Движение.Контрагент = Контрагент; 
		Движение.Организация=Организация;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ВидБлокировки = ВидБлокировки;
		Движение.Заблокирован = Заблокирован;
		Движение.Партнер = Партнер;

	КонецЕсли; 
	
	КонецЕсли;

КонецПроцедуры
 // } #wortmann
 
#КонецОбласти

#КонецЕсли
