#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// #wortmann {
	// #5.2.04
	// необходимо, чтобы при проведении назначение подставлялось автоматически
	// Галфинд Sakovich 2022/08/03
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПустоеНазначение = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
		НазначениеПоУмолчанию = _омОбщегоНазначенияВызовСервера.ПолучитьГлобальноеЗначение(
		"СлужебноеНазначениеДляТоваров",
		ПустоеНазначение);
		Для каждого стрТч Из ВыходныеИзделия Цикл
			Если Не ЗначениеЗаполнено(стрТч.Назначение) Тогда	
				стрТч.Назначение = НазначениеПоУмолчанию;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// } #wortmann
КонецПроцедуры

#КонецОбласти

#КонецЕсли
