
&НаКлиенте
Процедура гф_ИспользоватьГруппыДоступаНоменклатурыПриИзмененииВместо(Элемент)
	// #wortmann { 
	// Поставим вопрос до внесения полноценных изменений в систему
	// Галфинд_Домнышева 2024/03/06
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВопросПодтвердитьИзменениеГруппДоступа",
			ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОповещениеОЗавершении, 
			НСтр("ru = 'Изменить группы доступа номенклатуры?'", "ru"), РежимДиалогаВопрос.ДаНетОтмена, , 
			КодВозвратаДиалога.Да, "Изменение групп доступа номенклатуры");
    // } #wortmann
КонецПроцедуры

// #wortmann { 
// Продолжение изменений или возврат значения после вопроса
// Галфинд_Домнышева 2024/03/06
&НаКлиенте
Процедура ВопросПодтвердитьИзменениеГруппДоступа(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		 Подключаемый_ПриИзмененииРеквизита(ДополнительныеПараметры.Элемент);
	Иначе
		НаборКонстант.ИспользоватьГруппыДоступаНоменклатуры = НЕ НаборКонстант.ИспользоватьГруппыДоступаНоменклатуры;
		Возврат;
	КонецЕсли;

КонецПроцедуры// } #wortmann
