
&НаСервере
Процедура Команда1НаСервере(ТабДок)
	СтандартнаяОбработка = Ложь;     
	ОбъектОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	
	СКДНастроек = ОбъектОтчетНаСервере.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	ТекстЗапроса = СКДНастроек.НаборыДанных.НаборДанных1.Запрос;
	//Меняем текст запроса так, чтобы первая временная таблица принимала через параметр нашу таблицу значений:

	 ТекстЗапроса = СтрЗаменить(ТекстЗапроса,

	"ВТ КАК ВТ",

	"&ВТ КАК ВТ");

	 

	Запрос = Новый Запрос;

	Запрос.Текст = ТекстЗапроса;
//	     Затем формируем отчет програмным способом, при этом подменяя набор данных — вместо набора запроса подставляем эквивалентный набор данных типа объект:

	настройкиСКД = СКДНастроек.ВариантыНастроек.Найти("Основной").Настройки;
	ТЧТабл = ОбъектОтчетНаСервере.ТЧ.Выгрузить();    
	
	ТЧТабл.ЗаполнитьЗначения(ОбъектОтчетНаСервере.Контрагент,"Контрагент");
    Запрос.УстановитьПараметр("ВТ",ТЧТабл);
	 

	ТабДанных = Запрос.Выполнить().Выгрузить();

	ВнешниеНаборыДанных = Новый Структура; 
	//ЭтотОбъект

	
	
	//ИтоговыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	//Можем редактировать настройки компоновки (ИтоговыеНастройки) 
	
//	ТЧТабл = ОбъектОтчетНаСервере.ТЧ.Выгрузить();   
	//ВнешниеНаборыДанных.Вставить("ВТ", ТЧТабл);
	ВнешниеНаборыДанных.Вставить("ВТ", ТабДанных);
	//ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ВТ");
	//ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	//ПараметрСКД.Значение = ТЧ.Выгрузить();
	//ПараметрСКД.Использование = Истина;
   //Макет компоновки

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

 

	ВнешнийНД = СКДНастроек.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));

	ИмяНД = СКДНастроек.НаборыДанных[0].Имя;

	ЗаполнитьЗначенияСвойств(ВнешнийНД, СКДНастроек.НаборыДанных.НаборДанных1);

	Для каждого ПолеСКД Из СКДНастроек.НаборыДанных[0].Поля Цикл

		НовоеПоле = ВнешнийНД.Поля.Добавить(ТипЗнч(ПолеСКД));//(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));

		ЗаполнитьЗначенияСвойств(НовоеПоле,ПолеСКД);

	КонецЦикла;

	СКДНастроек.НаборыДанных.Удалить(СКДНастроек.НаборыДанных[0]);

	СКДНастроек.НаборыДанных[0].Имя = ИмяНД;

	СКДНастроек.НаборыДанных[0].ИмяОбъекта = "ВТ";

 

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКДНастроек,НастройкиСКД,ДанныеРасшифровки);

 

	//Компоновка данных

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;

	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных);

	 

	//Вывод результата

	ДокументРезультат = ТабДок;

	ДокументРезультат.Очистить();

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;

	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
  //  ДокументРезультат.
//	Возврат ДокументРезультат;
    
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере(Результат);      
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()

	ОбъектОтчетНаСервере = РеквизитФормыВЗначение("Отчет");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РаспределениеСтраховыхЛимитов","ТЧ",ОбъектОтчетНаСервере.ТЧ.Выгрузить());  
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РаспределениеСтраховыхЛимитов","Контрагент",ОбъектОтчетНаСервере.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)  
СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
	ТЧ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаспределениеСтраховыхЛимитов","ТЧ");
	Если ТЧ <> Неопределено Тогда
		Отчет.ТЧ.Загрузить(ТЧ); 
		Элементы.Группа1.Скрыть();
	КонецЕсли;   
	Контрагент = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаспределениеСтраховыхЛимитов","Контрагент");
	Если Контрагент <> Неопределено Тогда
		Отчет.Контрагент = Контрагент;  
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТЧПриИзмененииНаСервере()    

	текСтрока = Отчет.ТЧ.НайтиПоИдентификатору(Элементы.ТЧ.ТекущаяСтрока);
	ТекОрганизация = текСтрока.Организация;
	ТекСумма = текСтрока.СуммаЗаказа;
	
	Для Каждого стр из Отчет.ТЧ Цикл
		Если стр.Организация = ТекОрганизация и Элементы.ТЧ.ТекущаяСтрока <> стр.ПолучитьИдентификатор() и
			стр.СуммаЗаказа > 0 и ТекСумма > 0 Тогда
			Сообщить("По выбранной организации сумма заказа уже установлена! Устанавливать надо только в одной (любой) строке");
			текСтрока.СуммаЗаказа = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	ТЧПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧСуммаЗаказаПриИзмененииНаСервере()
	
	текСтрока = Отчет.ТЧ.НайтиПоИдентификатору(Элементы.ТЧ.ТекущаяСтрока);
	ТекОрганизация = текСтрока.Организация;
	ТекСумма = текСтрока.СуммаЗаказа;
	
	Для Каждого стр из Отчет.ТЧ Цикл
		Если стр.Организация = ТекОрганизация и Элементы.ТЧ.ТекущаяСтрока <> стр.ПолучитьИдентификатор() и
			стр.СуммаЗаказа > 0 и ТекСумма > 0 Тогда
			Сообщить("По выбранной организации сумма заказа уже установлена! Устанавливать надо только в одной (любой) строке");
			текСтрока.СуммаЗаказа = 0;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаЗаказаПриИзменении(Элемент)
	ТЧСуммаЗаказаПриИзмененииНаСервере();
КонецПроцедуры
