	
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
    ПараметрыРегистрации.Версия = "1.0";
	//ПараметрыРегистрации.Назначение.Добавить("Документ.ПриобретениеТоваровУслуг");
	//ПараметрыРегистрации.Назначение.Добавить("Документ.ТаможеннаяДекларацияИмпорт"); 
	
    ПараметрыРегистрации.Наименование = "гф_ПроверкаНомеровГТДвКМ";
    ПараметрыРегистрации.Информация = НСтр("ru='Загрузка данных из табличного документа'");
	ПараметрыРегистрации.БезопасныйРежим = Истина;

    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Идентификатор = "гф_ПроверкаНомеровГТДвКМ";
    Команда.Представление = "Проверка заполнения номеров ГТД в КМ (гф)";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение	= Истина;
    
    Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти 
