
#Область ОбработчикиСобытийФормы 

&НаКлиенте
Процедура ОтборыПриИзменении(Элемент)
	ЗаполнитьТаблицаЗаказы();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказыПриАктивизацииЯчейки(Элемент)
	ТД = Элементы.ТаблицаЗаказы.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Если мЗаказКлиента <> ТД.ЗаказКлиента Тогда
			флЗадатьВопрос = Ложь;
			Если	РежимРаботы = 1
				И НЕ флТоварыВКоробах Тогда
				флЗадатьВопрос = Объект.Резервы.Количество() > 0;
			ИначеЕсли	РежимРаботы = 1
				И		флТоварыВКоробах Тогда
				флЗадатьВопрос = Объект.РезервыВКоробах.Количество() > 0;
			ИначеЕсли флТоварыВКоробах Тогда
				флЗадатьВопрос = Объект.ТоварыВКоробах.Количество() > 0;
			Иначе
				флЗадатьВопрос = Объект.Товары.Количество() > 0;
			КонецЕсли;
			Если флЗадатьВопрос Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ВопросОчиститьСтрокиЗаказа", ЭтотОбъект);
				ПоказатьВопрос(ОписаниеОповещения, "Очистить строки заказа?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
			Иначе
				мЗаказКлиента = ТД.ЗаказКлиента;
				мНазначение = ПолучитьНазначение(мЗаказКлиента);
				мКомментарий = ТД.Комментарий;
				мДатаОбновленияИзИ5 = _омОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(мЗаказКлиента,	"Документ.ЗаказКлиента", "гф_ДатаОбновленияИзИ5");
				мИдентификаторТаблицыЗаказы = ТД.ПолучитьИдентификатор();
				ЗаполнитьЗаказИзменен();
				УправлениеДоступностьюЗаказыВКоробах();
				УправлениеДоступностьюРезервы();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьТаблицаЗаказы();
	УправлениеДоступностью();
	УправлениеДоступностьюТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура флТоварыВКоробахПриИзменении(Элемент)
	УправлениеДоступностьюТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура мНазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура("Организация, Заказ", отборОрганизация, мЗаказКлиента);
	ПараметрыФормы = Новый Структура("Отбор", СтруктураОтбора);
	ОткрытьФорму("Документ.КорректировкаНазначенияТоваров.Форма.ФормаВыбораНазначения", ПараметрыФормы, Элемент, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДобавитьПриИзменении(Элемент)
	ПересчитатьИтогПоСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУдалитьПриИзменении(Элемент)
	ПересчитатьИтогПоСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьИтогПоСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.Товары.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Если ТД.флТолькоПросмотр = Истина Тогда
			Отказ = Истина;
		КонецЕсли;
		Если ТД.флНаличиеВЗаказе = Истина Тогда
			Если Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатура" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТоварыХарактеристика" Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВКоробахДобавитьПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеВКоробах("ТоварыВКоробах", "Добавить", "Удалить");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВКоробахУдалитьПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеВКоробах("ТоварыВКоробах", "Добавить", "Удалить");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВКоробахЦенаКоробаПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеВКоробах("ТоварыВКоробах", "Добавить", "Удалить");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВКоробахПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.ТоварыВКоробах.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Если ТД.флНаличиеВЗаказе = Истина Тогда
			Если Элемент.ТекущийЭлемент.Имя = "ТоварыВКоробахВариантКомплектации" Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВКоробахВариантКомплектацииПриИзменении(Элемент)
	ТД = Элементы.ТоварыВКоробах.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.Артикул = "";
		Если ЗначениеЗаполнено(ТД.ВариантКомплектации) Тогда
			ТД.Артикул = ПолучитьАртикул(ТД.ВариантКомплектации);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезервыПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.Резервы.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Если ТД.флТолькоПросмотр = Истина Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезервыВКоробахЗарезервироватьПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеВКоробах("РезервыВКоробах", "Зарезервировать", "СнятьРезерв");
КонецПроцедуры

&НаКлиенте
Процедура РезервыВКоробахСнятьРезервПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеВКоробах("РезервыВКоробах", "Зарезервировать", "СнятьРезерв");
КонецПроцедуры

&НаКлиенте
Процедура РезервыВКоробахЦенаКоробаПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеВКоробах("РезервыВКоробах", "Зарезервировать", "СнятьРезерв");
КонецПроцедуры

&НаКлиенте
Процедура РезервыНовоеНазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация", отборОрганизация);
	ОткрытьФорму("Документ.КорректировкаНазначенияТоваров.Форма.ФормаВыбораНазначения", ПараметрыФормы, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РезервыПеренестиНовоеНазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация", отборОрганизация);
	ОткрытьФорму("Документ.КорректировкаНазначенияТоваров.Форма.ФормаВыбораНазначения", ПараметрыФормы, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РезервыЗарезервироватьПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеРезерва();
КонецПроцедуры

&НаКлиенте
Процедура РезервыСнятьРезервПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеРезерва();
КонецПроцедуры

&НаКлиенте
Процедура РезервыПеренестиВДругойЗаказПриИзменении(Элемент)
	ПересчитатьИтогПоСтрокеРезерва();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицаЗаказы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиента.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Проведен
	               |	И ЗаказКлиента.Организация = &Организация
	               |	И ЗаказКлиента.Статус = &Статус
	               |	И ЗаказКлиента.Склад = &Склад
	               |	И ЗаказКлиента.Контрагент = &Контрагент
	               |	И ЗаказКлиента.Договор.гф_Сезон = &гф_Сезон
				   |	И ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("Организация", отборОрганизация);
	Запрос.УстановитьПараметр("Статус", отборСтатус);
	Запрос.УстановитьПараметр("Склад", отборСклад);
	Запрос.УстановитьПараметр("Контрагент", отборКонтрагент);
	Запрос.УстановитьПараметр("гф_Сезон", отборСезон);
	Если Не ЗначениеЗаполнено(отборСклад) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента.Склад = &Склад", "ИСТИНА");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(отборКонтрагент) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента.Контрагент = &Контрагент", "ИСТИНА");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(отборСезон) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента.Договор.гф_Сезон = &гф_Сезон", "ИСТИНА");
	КонецЕсли;
	ДатаНачала = отборПериод.ДатаНачала;
	ДатаОкончания = отборПериод.ДатаОкончания;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	ТаблицаЗаказы.Загрузить(Результат.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ВопросОчиститьСтрокиЗаказа(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если	РежимРаботы = 1
			И НЕ флТоварыВКоробах Тогда
			Объект.Резервы.Очистить();
		ИначеЕсли	РежимРаботы = 1
				И		флТоварыВКоробах Тогда
			Объект.РезервыВКоробах.Очистить();
		ИначеЕсли флТоварыВКоробах Тогда
			Объект.ТоварыВКоробах.Очистить();
		Иначе
			Объект.Товары.Очистить();
		КонецЕсли;
		ТД = Элементы.ТаблицаЗаказы.ТекущиеДанные;
		Если ТД <> Неопределено Тогда
			мЗаказКлиента = ТД.ЗаказКлиента;
			мНазначение = ПолучитьНазначение(мЗаказКлиента);
			мКомментарий = ТД.Комментарий;
			мДатаОбновленияИзИ5 = _омОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(мЗаказКлиента, "Документ.ЗаказКлиента", "гф_ДатаОбновленияИзИ5");
			мИдентификаторТаблицыЗаказы = ТД.ПолучитьИдентификатор();
			ЗаполнитьЗаказИзменен();
			УправлениеДоступностьюЗаказыВКоробах();
			УправлениеДоступностьюРезервы();
		КонецЕсли;
	Иначе
		Элементы.ТаблицаЗаказы.ТекущаяСтрока = мИдентификаторТаблицыЗаказы;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокОбъект()
	ЗаказОбъект = мЗаказКлиента.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ЗаказОбъект, "ДокОбъект");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеЗаказаНаСервере()
	Объект.Товары.Очистить();
	Объект.ТоварыВКоробах.Очистить();
	Объект.Резервы.Очистить();
	
	Если Не ЗначениеЗаполнено(мЗаказКлиента) Тогда
		Возврат;
	КонецЕсли;
	
	Если	РежимРаботы = 1
		И НЕ флТоварыВКоробах Тогда
		// здесь надо получить первоначальные данные заказа из регистра сведений ВерсииОбъектов и текущие данные заказа
		// в зависимости от переключателя: "На согласовании/К выполнению"
		НомерВерсииЗаказа = НайтиНомерВерсииЗаказаПоСтатусу(мЗаказКлиента, ВыборСтатуса);
		Если НомерВерсииЗаказа = Неопределено Тогда
			ТекстСообщения = "Для Заказа:" + мЗаказКлиента + " НЕТ сохраненных ранее версий объекта. Заполнение не возможно!";
			СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ЗаполнитьТЧВПарах("Резервы", НомерВерсииЗаказа);
		
		ЗаполнитьРезервыНаСервере();

	ИначеЕсли	РежимРаботы = 1
			И	флТоварыВКоробах Тогда
		// здесь надо получить первоначальные данные заказа из регистра сведений ВерсииОбъектов и текущие данные заказа
		// в зависимости от переключателя: "На согласовании/К выполнению"
		НомерВерсииЗаказа = НайтиНомерВерсииЗаказаПоСтатусу(мЗаказКлиента, ВыборСтатуса);
		Если НомерВерсииЗаказа = Неопределено Тогда
			ТекстСообщения = "Для Заказа:" + мЗаказКлиента + " НЕТ сохраненных ранее версий объекта. Заполнение не возможно!";
			СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
		ЗаполнитьТЧВКоробах("РезервыВКоробах", НомерВерсииЗаказа);
			
	ИначеЕсли флТоварыВКоробах Тогда
		// здесь надо получить первоначальные данные заказа из регистра сведений ВерсииОбъектов и текущие данные заказа
		ЗаполнитьТЧВКоробах("ТоварыВКоробах");
		
	Иначе	
		// здесь надо получить первоначальные данные заказа из регистра сведений ВерсииОбъектов и текущие данные заказа
		ЗаполнитьТЧВПарах("Товары");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеЗаказа(Команда)
	ЗаполнитьДанныеЗаказаНаСервере();
	флЗаказИзменен = Ложь;
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогПоСтроке()
	ТД = Элементы.Товары.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.Количество = ТД.КоличествоСИзменениями + ТД.Добавить - ТД.Удалить;
		ТД.КоличествоУпаковок = ТД.Количество;
		Если ТД.Количество < 0 Тогда
			ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
			СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТД.Добавить) ИЛИ ЗначениеЗаполнено(ТД.Удалить) Тогда
			ТД["Пометка"] = Истина;
		Иначе
			ТД["Пометка"] = Ложь;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьЗаказИзменен();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаказИзменен()
	Если РежимРаботы = 1 Тогда
		Если	Объект.Резервы.Итог("Зарезервировать") <> 0
			ИЛИ	Объект.Резервы.Итог("СнятьРезерв") <> 0
			ИЛИ	Объект.Резервы.Итог("ПеренестиВДругойЗаказ") <> 0 Тогда
			флЗаказИзменен = Истина;
		Иначе
			флЗаказИзменен = Ложь;
		КонецЕсли;
	ИначеЕсли флТоварыВКоробах Тогда
		Если	Объект.ТоварыВКоробах.Итог("Добавить") <> 0
			ИЛИ	Объект.ТоварыВКоробах.Итог("Удалить") <> 0 Тогда
			флЗаказИзменен = Истина;
		Иначе
			флЗаказИзменен = Ложь;
		КонецЕсли;
	Иначе
		Если	Объект.Товары.Итог("Добавить") <> 0
			ИЛИ	Объект.Товары.Итог("Удалить") <> 0 Тогда
			флЗаказИзменен = Истина;
		Иначе
			флЗаказИзменен = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередЗаписьюРезервы()
	Если НЕ ЗначениеЗаполнено(мНазначение) Тогда
		СообщитьПользователю("Необходимо выбрать Текущее назначение.");
		флЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;
	Если Объект.Резервы.Итог("Зарезервировать") > 0
		И НЕ ЗначениеЗаполнено(мПричинаДобавления) Тогда
		СообщитьПользователю("Необходимо указать Причину добавления.");
		флЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;
	Если Объект.Резервы.Итог("СнятьРезерв") > 0
		И НЕ ЗначениеЗаполнено(мПричинаУдаления) Тогда
		СообщитьПользователю("Необходимо указать Причину удаления.");
		флЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;
	Если	Объект.Резервы.Итог("ПеренестиВДругойЗаказ") > 0
		И 	(НЕ ЗначениеЗаполнено(мПричинаДобавления)
		ИЛИ НЕ ЗначениеЗаполнено(мПричинаУдаления)) Тогда
		СообщитьПользователю("Необходимо указать Причину добавления и Причину удаления.");
		флЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередЗаписьюТЧРезервы()
	Для Каждого СтрокаТЧ Из Объект.Резервы Цикл
		ТекстОшибки = "";
		Если	ЗначениеЗаполнено(СтрокаТЧ["Зарезервировать"])
			И	СтрокаТЧ["Зарезервировать"] > СтрокаТЧ["ДоступноНаСкладе"] Тогда
			ТекстОшибки = ТекстОшибки + "Зарезервировать превышает Остатки на складе. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["Зарезервировать"])
			И	ЗначениеЗаполнено(СтрокаТЧ["СнятьРезерв"]) Тогда
			ТекстОшибки = ТекстОшибки + "В строка указаны Зарезервировать и Снять резерв одновременно. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["ПеренестиРезерв"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["НовоеНазначение"]) Тогда
			ТекстОшибки = ТекстОшибки + "Для переноса резерва надо указать Количество и Новое назначение одновременно. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["ПеренестиВДругойЗаказ"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["ПеренестиНовоеНазначение"]) Тогда
			ТекстОшибки = ТекстОшибки + "Для переноса резерва в другой заказ надо указать Количество и Новое назначение одновременно. ";
		КонецЕсли;
		Если СтрокаТЧ["Количество"] < 0 Тогда
			ТекстОшибки = ТекстОшибки + "Отрицательный предварительный итог. ";
		КонецЕсли;
		Если ТекстОшибки <> "" Тогда
			ТекстСообщения = ТекстОшибки + " в строке:" + СтрокаТЧ["НомерСтроки"];
			СообщитьПользователю(ТекстСообщения);
			флЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередЗаписьюТЧТоварыВКоробах()
	Для Каждого СтрокаТЧ Из Объект.ТоварыВКоробах Цикл
		ТекстОшибки = "";
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["ВариантКомплектации"]) Тогда
			ТекстОшибки = ТекстОшибки + "Не указан ВариантКомплектации. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["Количество"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["ЦенаКороба"]) Тогда
			ТекстОшибки = ТекстОшибки + "Не указана Цена короба. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["Добавить"])
			И	ЗначениеЗаполнено(СтрокаТЧ["Удалить"]) Тогда
			ТекстОшибки = ТекстОшибки + "В строка указаны Добавить и Удалить одновременно. ";
		КонецЕсли;
		Если ТекстОшибки <> "" Тогда
			ТекстСообщения = ТекстОшибки + " в строке:" + СтрокаТЧ["НомерСтроки"];
			СообщитьПользователю(ТекстСообщения);
			флЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередЗаписьюТЧТовары()
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ТекстОшибки = "";
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["Номенклатура"]) Тогда
			ТекстОшибки = ТекстОшибки + "Не указана Номенклатура. ";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["Характеристика"]) Тогда
			ТекстОшибки = ТекстОшибки + "Не указана Характеристика. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["Количество"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["Цена"]) Тогда
			ТекстОшибки = ТекстОшибки + "Не указана Цена. ";
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["Добавить"])
			И	ЗначениеЗаполнено(СтрокаТЧ["Удалить"]) Тогда
			ТекстОшибки = ТекстОшибки + "В строке указаны Добавить и Удалить одновременно. ";
		КонецЕсли;
		Если СтрокаТЧ["Количество"] < 0 Тогда
			ТекстОшибки = ТекстОшибки + "Отрицательный предварительный итог. ";
		КонецЕсли;
		Если ТекстОшибки <> "" Тогда
			ТекстСообщения = ТекстОшибки + " в строке:" + СтрокаТЧ["НомерСтроки"];
			СообщитьПользователю(ТекстСообщения);
			флЕстьОшибкиЗаполнения = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПередЗаписью()
	флЕстьОшибкиЗаполнения = Ложь;
	Если РежимРаботы = 1 Тогда
		ПроверитьЗаполнениеПередЗаписьюРезервы();
		ПроверитьЗаполнениеПередЗаписьюТЧРезервы();
	ИначеЕсли флТоварыВКоробах Тогда
		ПроверитьЗаполнениеПередЗаписьюТЧТоварыВКоробах();
	Иначе
		ПроверитьЗаполнениеПередЗаписьюТЧТовары();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьЗаказ(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьСохранениеЗаказа();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если	РежимРаботы = 1
		И	флТоварыВКоробах Тогда
		СообщитьПользователю("Алгоритм резервирования для товаров в коробах не реализован!");
		Возврат;
	КонецЕсли;
	ПроверитьЗаполнениеПередЗаписью();
	Если флЕстьОшибкиЗаполнения Тогда
		Возврат;
	Иначе
		ВыполнитьСохранениеЗаказа();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧТоварыПоРезервам()
	МаксимальныйКодСтроки = МаксимальныйКодСтрокиРезервы();
	Для Каждого СтрокаТЧ Из Объект.Резервы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["Количество"]) И СтрокаТЧ["флНаличиеВЗаказе"] = Ложь Тогда
			// здесь строки нет в текущей версии заказа (была в первой версии) и количество не указано - пропускаем эту строку
			Продолжить;
		КонецЕсли;
		
		нс = тчТовары.Добавить();
		ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
		Если	Не ЗначениеЗаполнено(СтрокаТЧ["Зарезервировать"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["СнятьРезерв"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["ПеренестиВДругойЗаказ"]) Тогда
			нс.Количество = СтрокаТЧ["КоличествоСИзменениями"];
			нс.КоличествоУпаковок = нс.Количество;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ["Зарезервировать"]) Тогда
			нс.Количество = СтрокаТЧ["КоличествоСИзменениями"];
			нс.КоличествоУпаковок = нс.Количество;
			нс = тчТовары.Добавить();
			ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
			нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			нс.Количество = СтрокаТЧ["Зарезервировать"];
			нс.КоличествоУпаковок = нс.Количество;
			нс.гф_ДобавленоПоПричине = Истина;
			нс.гф_ПричинаДобавления = мПричинаДобавления;
			нс.Отменено = Ложь;
			нс.ПричинаОтмены = Неопределено;
			МаксимальныйКодСтроки = МаксимальныйКодСтроки + 1;
			нс.КодСтроки = МаксимальныйКодСтроки;
			нс.флПересчитатьСтроку = Истина;
		КонецЕсли;
		Если	ЗначениеЗаполнено(СтрокаТЧ["СнятьРезерв"])
			ИЛИ	ЗначениеЗаполнено(СтрокаТЧ["ПеренестиВДругойЗаказ"]) Тогда
			Если ЗначениеЗаполнено(СтрокаТЧ["СнятьРезерв"]) Тогда
				УдалитьИзЗаказа = СтрокаТЧ["СнятьРезерв"];
			Иначе
				УдалитьИзЗаказа = СтрокаТЧ["ПеренестиВДругойЗаказ"];
			КонецЕсли;
			Если	СтрокаТЧ["Количество"] = 0
				И	СтрокаТЧ["КоличествоСИзменениями"] = УдалитьИзЗаказа Тогда
				// здесь из заказа удаляется ВСЕ количество - ставим галку Отменено и указываем причину
				нс.Количество = СтрокаТЧ["КоличествоСИзменениями"];
				нс.КоличествоУпаковок = нс.Количество;
				нс.Отменено = Истина;
				нс.ПричинаОтмены = мПричинаУдаления;
				нс.флПересчитатьСтроку = Истина;
			Иначе
				нс.флПересчитатьСтроку = Истина;
				нс = тчТовары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
				нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				нс.Количество = УдалитьИзЗаказа;
				нс.КоличествоУпаковок = нс.Количество;
				нс.гф_ДобавленоПоПричине = Ложь;
				нс.гф_ПричинаДобавления = Неопределено;
				нс.Отменено = Истина;
				нс.ПричинаОтмены = мПричинаУдаления;
				МаксимальныйКодСтроки = МаксимальныйКодСтроки + 1;
				нс.КодСтроки = МаксимальныйКодСтроки;
				нс.флПересчитатьСтроку = Истина;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТЧ["ПеренестиВДругойЗаказ"]) Тогда
				// здесь готовим строки для переноса в другие заказы
				нс = тчТовары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
				нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				нс.Количество = УдалитьИзЗаказа;
				нс.КоличествоУпаковок = нс.Количество;
				нс.гф_ДобавленоПоПричине = Истина;
				нс.гф_ПричинаДобавления = мПричинаДобавления;
				нс.Отменено = Ложь;
				нс.ПричинаОтмены = Неопределено;
				нс.флПересчитатьСтроку = Истина;
				нс.Назначение = СтрокаТЧ["ПеренестиНовоеНазначение"];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧТоварыПоТоварам()
	МаксимальныйКодСтроки = МаксимальныйКодСтрокиТовары();
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["Количество"]) И СтрокаТЧ["флНаличиеВЗаказе"] = Ложь Тогда
			// здесь строки нет в текущей версии заказа (была в первой версии) и количество не указано - пропускаем эту строку
			Продолжить;
		КонецЕсли;
		
		нс = тчТовары.Добавить();
		ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
		Если	Не ЗначениеЗаполнено(СтрокаТЧ["Добавить"])
			И	НЕ ЗначениеЗаполнено(СтрокаТЧ["Удалить"]) Тогда
			нс.Количество = СтрокаТЧ["КоличествоСИзменениями"];
			нс.КоличествоУпаковок = нс.Количество;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ["Добавить"]) Тогда
			нс.Количество = СтрокаТЧ["КоличествоСИзменениями"];
			нс.КоличествоУпаковок = нс.Количество;
			нс = тчТовары.Добавить();
			ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
			нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			нс.Количество = СтрокаТЧ["Добавить"];
			нс.КоличествоУпаковок = нс.Количество;
			нс.гф_ДобавленоПоПричине = Истина;
			нс.гф_ПричинаДобавления = СтрокаТЧ["ПричинаДобавления"];
			нс.Отменено = Ложь;
			нс.ПричинаОтмены = Неопределено;
			МаксимальныйКодСтроки = МаксимальныйКодСтроки + 1;
			нс.КодСтроки = МаксимальныйКодСтроки;
			нс.флПересчитатьСтроку = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ["Удалить"]) Тогда
			Если	СтрокаТЧ["Количество"] = 0
				И	СтрокаТЧ["КоличествоСИзменениями"] = СтрокаТЧ["Удалить"] Тогда
				// здесь из заказа удаляется ВСЕ количество - ставим галку Отменено и указываем причину
				нс.Количество = СтрокаТЧ["КоличествоСИзменениями"];
				нс.КоличествоУпаковок = нс.Количество;
				нс.Отменено = Истина;
				нс.ПричинаОтмены = СтрокаТЧ["ПричинаУдаления"];
				нс.флПересчитатьСтроку = Истина;
			Иначе
				нс.флПересчитатьСтроку = Истина;
				нс = тчТовары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
				нс.ИдентификаторСтроки = Новый УникальныйИдентификатор;
				нс.Количество = СтрокаТЧ["Удалить"];
				нс.КоличествоУпаковок = нс.Количество;
				нс.гф_ДобавленоПоПричине = Ложь;
				нс.гф_ПричинаДобавления = Неопределено;
				нс.Отменено = Истина;
				нс.ПричинаОтмены = СтрокаТЧ["ПричинаУдаления"];
				МаксимальныйКодСтроки = МаксимальныйКодСтроки + 1;
				нс.КодСтроки = МаксимальныйКодСтроки;
				нс.флПересчитатьСтроку = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТЧТовары(флЗаписатьЗаказ)
	Для Каждого СтрокаТЧ Из тчТовары Цикл
		Если НЕ СтрокаТЧ.флПересчитатьСтроку Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ДокОбъект);
		СтруктураДействий.ЗаполнитьДубликатыЗависимыхРеквизитов = Неопределено;
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, Неопределено);
		флЗаписатьЗаказ = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСохранениеЗаказа()
	ТЗПротокол.Очистить();
	ОчиститьСообщения();
	флЗаписатьЗаказ = Ложь;
	Если РежимРаботы = 1 Тогда
		тчТовары.Очистить();
		ЗаполнитьТЧТоварыПоРезервам();
		
		ЗаполнитьДокОбъект();
		ПересчитатьТЧТовары(флЗаписатьЗаказ);
		
		Если Объект.Резервы.Итог("ПеренестиРезерв") > 0 Тогда
			// здесь надо создать столько документов - сколько различных новых назначений указано в таблице
			ПеренестиРезервНаСервере("ПеренестиРезерв", "НовоеНазначение");
		КонецЕсли;
		Если Объект.Резервы.Итог("ПеренестиВДругойЗаказ") > 0 Тогда
			// здесь надо создать столько документов - сколько различных новых назначений указано в таблице
			ПеренестиРезервНаСервере("ПеренестиВДругойЗаказ", "ПеренестиНовоеНазначение", Истина);
		КонецЕсли;
		
	ИначеЕсли флТоварыВКоробах Тогда
		Для Каждого СтрокаТЧ Из Объект.ТоварыВКоробах Цикл
			Если	Не ЗначениеЗаполнено(СтрокаТЧ["Добавить"])
				И	НЕ ЗначениеЗаполнено(СтрокаТЧ["Удалить"]) Тогда
				Продолжить;
			КонецЕсли;
			флЗаписатьЗаказ = Истина;
		КонецЦикла;
		
	Иначе
		тчТовары.Очистить();
		ЗаполнитьТЧТоварыПоТоварам();
		
		ЗаполнитьДокОбъект();
		ПересчитатьТЧТовары(флЗаписатьЗаказ);
		
	КонецЕсли;
	
	Если флЗаписатьЗаказ = Истина Тогда
		ЗаписатьЗаказНаСервере();
	КонецЕсли;
	Если ТЗПротокол.Количество() > 0 Тогда
		ТабДок = ПодготовитьТабДокНаСервере();
		ТабДок.Показать("Протокол выполнения Корректировка заказов и резервов");
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
		"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");
	
КонецФункции

&НаКлиенте
Процедура СкрытьОтборы(Команда)
	Если Элементы.Отборы.Видимость = Истина Тогда
		Элементы.Отборы.Видимость = Ложь;
		Элементы.ФормаСкрытьОтборы.Заголовок = "Показать отборы";
	Иначе
		Элементы.Отборы.Видимость = Истина;
		Элементы.ФормаСкрытьОтборы.Заголовок = "Скрыть отборы";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказОбъектТовары(ЗаказОбъект)
	Для Каждого СтрокаТЧ Из тчТовары Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Назначение) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ СтрокаТЧ.флПересчитатьСтроку Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки);
		СтрокиЗаказа = ЗаказОбъект.Товары.НайтиСтроки(СтруктураПоиска);
		Если СтрокиЗаказа.Количество() > 0 Тогда
			СтрокаЗаказа = СтрокиЗаказа[0];
			
			ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТЧ, "
			|Отменено,
			|ПричинаОтмены,
			|КоличествоУпаковок,
			|Количество,
			|Сумма,
			|СтавкаНДС,
			|СуммаНДС,
			|СуммаСНДС");
		Иначе
			// здесь строка с идентификатором НЕ найдена
			СтрокаЗаказа = ЗаказОбъект.Товары.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	СкидкиНаценкиСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(ЗаказОбъект, "Товары");
КонецПроцедуры

&НаСервере
Процедура СоздатьДокЗарезервировать()
	Если Объект.Резервы.Итог("Зарезервировать") = 0 Тогда
		Возврат;
	КонецЕсли;
	ДокРезервирование = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
	ДокРезервирование.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокРезервирование.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокРезервирование.Организация = отборОрганизация;
	ДокРезервирование.Дата = ТекущаяДатаСеанса();
	ДокРезервирование.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
	ДокРезервирование.Комментарий = "Создан автоматически обработкой Корректировка заказов и резервов " + ТекущаяДатаСеанса();
	ДокРезервирование.Назначение = мНазначение;
	Если Не ЗначениеЗаполнено(ДокРезервирование.Назначение) Тогда
		// здесь не заполнено Назначение - документ НЕ сохраняем
		ДокРезервирование = Неопределено;
		ТекстСообщения = "Не удалось получить Назначение для Заказа:" + мЗаказКлиента;
		СообщитьПользователю(ТекстСообщения);
	Иначе
		// здесь заполняем тч документа
		Для Каждого СтрокаТЧ Из Объект.Резервы Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ["Зарезервировать"]) Тогда
				нс = ДокРезервирование.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
				нс.Количество = СтрокаТЧ["Зарезервировать"];
				нс.КоличествоУпаковок = СтрокаТЧ["Зарезервировать"];
				нс.НовоеНазначение = ДокРезервирование.Назначение;
				нс.НовыйЗаказ = мЗаказКлиента;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Попытка
		ДокРезервирование.Записать(РежимЗаписиДокумента.Проведение);
		ТекстСообщения = "Проведен:" + ДокРезервирование.Ссылка;
		СообщитьПользователю(ТекстСообщения);
		СтрокаПротокола = ТЗПротокол.Добавить();
		СтрокаПротокола.Документ = ДокРезервирование.Ссылка;
		СтрокаПротокола.Комментарий = "Создан и проведен";
	Исключение
		ТекстСообщения = "Ошибка при записи:" + ОписаниеОшибки();
		СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СоздатьДокСнятьРезерв()
	Если Объект.Резервы.Итог("СнятьРезерв") = 0 Тогда
		Возврат;
	КонецЕсли;
	ДокСнятиеРезерва = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
	ДокСнятиеРезерва.Автор = ПараметрыСеанса.ТекущийПользователь;
	ДокСнятиеРезерва.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокСнятиеРезерва.Организация = отборОрганизация;
	ДокСнятиеРезерва.Дата = ТекущаяДатаСеанса();
	ДокСнятиеРезерва.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.СнятьРезерв;
	ДокСнятиеРезерва.Комментарий = "Создан автоматически обработкой Корректировка заказов и резервов " + ТекущаяДатаСеанса();
	ДокСнятиеРезерва.Назначение = мНазначение;
	Если Не ЗначениеЗаполнено(ДокСнятиеРезерва.Назначение) Тогда
		// здесь не заполнено Назначение - документ НЕ сохраняем
		ДокСнятиеРезерва = Неопределено;
		ТекстСообщения = "Не удалось получить Назначение для Заказа:" + мЗаказКлиента;
		СообщитьПользователю(ТекстСообщения);
	Иначе
		// здесь заполняем тч документа
		Для Каждого СтрокаТЧ Из Объект.Резервы Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ["СнятьРезерв"]) Тогда
				нс = ДокСнятиеРезерва.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
				нс.Количество = СтрокаТЧ["СнятьРезерв"];
				нс.КоличествоУпаковок = СтрокаТЧ["СнятьРезерв"];
				нс.ИсходноеНазначение = ДокСнятиеРезерва.Назначение;
				нс.ИсходныйЗаказ = мЗаказКлиента;
				нс.ИсходноеНазначениеДвиженияПоСкладскимРегистрам = Истина;
				// Аналитика учета заполняется при проведении документа автоматически...
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Попытка
		ДокСнятиеРезерва.Записать(РежимЗаписиДокумента.Проведение);
		ТекстСообщения = "Проведен:" + ДокСнятиеРезерва.Ссылка;
		СообщитьПользователю(ТекстСообщения);
		СтрокаПротокола = ТЗПротокол.Добавить();
		СтрокаПротокола.Документ = ДокСнятиеРезерва.Ссылка;
		СтрокаПротокола.Комментарий = "Создан и проведен";
	Исключение
		ТекстСообщения = "Ошибка при записи:" + ОписаниеОшибки();
		СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗаказНаСервере()
	
	ЗаказОбъект = мЗаказКлиента.ПолучитьОбъект();
	Если ЗначениеЗаполнено(мКомментарий) Тогда
		ЗаказОбъект.Комментарий = мКомментарий;
	КонецЕсли;
	
	Если РежимРаботы = 1 Тогда
		Если	Объект.Резервы.Итог("Зарезервировать") <> 0
			ИЛИ	Объект.Резервы.Итог("СнятьРезерв") <> 0
			ИЛИ	Объект.Резервы.Итог("ПеренестиВДругойЗаказ") Тогда
			// условие для изменения "исходного" Заказа
			ЗаполнитьЗаказОбъектТовары(ЗаказОбъект);
		КонецЕсли;
		
		// здесь создаем документы Корректировка назначения товаров
		СоздатьДокЗарезервировать();
		
		СоздатьДокСнятьРезерв();
		
	ИначеЕсли флТоварыВКоробах Тогда
		ЗаказОбъект.гф_ТоварыВКоробах.Очистить();
		Для Каждого СтрокаТЧ Из Объект.ТоварыВКоробах Цикл
			СтрокаЗаказа = ЗаказОбъект.гф_ТоварыВКоробах.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТЧ);
		КонецЦикла;
		
	Иначе
		Для Каждого СтрокаТЧ Из тчТовары Цикл
			Если НЕ СтрокаТЧ.флПересчитатьСтроку Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки);
			СтрокиЗаказа = ЗаказОбъект.Товары.НайтиСтроки(СтруктураПоиска);
			Если СтрокиЗаказа.Количество() > 0 Тогда
				СтрокаЗаказа = СтрокиЗаказа[0];
				
				ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТЧ, "
				|Отменено,
				|ПричинаОтмены,
				|КоличествоУпаковок,
				|Количество,
				|Сумма,
				|СтавкаНДС,
				|СуммаНДС,
				|СуммаСНДС");
			Иначе
				// здесь строка с идентификатором НЕ найдена
				СтрокаЗаказа = ЗаказОбъект.Товары.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТЧ);
			КонецЕсли;
			
		КонецЦикла;
		СкидкиНаценкиСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(ЗаказОбъект, "Товары");
		
	КонецЕсли;

	Попытка
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ТекстСообщения = "Проведен:" + ЗаказОбъект.Ссылка;
		СообщитьПользователю(ТекстСообщения);
		СтрокаПротокола = ТЗПротокол.Добавить();
		СтрокаПротокола.Документ = ЗаказОбъект.Ссылка;
		СтрокаПротокола.Комментарий = "Изменен и проведен";
		ЗаполнитьДанныеЗаказаНаСервере();
	Исключение
		ТекстСообщения = "Ошибка при записи:" + ОписаниеОшибки();
		СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуЗаказаНаСервере()
	СтрокаТаблицы = Объект.Товары.Добавить();
	СтрокаТаблицы.флДобавленаВручную	= Истина;
	// здесь заполняем поля значениями из первой строки тч
	СтрокаТаблицы.ИдентификаторСтроки	= Новый УникальныйИдентификатор();
	СтрокаТаблицы.СтавкаНДС				= Объект.Товары[0].СтавкаНДС;
	СтрокаТаблицы.Склад					= Объект.Товары[0].Склад;
	СтрокаТаблицы.ДатаОтгрузки			= Объект.Товары[0].ДатаОтгрузки;
	СтрокаТаблицы.ВариантОбеспечения	= Объект.Товары[0].ВариантОбеспечения;
	СтрокаТаблицы.Упаковка				= Объект.Товары[0].Упаковка;
	
	Идентификатор = СтрокаТаблицы.ПолучитьИдентификатор();
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.Товары;
	Элементы.Товары.ТекущаяСтрока = Идентификатор;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуЗаказа(Команда)
	ДобавитьСтрокуЗаказаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностью()
	Элементы.ТоварыДобавитьСтрокуЗаказа.Доступность = Объект.Товары.Количество() > 0;
	ТД = Элементы.Товары.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Элементы.ТоварыУдалитьСтрокуЗаказа.Доступность = ТД.флДобавленаВручную;
	КонецЕсли;
	Если РежимРаботы = 1 Тогда
		Элементы.ВыборСтатуса.Доступность = Истина;
	Иначе
		Элементы.ВыборСтатуса.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ["Пометка"] = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ["Пометка"] = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПричинуДобавления(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	Оповещение = Новый ОписаниеОповещения("ВыборПричиныДобавленияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказовКлиентов.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПричиныДобавленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если СтрокаТЧ["Пометка"] = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["Добавить"]) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ["ПричинаДобавления"] = Результат;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПричинуУдаления(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	Оповещение = Новый ОписаниеОповещения("ВыборПричиныУдаленияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказовКлиентов.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПричиныУдаленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если СтрокаТЧ["Пометка"] = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ["Удалить"]) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ["ПричинаУдаления"] = Результат;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗаказа(Команда)
	ТД = Элементы.Товары.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ИдентификаторСтроки = ТД.ПолучитьИдентификатор();
		СтрокаЗаказа = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаЗаказа <> Неопределено Тогда
			Индекс = Объект.Товары.Индекс(СтрокаЗаказа);
			Объект.Товары.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьТоварыВКоробах(ЗаказКлиента)
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "гф_СкладыТоварыВКоробах");
	Если ЗначениеЗаполнено(Свойство) Тогда
		Если ЗначениеЗаполнено(ЗаказКлиента.Склад) Тогда
			Возврат ПолучитьЗначениеДопРеквизита(ЗаказКлиента.Склад, Свойство);
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеДопРеквизита(Ссылка, Свойство) Экспорт
    ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Свойство",Свойство);
    Массив = Ссылка.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
    Если Массив.Количество() = 0 Тогда
        Возврат Ложь;
    Иначе
        Возврат Массив[0].Значение;
    КонецЕсли;
КонецФункции

&НаКлиенте
Процедура УправлениеДоступностьюРезервы()
	Элементы.РезервыЗарезервировать.Доступность = Истина;
	Элементы.РезервыСнятьРезерв.Доступность = Истина;
	Если ЗначениеЗаполнено(мЗаказКлиента) Тогда
		Если ЗначениеЗаполнено(мДатаОбновленияИзИ5) Тогда
			Элементы.РезервыЗарезервировать.Доступность = Ложь;
			Элементы.РезервыСнятьРезерв.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюЗаказыВКоробах()
	Если ЗначениеЗаполнено(мЗаказКлиента) Тогда
		ТоварыВКоробах = ВернутьТоварыВКоробах(мЗаказКлиента);
		флТоварыВКоробах = ТоварыВКоробах;
	КонецЕсли;
	УправлениеДоступностьюТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюТаблиц()
	Элементы.Товары.Видимость = Ложь;
	Элементы.ТоварыВКоробах.Видимость = Ложь;
	Элементы.Резервы.Видимость = Ложь;
	Элементы.РезервыВКоробах.Видимость = Ложь;
	Элементы.ГруппаПричины.Видимость = Ложь;
	Если РежимРаботы = 1 Тогда
		Элементы.Резервы.Видимость = НЕ флТоварыВКоробах;
		Элементы.РезервыВКоробах.Видимость = флТоварыВКоробах;
		Элементы.ГруппаПричины.Видимость = Истина;
	Иначе
		Элементы.Товары.Видимость = НЕ флТоварыВКоробах;
		Элементы.ТоварыВКоробах.Видимость = флТоварыВКоробах;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаИзЭксельЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("флТоварыВКоробах", флТоварыВКоробах);
	Если ЭтотОбъект.ИмяФормы = "ВнешняяОбработка.гф_КорректировкаЗаказовРезервов.Форма.Форма" Тогда
		ОткрытьФорму("ВнешняяОбработка.гф_КорректировкаЗаказовРезервов.Форма.ФормаЗагрузкиИзЭксель", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
	Иначе
		ОткрытьФорму("Обработка.гф_КорректировкаЗаказовРезервов.Форма.ФормаЗагрузкиИзЭксель", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзЭксельСтрокуТоварыВКоробах(Элемент)
	СтруктураПоиска = Новый Структура("ВариантКомплектации, флНаличиеВЗаказе", Элемент["ВариантКомплектации"], Истина);
	СтрокиЗаказа = Объект.ТоварыВКоробах.НайтиСтроки(СтруктураПоиска);
	Если СтрокиЗаказа.Количество() > 0 Тогда
		// здесь надо "распределить" количество Добавить/Удалить по строкам
		ОсталосьДобавить = Элемент["Добавить"];
		ОсталосьУдалить = Элемент["Удалить"];
		Для Каждого ТД Из СтрокиЗаказа Цикл
			Если ОсталосьДобавить > 0 Тогда
				ТД["Добавить"] = Элемент["Добавить"];
				ОсталосьДобавить = ОсталосьДобавить - ТД["Добавить"];
			КонецЕсли;
			Если ОсталосьУдалить > 0 И ТД["Количество"] > 0 Тогда
				Удалить = Мин(ОсталосьУдалить, ТД["Количество"]);
				ТД["Удалить"] = Удалить;
				ОсталосьУдалить = ОсталосьУдалить - Удалить;
			КонецЕсли;
			// пересчитываем количество по строке заказа
			ТД.Количество = ТД.КоличествоСИзменениями + ТД.Добавить - ТД.Удалить;
			ТД.Сумма = ТД.Количество * ТД.ЦенаКороба;
			Если ТД.Количество < 0 Тогда
				ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
				СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			Если ОсталосьДобавить = 0 И ОсталосьУдалить = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		НеРаспределено = "";
		Если ОсталосьДобавить > 0 Тогда
			НеРаспределено = НеРаспределено + "Не получилось добавить:" +
								ОсталосьДобавить + ". ВариантКомплектации:" +
								Элемент["ВариантКомплектации"];
		КонецЕсли;
		Если ОсталосьУдалить > 0 Тогда
			НеРаспределено = НеРаспределено + "Не получилось удалить:" +
								ОсталосьУдалить + ". ВариантКомплектации:" +
								Элемент["ВариантКомплектации"];
		КонецЕсли;
		Если НеРаспределено <> "" Тогда
			СообщитьПользователю(НеРаспределено);
		КонецЕсли;
	Иначе
		// здесь не найдены строки для "ВариантКомплектации"
		ТД = Объект.ТоварыВКоробах.Добавить();
		ЗаполнитьЗначенияСвойств(ТД, Элемент);
		
		ТД.Количество = ТД.КоличествоСИзменениями + ТД.Добавить - ТД.Удалить;
		ТД.Сумма = ТД.Количество * ТД.ЦенаКороба;
		Если ТД.Количество < 0 Тогда
			ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
			СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры					

&НаКлиенте
Процедура ЗагрузитьИзЭксельСтрокуТовары(Элемент)
	СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, флНаличиеВЗаказе", Элемент["Номенклатура"], Элемент["Характеристика"], Истина);
	СтрокиЗаказа = Объект.Товары.НайтиСтроки(СтруктураПоиска);
	Если СтрокиЗаказа.Количество() > 0 Тогда
		// здесь надо "распределить" количество Добавить/Удалить по строкам
		ОсталосьДобавить = Элемент["Добавить"];
		ОсталосьУдалить = Элемент["Удалить"];
		Для Каждого ТД Из СтрокиЗаказа Цикл
			Если ОсталосьДобавить > 0 Тогда
				ТД["Добавить"] = Элемент["Добавить"];
				ОсталосьДобавить = ОсталосьДобавить - ТД["Добавить"];
			КонецЕсли;
			Если ОсталосьУдалить > 0 И ТД["Количество"] > 0 Тогда
				Удалить = Мин(ОсталосьУдалить, ТД["Количество"]);
				ТД["Удалить"] = Удалить;
				ОсталосьУдалить = ОсталосьУдалить - Удалить;
			КонецЕсли;
			// пересчитываем количество по строке заказа
			ТД.Количество = ТД.КоличествоСИзменениями + ТД.Добавить - ТД.Удалить;
			ТД.КоличествоУпаковок = ТД.Количество;
			Если ТД.Количество < 0 Тогда
				ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
				СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТД.Добавить) ИЛИ ЗначениеЗаполнено(ТД.Удалить) Тогда
				ТД["Пометка"] = Истина;
			Иначе
				ТД["Пометка"] = Ложь;
			КонецЕсли;
			Если ОсталосьДобавить = 0 И ОсталосьУдалить = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		НеРаспределено = "";
		Если ОсталосьДобавить > 0 Тогда
			НеРаспределено = НеРаспределено + "Не получилось добавить:" +
								ОсталосьДобавить + ". Номенклатура:" +
								Элемент["Номенклатура"] + ". Характеристика:" +
								Элемент["Характеристика"];
		КонецЕсли;
		Если ОсталосьУдалить > 0 Тогда
			НеРаспределено = НеРаспределено + "Не получилось удалить:" +
								ОсталосьУдалить + ". Номенклатура:" +
								Элемент["Номенклатура"] + ". Характеристика:" +
								Элемент["Характеристика"];
		КонецЕсли;
		Если НеРаспределено <> "" Тогда
			СообщитьПользователю(НеРаспределено);
		КонецЕсли;
		
	Иначе
		// здесь не найдены строки для "Номенклатуры - Характеристики"
		ТД = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТД, Элемент);
		
		ТД.Количество = ТД.КоличествоСИзменениями + ТД.Добавить - ТД.Удалить;
		ТД.КоличествоУпаковок = ТД.Количество;
		Если ТД.Количество < 0 Тогда
			ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
			СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТД.Добавить) ИЛИ ЗначениеЗаполнено(ТД.Удалить) Тогда
			ТД["Пометка"] = Истина;
		Иначе
			ТД["Пометка"] = Ложь;
		КонецЕсли;
		
		ТД.ИдентификаторСтроки	= Новый УникальныйИдентификатор();
		Если Объект.Товары.Количество() > 0 Тогда
			ТД.СтавкаНДС			= Объект.Товары[0].СтавкаНДС;
			ТД.Склад				= Объект.Товары[0].Склад;
			ТД.ДатаОтгрузки			= Объект.Товары[0].ДатаОтгрузки;
			ТД.ВариантОбеспечения	= Объект.Товары[0].ВариантОбеспечения;
			ТД.Упаковка				= Объект.Товары[0].Упаковка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
		
&НаКлиенте
Процедура ЗагрузкаИзЭксельЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ДанныеФайла.Очистить();
	ОчиститьСообщения();
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого Элемент Из Результат Цикл
			Если флТоварыВКоробах Тогда
				// Товары в коробах
				ЗагрузитьИзЭксельСтрокуТоварыВКоробах(Элемент);
				
			Иначе
				// Товары в парах
				ЗагрузитьИзЭксельСтрокуТовары(Элемент);
				
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьЗаказИзменен();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВКоробах(Команда)
	СтрокаТаблицы = Объект.ТоварыВКоробах.Добавить();
	СтрокаТаблицы.флДобавленаВручную	= Истина;
	
	Идентификатор = СтрокаТаблицы.ПолучитьИдентификатор();
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ТоварыВКоробах;
	Элементы.ТоварыВКоробах.ТекущаяСтрока = Идентификатор;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАртикул(ВариантКомплектации)
	Возврат ВариантКомплектации.Владелец.Артикул;
КонецФункции

&НаКлиенте
Процедура ПересчитатьИтогПоСтрокеВКоробах(ИмяТЧ, ПолеДобавить, ПолеУдалить)
	ТД = Элементы[ИмяТЧ].ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.Количество = ТД.КоличествоСИзменениями + ТД[ПолеДобавить] - ТД[ПолеУдалить];
		ТД.Сумма = ТД.Количество * ТД.ЦенаКороба;
		Если ТД.Количество < 0 Тогда
			ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
			СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьЗаказИзменен();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуВКоробах(Команда)
	ТД = Элементы.ТоварыВКоробах.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ИдентификаторСтроки = ТД.ПолучитьИдентификатор();
		СтрокаЗаказа = Объект.ТоварыВКоробах.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаЗаказа <> Неопределено Тогда
			Индекс = Объект.ТоварыВКоробах.Индекс(СтрокаЗаказа);
			Объект.ТоварыВКоробах.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВКоробахПриАктивизацииСтроки(Элемент)
	Элементы.ТоварыВКоробахУдалитьСтрокуВКоробах.Доступность = Ложь;
	ТД = Элементы.ТоварыВКоробах.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Элементы.ТоварыВКоробахУдалитьСтрокуВКоробах.Доступность = ТД.флДобавленаВручную;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	ЗаполнитьТаблицаЗаказы();
	УправлениеДоступностьюТаблиц();
	Если РежимРаботы = 1 Тогда
		Элементы.ВыборСтатуса.Доступность = Истина;
	Иначе
		Элементы.ВыборСтатуса.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезервыНаСервере()
	
	СхемаКомпоновкиДанных = Отчеты.ОстаткиИДоступностьТоваров.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	НастройкиОтчета = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтчета);
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
    ГруппировкаДетальныеПоля = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
    ГруппировкаДетальныеПоля.Использование = Истина;
    Автополе = ГруппировкаДетальныеПоля.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
    Автополе.Использование = Истина;
	
	ПолеПараметрыДанных	= Новый ПолеКомпоновкиДанных("ПараметрыДанных");
	ПолеСистемныеПоля	= Новый ПолеКомпоновкиДанных("СистемныеПоля"); 
    Для Каждого ПолеВыбора Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Использование	= Не (ПолеВыбора.Поле = ПолеПараметрыДанных ИЛИ ПолеВыбора.Поле = ПолеСистемныеПоля);
		ВыбранноеПоле.Поле			= ПолеВыбора.Поле;
	КонецЦикла;	 
	
	ПараметрОбособленныеТовары = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПоказатьОбособленныеТовары");
	Если ПараметрОбособленныеТовары <> Неопределено Тогда
		ПараметрОбособленныеТовары.Значение = Истина;
	КонецЕсли;
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= Объект.Резервы.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование		= Истина;
	ЭлементОтбора.ПравоеЗначение	= мЗаказКлиента.Склад;
	
	СегментыСервер.ВключитьОтборПоСегментуНоменклатурыВСКД(КомпоновщикНастроек);

	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос;

	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаВесНоменклатуры", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаВесУпаковки("Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура"));
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса, 
		"&ТекстЗапросаОбъемНоменклатуры", 
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаОбъемУпаковки("Таблица.Номенклатура.ЕдиницаИзмерения", "Таблица.Номенклатура"));

	СхемаКомпоновкиДанных.НаборыДанных.Основной.Запрос = ТекстЗапроса;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();    
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , );
    
    Таблица = Новый ТаблицаЗначений;
    
    ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьОбъект(Таблица);
    ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
	МассивУдалитьСтроки = Новый Массив;
	Для Каждого СтрокаТЗ Из Таблица Цикл
		Если СтрокаТЗ["ТипЗаписи"] <> "Сейчас" Тогда
			МассивУдалитьСтроки.Добавить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	Для Каждого УдалитьСтроку Из МассивУдалитьСтроки Цикл
		Таблица.Удалить(УдалитьСтроку);
	КонецЦикла;
	ТаблицаОстатки = Таблица.Скопировать();
	ТаблицаОстатки.Свернуть("Склад, Номенклатура, Характеристика, ЗаказНаОтгрузку","Доступно");
	
	СтруктураПоиска = Новый Структура("Склад, Номенклатура, Характеристика, ЗаказНаОтгрузку");
	Для Каждого СтрокаТЧ Из Объект.Резервы Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
		СтруктураПоиска["ЗаказНаОтгрузку"] = мЗаказКлиента;
		НайденныеСтроки = ТаблицаОстатки.НайтиСтроки(СтруктураПоиска);
		Доступно = 0;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Доступно = Доступно + НайденнаяСтрока["Доступно"];
		КонецЦикла;
		СтрокаТЧ["ТоварВРезерве"] = Доступно;
		
		СтруктураПоиска["ЗаказНаОтгрузку"] = Неопределено;
		НайденныеСтроки = ТаблицаОстатки.НайтиСтроки(СтруктураПоиска);
		Доступно = 0;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Доступно = Доступно + НайденнаяСтрока["Доступно"];
		КонецЦикла;
		СтрокаТЧ["ДоступноНаСкладе"] = Доступно;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогПоСтрокеРезерва()
	ТД = Элементы.Резервы.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТД.Количество = ТД.КоличествоСИзменениями + ТД.Зарезервировать - ТД.СнятьРезерв - ТД.ПеренестиВДругойЗаказ;
		ТД.КоличествоУпаковок = ТД.Количество;
		Если ТД.Количество < 0 Тогда
			ТекстСообщения = "Отрицательный предварительный итог в строке заказа:" + ТД.НомерСтроки;
			СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьЗаказИзменен();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиНомерВерсииЗаказаПоСтатусу(мЗаказКлиента, ВыборСтатуса)
	
	НомерВерсииЗаказа = 1;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	             |	ВерсииОбъектов.НомерВерсии КАК НомерВерсии,
	             |	ВерсииОбъектов.ВерсияОбъекта КАК ВерсияОбъекта,
	             |	ВерсииОбъектов.ЕстьДанныеВерсии КАК ЕстьДанныеВерсии
	             |ИЗ
	             |	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	             |ГДЕ
	             |	ВерсииОбъектов.Объект = &Объект
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	НомерВерсии";
	Запрос.УстановитьПараметр("Объект", мЗаказКлиента);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Статус = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка();
	Если ВыборСтатуса = 0 Тогда
		Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	ИначеЕсли ВыборСтатуса = 1 Тогда
		Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
	КонецЕсли;
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВерсияОбъекта  = ВерсионированиеОбъектов.РазборВерсии(мЗаказКлиента, Выборка.НомерВерсии);
		СтрокаСтатус = ВерсияОбъекта.Реквизиты.Найти("Статус", "НаименованиеРеквизита");
		Если СтрокаСтатус <> Неопределено Тогда
			Если СтрокаСтатус["ЗначениеРеквизита"] = Статус Тогда
				Возврат Выборка.НомерВерсии;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат НомерВерсииЗаказа;
КонецФункции

&НаКлиенте
Процедура ПеречитатьЗаказ(Команда)
	мДатаОбновленияИзИ5 = _омОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(мЗаказКлиента, "Документ.ЗаказКлиента", "гф_ДатаОбновленияИзИ5");
КонецПроцедуры

&НаСервере
Функция ПолучитьНазначение(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Назначения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Назначения КАК Назначения
	               |ГДЕ
	               |	Назначения.Заказ = &Заказ
	               |	И НЕ Назначения.ПометкаУдаления";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Назначение = Справочники.Назначения.СоздатьЭлемент();
		Назначение.Заказ = Заказ;
		Назначение.ТипНазначения = Перечисления.ТипыНазначений.Собственное;
		Назначение.ВидДеятельностиНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		Назначение.ДвиженияПоСкладскимРегистрам = Истина;
		Назначение.Записать();
		ТекстСообщения = "Создан Назначение:" + Назначение.Ссылка + " для Заказа" + Заказ;
		СообщитьПользователю(ТекстСообщения);
		Возврат Назначение.Ссылка;
	Иначе
		Выборка = Результат.Выбрать();
		Элементы.мНазначение.Доступность = Истина;
		Если Выборка.Количество() = 1 Тогда
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Ссылка;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			Элементы.мНазначение.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАналитикуУчетаНоменклатуры(Номенклатура, Характеристика, Склад, Назначение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	               |ГДЕ
	               |	КлючиАналитикиУчетаНоменклатуры.Номенклатура = &Номенклатура
	               |	И КлючиАналитикиУчетаНоменклатуры.Характеристика = &Характеристика
	               |	И КлючиАналитикиУчетаНоменклатуры.МестоХранения = &МестоХранения
	               |	И КлючиАналитикиУчетаНоменклатуры.Назначение = &Назначение
	               |	И НЕ КлючиАналитикиУчетаНоменклатуры.ПометкаУдаления";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("МестоХранения", Склад);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Аналитика = Справочники.КлючиАналитикиУчетаНоменклатуры.СоздатьЭлемент();
		Аналитика.Номенклатура = Номенклатура;
		Аналитика.Характеристика = Характеристика;
		Аналитика.МестоХранения = Склад;
		Аналитика.СкладскаяТерритория = Склад;
		Аналитика.Назначение = Назначение;
		Аналитика.ТипМестаХранения = Перечисления.ТипыМестХранения.Склад;
		Аналитика.Записать();
		Возврат Аналитика.Ссылка;
	Иначе
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПодготовитьТабДокНаСервере()
	ТабПротокол = Новый ТабличныйДокумент;
	
	ТабПротокол.АвтоМасштаб = Истина;
	ТабПротокол.ОтображатьЗаголовки = Ложь;
	ТабПротокол.ОтображатьСетку = Ложь;
	ТабПротокол.ТолькоПросмотр = Истина;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Протокол");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ТабПротокол.Вывести(ОбластьШапка);
	Для Каждого СтрокаПротокола Из ТЗПротокол Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаПротокола);
		ТабПротокол.Вывести(ОбластьСтрока);
	КонецЦикла;
		
	Возврат ТабПротокол;
	
КонецФункции

&НаСервере
Функция МаксимальныйКодСтрокиТовары()
	МаксимальныйКодСтроки = 0;
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если МаксимальныйКодСтроки < СтрокаТЧ["КодСтроки"] Тогда
			МаксимальныйКодСтроки = СтрокаТЧ["КодСтроки"];
		КонецЕсли;
	КонецЦикла;
	Возврат МаксимальныйКодСтроки;
КонецФункции

&НаСервере
Функция МаксимальныйКодСтрокиРезервы()
	МаксимальныйКодСтроки = 0;
	Для Каждого СтрокаТЧ Из Объект.Резервы Цикл
		Если МаксимальныйКодСтроки < СтрокаТЧ["КодСтроки"] Тогда
			МаксимальныйКодСтроки = СтрокаТЧ["КодСтроки"];
		КонецЕсли;
	КонецЦикла;
	Возврат МаксимальныйКодСтроки;
КонецФункции

&НаСервере
Процедура ПеренестиРезервНаСервере(ПолеКоличество, ПолеНазначение, ИзменитьЗаказ = Ложь)
	ТаблицаНазначений = Объект.Резервы.Выгрузить();
	ТаблицаНазначений.Свернуть(ПолеНазначение);
	ИсходноеНазначение = мНазначение;
	Для Каждого СтрокаНазначение Из ТаблицаНазначений Цикл
		Если Не ЗначениеЗаполнено(СтрокаНазначение[ПолеНазначение]) Тогда
			Продолжить;
		КонецЕсли;
		ДокКорректировка = Документы.КорректировкаНазначенияТоваров.СоздатьДокумент();
		ДокКорректировка.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокКорректировка.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокКорректировка.Организация = отборОрганизация;
		ДокКорректировка.Дата = ТекущаяДатаСеанса();
		ДокКорректировка.ВидОперации = Перечисления.ВидыОперацийКорректировкиНазначения.РезервироватьИКорректировать;
		ДокКорректировка.Комментарий = "Создан автоматически обработкой Корректировка заказов и резервов " + ТекущаяДатаСеанса();
		ДокКорректировка.Назначение = СтрокаНазначение[ПолеНазначение];
		СтруктураПоиска = Новый Структура(ПолеНазначение, ДокКорректировка.Назначение);
		СтрокиРезерва = Объект.Резервы.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЧ Из СтрокиРезерва Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ[ПолеКоличество]) Тогда
				нс = ДокКорректировка.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ);
				нс.Количество = СтрокаТЧ[ПолеКоличество];
				нс.КоличествоУпаковок = СтрокаТЧ[ПолеКоличество];
				нс.ИсходноеНазначение = ИсходноеНазначение;
				нс.ИсходныйЗаказ = мЗаказКлиента;
				нс.ИсходноеНазначениеДвиженияПоСкладскимРегистрам = Истина;
				// Аналитика учета заполняется при проведении документа автоматически...
			КонецЕсли;
		КонецЦикла;
		Попытка
			ДокКорректировка.Записать(РежимЗаписиДокумента.Проведение);
			ТекстСообщения = "Проведен:" + ДокКорректировка.Ссылка;
			СообщитьПользователю(ТекстСообщения);
			СтрокаПротокола = ТЗПротокол.Добавить();
			СтрокаПротокола.Документ = ДокКорректировка.Ссылка;
			СтрокаПротокола.Комментарий = "Создан и проведен";
		Исключение
			ТекстСообщения = "Ошибка при записи:" + ОписаниеОшибки();
			СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		Если ИзменитьЗаказ Тогда
			// здесь вносим изменения в Заказ (новое назначение)
			Если ЗначениеЗаполнено(ДокКорректировка.Назначение.Заказ) Тогда
				ДокЗаказ = ДокКорректировка.Назначение.Заказ.ПолучитьОбъект();
				СтруктураПоиска = Новый Структура("Назначение", ДокКорректировка.Назначение);
				СтрокиРезерва = тчТовары.НайтиСтроки(СтруктураПоиска);
				Для Каждого СтрокаТЧ Из СтрокиРезерва Цикл
					СтрокаЗаказа = ДокЗаказ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаТЧ);
				КонецЦикла;
				СкидкиНаценкиСервер.ЗаполнитьКлючиСвязиВТабличнойЧастиТовары(ДокЗаказ, "Товары");
			КонецЕсли;
			Попытка
				ДокЗаказ.Записать(РежимЗаписиДокумента.Проведение);
				ТекстСообщения = "Проведен:" + ДокЗаказ.Ссылка;
				СообщитьПользователю(ТекстСообщения);
				СтрокаПротокола = ТЗПротокол.Добавить();
				СтрокаПротокола.Документ = ДокЗаказ.Ссылка;
				СтрокаПротокола.Комментарий = "Изменен и проведен";
			Исключение
				ТекстСообщения = "Ошибка при записи:" + ОписаниеОшибки();
				СообщитьПользователю(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧВКоробах(ИмяТЧ, НомерВерсии = 1)
	// здесь надо получить первоначальные данные заказа из регистра сведений ВерсииОбъектов
	ВерсияОбъекта  = ВерсионированиеОбъектов.РазборВерсии(мЗаказКлиента, НомерВерсии);
	Если ТипЗнч(ВерсияОбъекта) = Тип("Структура") Тогда
		Для Каждого СтрокаТЧ Из ВерсияОбъекта.ТабличныеЧасти["гф_ТоварыВКоробах"] Цикл
			нс = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ, "
			|ВариантКомплектации,
			|ЦенаКороба,
			|Сумма,
			|IDКороба");
			нс.Артикул = нс.ВариантКомплектации.Владелец.Артикул;
			нс.КоличествоПервоначально = СтрокаТЧ.Количество;
		КонецЦикла;
	КонецЕсли;
	
	// и текущие данные заказа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка КАК Ссылка,
	|	ЗаказКлиентагф_ТоварыВКоробах.НомерСтроки КАК НомерСтроки,
	|	ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации КАК ВариантКомплектации,
	|	ЗаказКлиентагф_ТоварыВКоробах.Количество КАК Количество,
	|	ЗаказКлиентагф_ТоварыВКоробах.ЦенаКороба КАК ЦенаКороба,
	|	ЗаказКлиентагф_ТоварыВКоробах.Сумма КАК Сумма,
	|	ЗаказКлиентагф_ТоварыВКоробах.IDКороба КАК IDКороба
	|ИЗ
	|	Документ.ЗаказКлиента.гф_ТоварыВКоробах КАК ЗаказКлиентагф_ТоварыВКоробах
	|ГДЕ
	|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", мЗаказКлиента);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ВариантКомплектации", Выборка.ВариантКомплектации);
		СтрокиЗаказа = Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
		Если СтрокиЗаказа.Количество() > 0 Тогда
			СтрокаЗаказа = СтрокиЗаказа[0];
		Иначе
			СтрокаЗаказа = Объект[ИмяТЧ].Добавить();
			СтрокаЗаказа.Артикул = СтрокаЗаказа.ВариантКомплектации.Владелец.Артикул;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаЗаказа, Выборка);
		СтрокаЗаказа.Артикул = СтрокаЗаказа.ВариантКомплектации.Владелец.Артикул;
		СтрокаЗаказа.КоличествоСИзменениями = Выборка.Количество;
		СтрокаЗаказа.флНаличиеВЗаказе = Истина;
	КонецЦикла;
	
	Для Каждого СтрокаЗаказа Из Объект[ИмяТЧ] Цикл
		Если СтрокаЗаказа.КоличествоСИзменениями > СтрокаЗаказа.КоличествоПервоначально Тогда
			СтрокаЗаказа.Добавлено = СтрокаЗаказа.КоличествоСИзменениями - СтрокаЗаказа.КоличествоПервоначально;
		Иначе
			СтрокаЗаказа.Удалено = СтрокаЗаказа.КоличествоПервоначально - СтрокаЗаказа.КоличествоСИзменениями;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧВПарах(ИмяТЧ, НомерВерсии = 1)
	// здесь надо получить первоначальные данные заказа из регистра сведений ВерсииОбъектов
	ВерсияОбъекта  = ВерсионированиеОбъектов.РазборВерсии(мЗаказКлиента, НомерВерсии);
	Если ТипЗнч(ВерсияОбъекта) = Тип("Структура") Тогда
		Для Каждого СтрокаТЧ Из ВерсияОбъекта.ТабличныеЧасти["Товары"] Цикл
			нс = Объект[ИмяТЧ].Добавить();
			ЗаполнитьЗначенияСвойств(нс, СтрокаТЧ, "
			|Номенклатура,
			|Характеристика,
			|Упаковка,
			|Обособленно,
			|Отменено,
			|ПричинаОтмены,
			|гф_ДобавленоПоПричине,
			|гф_ПричинаДобавления,
			|Цена,
			|Сумма,
			|СтавкаНДС,
			|СуммаНДС,
			|СуммаСНДС,
			|КодСтроки,
			|КлючСвязи,
			|Склад,
			|ДатаОтгрузки,
			|ВариантОбеспечения,
			|ИдентификаторСтроки");
			Если НЕ СтрокаТЧ.Отменено Тогда
				нс.КоличествоПервоначально = СтрокаТЧ.Количество;
				нс.КоличествоУпаковок = СтрокаТЧ.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// и текущие данные заказа
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиентаТовары.Обособленно КАК Обособленно,
	|	ЗаказКлиентаТовары.Отменено КАК Отменено,
	|	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
	|	ЗаказКлиентаТовары.гф_ДобавленоПоПричине КАК гф_ДобавленоПоПричине,
	|	ЗаказКлиентаТовары.гф_ПричинаДобавления КАК гф_ПричинаДобавления,
	|	ЗаказКлиентаТовары.Цена КАК Цена,
	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
	|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
	|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
	|	ЗаказКлиентаТовары.Склад КАК Склад,
	|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ЗаказКлиентаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", мЗаказКлиента);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки", Выборка.ИдентификаторСтроки);
		СтрокиЗаказа = Объект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
		Если СтрокиЗаказа.Количество() > 0 Тогда
			СтрокаЗаказа = СтрокиЗаказа[0];
		Иначе
			СтрокаЗаказа = Объект[ИмяТЧ].Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаЗаказа, Выборка);
		СтрокаЗаказа.КоличествоСИзменениями = Выборка.Количество;
		Если СтрокаЗаказа.Отменено Тогда
			СтрокаЗаказа.Количество = 0;
			СтрокаЗаказа.КоличествоУпаковок = 0;
			СтрокаЗаказа.КоличествоСИзменениями = 0;
		КонецЕсли;
		СтрокаЗаказа.флНаличиеВЗаказе = Истина;
	КонецЦикла;
	
	Для Каждого СтрокаЗаказа Из Объект[ИмяТЧ] Цикл
		Если СтрокаЗаказа.КоличествоСИзменениями > СтрокаЗаказа.КоличествоПервоначально Тогда
			СтрокаЗаказа.Добавлено = СтрокаЗаказа.КоличествоСИзменениями - СтрокаЗаказа.КоличествоПервоначально;
		Иначе
			СтрокаЗаказа.Удалено = СтрокаЗаказа.КоличествоПервоначально - СтрокаЗаказа.КоличествоСИзменениями;
		КонецЕсли;
		Если СтрокаЗаказа.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			СтрокаЗаказа.флТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьПользователю(Текст)
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
КонецПроцедуры	

#КонецОбласти
