
&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	// ++ Галфинд СадомцевСА 14.03.2023 Реализовал заполнение Доп. сведения "Срок платежа" при проведении документа
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edbe4fb7595601
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = &ИдентификаторДляФормул";
	Запрос.УстановитьПараметр("ИдентификаторДляФормул", "гф_РТУСрокПлатежа");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ДопСведение = Выборка.Ссылка;
	
	ДнейОтсрочкиПлатежа = НайтиКоличествоДнейОтсрочкиПлатежа(Договор);
	
	ДеньВСекундах = 86400;
	СрокПлатежа = Дата + (ДеньВСекундах * ДнейОтсрочкиПлатежа);
	
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Свойство.Установить(ДопСведение);
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Ссылка;
	Запись.Свойство = ДопСведение;
	Запись.Значение = СрокПлатежа;
	НаборЗаписей.Записать();
	// -- Галфинд СадомцевСА 14.03.2023
КонецПроцедуры

Функция НайтиКоличествоДнейОтсрочкиПлатежа(Договор)
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат 0;
	КонецЕсли;
	ДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул",
		"гф_ДоговорыКонтрагентовКоличествоДнейОтсрочкиПлатежа");
	КоличествоДнейОтсрочкиПлатежа = УправлениеСвойствами.ЗначениеСвойства(Договор, ДопРеквизит);
	Если ЗначениеЗаполнено(КоличествоДнейОтсрочкиПлатежа) Тогда
		Возврат КоличествоДнейОтсрочкиПлатежа;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&После("ОбработкаУдаленияПроведения")
Процедура гф_ОбработкаУдаленияПроведения(Отказ)
	// ++ Галфинд СадомцевСА 14.03.2023 Реализовал удаление Доп. сведения "Срок платежа" при отмене проведения документа
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edbe4fb7595601
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	               |ГДЕ
	               |	ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = &ИдентификаторДляФормул";
	Запрос.УстановитьПараметр("ИдентификаторДляФормул", "гф_РТУСрокПлатежа");
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ДопСведение = Выборка.Ссылка;
	
	//ДнейОтсрочкиПлатежа = НайтиКоличествоДнейОтсрочкиПлатежа(Договор);
	//
	//СрокПлатежа = Дата + ДнейОтсрочкиПлатежа;
	//
	НаборЗаписей = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Свойство.Установить(ДопСведение);
	//Запись = НаборЗаписей.Добавить();
	//Запись.Объект = Ссылка;
	//Запись.Свойство = ДопСведение;
	//Запись.Значение = СрокПлатежа;
	НаборЗаписей.Записать();
	// -- Галфинд СадомцевСА 14.03.2023
КонецПроцедуры
