#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// #wortmann {
	// Формируем массив обрабатывааемых типов значений ТипыВыбираемыхДанных
	// Галфинд Домнышева 2022/10/17
	ТипыВыбираемыхДанных = Новый Массив;
	ТипыВыбираемыхДанных.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	ТипыВыбираемыхДанных.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	ТипыВыбираемыхДанных.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	ТипыВыбираемыхДанных.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	ТипыВыбираемыхДанных.Добавить(Тип("ДокументСсылка.УстановкаЦенНоменклатуры"));
	ТипыВыбираемыхДанных.Добавить(Тип("СправочникСсылка.ВариантыКомплектацииНоменклатуры"));
    // } #wortmann
	Если ВыбранноеЗначение = Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ТипОбъекта = Тип("СправочникСсылка.Номенклатура");		
		Элементы.Объект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.Объект.СписокВыбора.Очистить();
		Элементы.Объект.КнопкаВыпадающегоСписка = Истина;
		ДополнениеСпискаВыбораОбъекта(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда	
		
		Элементы.Объект.ОграничениеТипа =  Новый ОписаниеТипов
		("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
	ИначеЕсли ТипыВыбираемыхДанных.Найти(ВыбранноеЗначение) <> Неопределено Тогда   
		// #wortmann {
		// Изменен код условия, все возможные типы выибираемых данных вынесены выше в массив
		// Галфинд Домнышева 2022/10/17
		// } #wortmann
		СтандартнаяОбработка = Ложь;
		Объект.ТипОбъекта = ВыбранноеЗначение;		
		Элементы.Объект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.Объект.СписокВыбора.Очистить();
		Элементы.Объект.КнопкаВыпадающегоСписка = Истина;
		ДополнениеСпискаВыбораОбъекта(ВыбранноеЗначение);	
	Иначе
		СтандартнаяОбработка = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДополнениеСпискаВыбораОбъекта(ВыбранноеЗначение)
	
	Для Каждого Реквизит Из Метаданные.НайтиПоТипу(ВыбранноеЗначение).Реквизиты Цикл 
		Элементы.Объект.СписокВыбора.Добавить(Реквизит.Имя); 
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.НайтиПоТипу(ВыбранноеЗначение).СтандартныеРеквизиты Цикл 
		Элементы.Объект.СписокВыбора.Добавить(Реквизит.Имя); 
	КонецЦикла;
	Для Каждого Таблица Из Метаданные.НайтиПоТипу(ВыбранноеЗначение).ТабличныеЧасти Цикл 
		Для Каждого Реквизит Из Таблица.Реквизиты Цикл 
			Элементы.Объект.СписокВыбора.Добавить(Реквизит.Имя + "(" + Таблица.Имя + ")"); 
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти                                                                                           