#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("СправочникСсылка.Номенклатура") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ТипОбъекта = Тип("СправочникСсылка.Номенклатура");		
		Элементы.Объект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.Объект.СписокВыбора.Очистить();
		Элементы.Объект.КнопкаВыпадающегоСписка = Истина;
		ДобополнениеСпискаВыбораОбъекта(ВыбранноеЗначение);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.НаборыДополнительныхРеквизитовИСведений") Тогда	
		
		Элементы.Объект.ОграничениеТипа =  Новый ОписаниеТипов
		("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения");
	ИначеЕсли ВыбранноеЗначение = Тип("ДокументСсылка.ЗаказКлиента") ИЛИ
		ВыбранноеЗначение = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") ИЛИ
		ВыбранноеЗначение = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") ИЛИ
		ВыбранноеЗначение = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ТипОбъекта = ВыбранноеЗначение;		
		Элементы.Объект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		Элементы.Объект.СписокВыбора.Очистить();
		Элементы.Объект.КнопкаВыпадающегоСписка = Истина;
		ДобополнениеСпискаВыбораОбъекта(ВыбранноеЗначение);	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобополнениеСпискаВыбораОбъекта(ВыбранноеЗначение)
	
	Для Каждого Реквизит Из Метаданные.НайтиПоТипу(ВыбранноеЗначение).Реквизиты Цикл 
		Элементы.Объект.СписокВыбора.Добавить(Реквизит.Имя); 
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.НайтиПоТипу(ВыбранноеЗначение).СтандартныеРеквизиты Цикл 
		Элементы.Объект.СписокВыбора.Добавить(Реквизит.Имя); 
	КонецЦикла;
	Для Каждого Таблица Из Метаданные.НайтиПоТипу(ВыбранноеЗначение).ТабличныеЧасти Цикл 
		Для Каждого Реквизит Из Таблица.Реквизиты Цикл 
			Элементы.Объект.СписокВыбора.Добавить(Реквизит.Имя + "(" + Таблица.Имя + ")"); 
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти