#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	// ++ Галфинд_Домнышева 2023/04/10 
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=8131bcee7bda45d711edd201ed470fa8
	Если ЗначениеЗаполнено(ЗаявкаНаВозвратТоваровОтКлиента) Тогда
		//ЗапросТекст = гф_ПолучитьТекст();
		//ЗапросТоваровКПоступлению = ТекстыЗапроса.НайтиПоЗначению(ЗапросТекст);
		// РН ЗаказыКлиентов
	ДокументСсылка = ЭтотОбъект.Ссылка;
	Документ = ДокументСсылка.ПолучитьОбъект();
	
	НаборЗаписей = Документ.Движения.ТоварыКПоступлению;
	НаборЗаписей.Прочитать();
	МассивЗаписейНаУдаление = Новый Массив;

	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если Запись.ДокументПоступления = Ссылка Тогда
			МассивЗаписейНаУдаление.Добавить(Запись);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ЗаписьКУдалению Из МассивЗаписейНаУдаление Цикл
	НаборЗаписей.Удалить(ЗаписьКУдалению);
    КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
	КонецЕсли;
     // -- Галфинд_Домнышева 2023/04/10
КонецПроцедуры

&После("ПриЗаписи")
Процедура гф_ПриЗаписи(Отказ)
	// ++ Галфинд_Домнышева 2023/04/10 
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=8131bcee7bda45d711edd201ed470fa8
	РежимЗаписи = ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЗаявкаНаВозвратТоваровОтКлиента)
		// Изменено Галфинд_Домнышева_26_06_2023 В связи с добавлением новых статусов в Заявку на возврат, документ Возврат создается когда заявка в статусе гф_КМПроверены
		И ЗаявкаНаВозвратТоваровОтКлиента.Статус = Перечисления.СтатусыЗаявокНаВозвратТоваровОтКлиентов.гф_КМПроверены Тогда 
		СчетФактура = ПолучитьСчетФактуруПоСвязаннымДокумента(ДокументРеализации);	
		Если СчетФактура <> Неопределено Тогда
			СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
			СчетФактураОбъект.ДокументОснование = Ссылка;
			СчетФактураОбъект.Перевыставленный = Ложь;
			СчетФактураОбъект.ДокументыОснования[0].ДокументОснование = Ссылка;
			СчетФактураОбъект.ОбменДанными.Загрузка = Истина;
			СчетФактураОбъект.Записать();
			ПараметрыРегистрации = Документы.ВозвратТоваровОтКлиента.ПараметрыРегистрацииСчетовФактурПолученных(ЭтотОбъект);
			//РежимЗаписи = ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи;
			УчетНДСУП.АктуализироватьСчетаФактурыПолученныеПередЗаписью(ПараметрыРегистрации, РежимЗаписи, ПометкаУдаления, Проведен);
		КонецЕсли;
	КонецЕсли;
    // -- Галфинд_Домнышева 2023/04/10

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// #wortmann { 
// Получение Счет-фактуры по ДокументРеализации 
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8131bcee7bda45d711edd201ed470fa8
// Галфинд_Домнышева 2023/04/10
Функция ПолучитьСчетФактуруПоСвязаннымДокумента(ДокументРеализации)
	
	// текст запроса изменен
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee8a9b9679e068
	// Галфинд_домнышеваКР_24_11_2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ВозвратТоваровОтКлиентаТовары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_товары
		|ИЗ
		|	&ТоварыПоВозврату КАК ВозвратТоваровОтКлиентаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализации
		|ГДЕ
		|	КорректировкаРеализации.Ссылка.ДокументОснование = &ДокументОснование
		|	И (КорректировкаРеализации.Номенклатура, КорректировкаРеализации.Характеристика) В
		|			(ВЫБРАТЬ
		|				ВТ_товары.Номенклатура,
		|				ВТ_товары.Характеристика
		|			ИЗ
		|				ВТ_товары КАК ВТ_товары)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный,
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование В (ВременнаяТаблица.Ссылка)
		|	И СчетФактураВыданный.ПометкаУдаления = ЛОЖЬ";
	
	ТоварыПоВозврату = ЭтотОбъект.Товары.Выгрузить();
	ТоварыПоВозврату.Свернуть("Номенклатура, Характеристика"); 
	
	Запрос.УстановитьПараметр("ТоварыПоВозврату", ТоварыПоВозврату);

	Запрос.УстановитьПараметр("ДокументОснование", ДокументРеализации);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции// } #wortmann

#КонецОбласти

#КонецЕсли
