#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

&Вместо("ДанныеДокументаДляПроведения")
Функция гф_ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры)
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edc30156a893ed
	// гф_возвратWMN устанавливается в ИСТИНА, если корректировка реализации создается по кнопке
	//из документа "ЗаявкаНаВозвратТоваровОтКлиента"
	// Галфинд Sakovich 2023/03/16
	Если Документ.гф_возвратWMN Тогда
		//таблицы движений не формируются (документ не делает никаких движений)
		Возврат Неопределено;
	Иначе
		Результат = ПродолжитьВызов(Документ, Регистры, ДопПараметры);
		Возврат Результат;
	КонецЕсли;
	// } #wortmann

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
