
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСсылок.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.РасходныйОрдерНаТовары");
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПечатнуюФорму(Команда)
	СформироватьПечатнуюФормуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьПечатнуюФормуНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ИдентификаторКоманды = ВРег(ОбъектОбработки.Метаданные().Имя);
	
	МассивОбъектов = СписокСсылок.ВыгрузитьЗначения();
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(ИдентификаторКоманды);
	ПараметрыВывода = УправлениеПечатью.ПодготовитьСтруктуруПараметровВывода();
	//ПараметрыВывода.Вставить("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	ОбъектыПечати = Новый СписокЗначений;
	
	ОбъектОбработки.Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
	Для Каждого СтрокаКоллекцииПечатныхФорм Из КоллекцияПечатныхФорм Цикл 
		Если ТипЗнч(СтрокаКоллекцииПечатныхФорм.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда 
			ТабличныйДокумент = СтрокаКоллекцииПечатныхФорм.ТабличныйДокумент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

