
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ОбъектыМетаданных") Тогда
		ОбъектыМетаданных = СтрСоединить(Параметры.ОбъектыМетаданных, Символы.ПС);
	КонецЕсли;
	
	ПерезаполнитьОбъектыМетаданных = Истина;
	Если Параметры.Свойство("ПерезаполненыОбъекты") И Параметры.ПерезаполненыОбъекты Тогда
		ПерезаполнитьОбъектыМетаданных = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаписатьЗаголовокОбъектовМетаданных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	
	ОбъектыМетаданных = "";
	
	НаписатьЗаголовокОбъектовМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьИзФайла(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.МножественныйВыбор = Ложь;
	ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл для загрузки'");
   	ПараметрыДиалога.Фильтр = НСтр("ru = '(*.дым)|*.дым'");

	ОбработчикОкончанияПомещения = Новый ОписаниеОповещения("ОкончанияВыбораФайла", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ОбработчикОкончанияПомещения,,,, ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбъектамиРасширений(Команда)
	
	ЗаполнитьИзРасширений();
	
	НаписатьЗаголовокОбъектовМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзХранилища(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьИзХранилищаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ВнешняяОбработка.ТестерВышелПодымить.Форма.ВыборОбъектовИзХранилища", ПараметрыФормы, ЭтотОбъект,,,,
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ОбъектыМетаданных, УникальныйИдентификатор);
	
	ИмяСохраняемогоФайла = Элементы.ОбъектыМетаданных.Заголовок + ".дым";
	
	НачатьПолучениеФайлаССервера(АдресХранилища, ИмяСохраняемогоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОбъектыМетаданных(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ПерезаполнитьОбъектыМетаданных", ПерезаполнитьОбъектыМетаданных);	
	ПараметрыЗакрытия.Вставить("ОбъектыМетаданных", ОбъектыМетаданных);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхПриИзменении(Элемент)
	
	НаписатьЗаголовокОбъектовМетаданных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Расширения

&НаСервере
Процедура ЗаполнитьИзРасширений()
	
	МассивОбъектов = Новый Массив;
	
	ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, "Документы");
	
	ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, "Справочники");
	ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, "ПланыВидовХарактеристик");
	ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, "ПланыВидовРасчета");
	
	ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, "Отчеты");
	ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, "Обработки");
	
	Если ЗначениеЗаполнено(МассивОбъектов) Тогда
		
		СписокОбъектов = Новый СписокЗначений;
		СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
		СписокОбъектов.СортироватьПоЗначению();
		МассивОбъектов = СписокОбъектов.ВыгрузитьЗначения();
		
		ОбъектыМетаданных = СтрСоединить(МассивОбъектов, Символы.ПС);
		
	Иначе
		ОбъектыМетаданных = "";	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьИзмененияКлассаВРасширениях(МассивОбъектов, Класс)
	
	Для Каждого Метаданное Из Метаданные[Класс] Цикл
		
		ПолноеИмяОбъекта = Метаданное.ПолноеИмя();
		
		Если (Метаданное.ЕстьИзмененияРасширениямиКонфигурации() Или Метаданное.РасширениеКонфигурации() <> Неопределено)
			И МассивОбъектов.Найти(ПолноеИмяОбъекта) = Неопределено Тогда
			МассивОбъектов.Добавить(ПолноеИмяОбъекта);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОкончанияВыбораФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт

	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеПомещенногоФайла.Адрес);
	ИмяФайлаДанных = ПолучитьИмяВременногоФайла("txt");
	ДвоичныеДанные.Записать(ИмяФайлаДанных);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайлаДанных);
	
	ОбъектыМетаданных = ТекстовыйДокумент.ПолучитьТекст();
	
	НаписатьЗаголовокОбъектовМетаданных();
	
	УдалитьФайлы(ИмяФайлаДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзХранилищаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;  
	
	ДополнитьОбъектыМетаданныхИзМассива(Результат);
	
	НаписатьЗаголовокОбъектовМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьОбъектыМетаданныхИзМассива(МассивОткуда)
	
	МассивОбъектов = СтрРазделить(ОбъектыМетаданных, Символы.ПС, Ложь);
	
	Для Каждого ПолноеИмяОбъекта Из МассивОткуда Цикл
		
		Если ЗначениеЗаполнено(ПолноеИмяОбъекта) И МассивОбъектов.Найти(ПолноеИмяОбъекта) = Неопределено  Тогда
			МассивОбъектов.Добавить(ПолноеИмяОбъекта);	
		КонецЕсли;
		
	КонецЦикла;
		
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(МассивОбъектов);
	СписокОбъектов.СортироватьПоЗначению();
	МассивОбъектов = СписокОбъектов.ВыгрузитьЗначения();
	
	ОбъектыМетаданных = СтрСоединить(МассивОбъектов, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьЗаголовокОбъектовМетаданных()
	
	МассивОбъектов = СтрРазделить(ОбъектыМетаданных, Символы.ПС, Ложь);
	КоличествоСтрок = МассивОбъектов.Количество();
	
	Элементы.ОбъектыМетаданных.Заголовок = "Объекты конфигурации (" + КоличествоСтрок + ")";
	
КонецПроцедуры

#КонецОбласти