&НаКлиенте
Процедура ПодтвердитьВыбор(Действие)
	
	Если НЕ ЗначениеЗаполнено(ДатаПолученияЦен) Тогда
		Сообщить("Не указана дата цен!");
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ДатаЦен,ПроцентСкидки");
	СтруктураВозврата.Вставить("ДатаЦен", 		ДатаПолученияЦен);
	СтруктураВозврата.Вставить("ПроцентСкидки", ПроцентСкидки);
	СтруктураВозврата.Вставить("Действие", 		Действие);
	//Объект.Действие = Действие;
	Закрыть(СтруктураВозврата);
	
	
КонецПроцедуры

//Процедура ОсновныеДействияФормыОтказОтПодтверждения(Кнопка)

//	Закрыть(Неопределено);

//КонецПроцедуры
//&НаКлиенте
//Процедура ПриОткрытии()
//	
//	Если НЕ ЗначениеЗаполнено(Объект.ДатаПолученияЦен) Тогда
//		Объект.ДатаПолученияЦен = ТекущаяДата();
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзОтгрузкиРазличные(Команда)
	
	ПодтвердитьВыбор("ИсключитьИзОтгрузкиРазличные");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьПоЦенамЗаказа(Команда)
	
	ПодтвердитьВыбор("ОтгрузитьПоЦенамЗаказа");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьПоЦенамПрайса(Команда)
	
	ПодтвердитьВыбор("ОтгрузитьПоЦенамПрайса");
	//Закрыть("ОтгрузитьПоЦенамПрайса");
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ПодтвердитьВыбор("Отменить");
	
КонецПроцедуры

//&НаСервере
//Процедура ПриОткрытииНаСервере()
//	//Вставить содержимое обработчика
//КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПриОткрытииНаСервере();
	
	Если НЕ ЗначениеЗаполнено(ДатаПолученияЦен) Тогда
		ДатаПолученияЦен = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПолученияЦен = Параметры.Ключ.Дата;
	ПроцентСкидки = Параметры.Ключ.Скидка;
	
КонецПроцедуры
