
&Перед("ДополнитьТаблицыРегистрацииКОтражению")
Процедура гф_ДополнитьТаблицыРегистрацииКОтражению(Объект, ДополнительныеСвойстваОбъекта, ДополнительныеСвойстваРегистра, ТаблицаРегистрации, ВыборочнаяРегистрация, ТаблицаВыборочнойРегистрации)
	// #wortmann { 
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee8f5197032edf 
	// Галфинд_Домнышева 2023/11/30
	ДорабатываемыеСтатусы = Новый Массив;
	ДорабатываемыеСтатусы.Добавить(Перечисления.ТипыРегламентныхОпераций.РасчетНалогаНаПрибыль);
	ДорабатываемыеСтатусы.Добавить(Перечисления.ТипыРегламентныхОпераций.РасчетОтложенногоНалога);

	Если Объект.Метаданные().Реквизиты.Найти("ТипОперации") <> Неопределено 
		И ДорабатываемыеСтатусы.Найти(Объект.ТипОперации) <> Неопределено Тогда 
		Если ДополнительныеСвойстваОбъекта.Свойство("НеРегистрироватьКОтражениюВРеглУчете") Тогда
		ДополнительныеСвойстваОбъекта.НеРегистрироватьКОтражениюВРеглУчете = Ложь;
		КонецЕсли;

	КонецЕсли;
	// } #wortmann
КонецПроцедуры
