#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПодключитьсяКБазеОрганизации(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	вс = Справочники.гф_УзлыОбменаПоВозвратам.НайтиПоРеквизиту("Организация", Организация);
	Если ЗначениеЗаполнено(вс.ЗавершениеОбмена)
		И ТекущаяДата() > КонецДня(вс.ЗавершениеОбмена) Тогда
		
		Возврат Неопределено;	
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(вс) Тогда
		Возврат ПодключитьсяКБазе(вс);
	КонецЕсли;

КонецФункции

Функция ПодключитьсяКБазе(вс) Экспорт
	
	Перем сп;     
	
	УстановитьПривилегированныйРежим(Истина);
	Если вс.ФайловыйРежим Тогда
		
		Если ПустаяСтрока(вс.КаталогИБ) Тогда
			ВызватьИсключение "Не указан каталог ИБ";
		КонецЕсли;
		сп = "File=""" + вс.КаталогИБ + """";	
		
	Иначе		
		
		Если ПустаяСтрока(вс.ИмяСервера) Тогда
			ВызватьИсключение "Не указан сервер ИБ";
		КонецЕсли;
		Если ПустаяСтрока(вс.ИмяИБНаСервере) Тогда
			ВызватьИсключение "Не указано имя ИБ на сервере";
		КонецЕсли;
		сп = "Srvr = """ + вс.ИмяСервера + """; Ref = """ + вс.ИмяИБНаСервере + """";		

	КонецЕсли;
	
		
	Если НЕ ПустаяСтрока(вс.Пользователь) Тогда
		сп = сп + ";Usr = """ + вс.Пользователь + """";
	КонецЕсли;
	Если НЕ ПустаяСтрока(вс.Пароль) Тогда
		сп = сп + ";Pwd = """ + вс.Пароль + """";
	КонецЕсли;
		
	
	сп = сп + ";";
	
	//оп = "V" + вс.ВерсияПлатформы + ".COMConnector";
	оп = "V83.COMConnector";
	
	Подключение = Новый COMОбъект(оп);
	Соединение = Подключение.Connect(сп);
	
	Возврат Соединение;
	
КонецФункции

#КонецЕсли