
&Вместо("ИмяФайлаПечатнойФормыОбъекта")
Функция гф_ИмяФайлаПечатнойФормыОбъекта(ОбъектПечати, ИмяФайлаПечатнойФормы, НазваниеПечатнойФормы)
	// ++ Галфинд СадомцевСА 18.04.2024
	// Реализовал добавление печ. формы Счета при отправке по почте печ. формы Спецификации из документа Спецификация покупателя
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eefcd193bae294
	Если ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.гф_СпецификацияПокупателя") Тогда
		Если СтрНайти(НазваниеПечатнойФормы, "Счет на оплату №") > 0 Тогда
			Возврат НазваниеПечатнойФормы;
		КонецЕсли;
	КонецЕсли;
	// -- Галфинд СадомцевСА 18.04.2024
	Результат = ПродолжитьВызов(ОбъектПечати, ИмяФайлаПечатнойФормы, НазваниеПечатнойФормы);
	Возврат Результат;
КонецФункции
