
&Перед("ДобавитьКомандыПечати")
Процедура гф_ДобавитьКомандыПечати(КомандыПечати)
	// ++ Галфинд СадомцевСА 01.02.2024 Добавил печ. форму Счет на оплату с факсимиле (подписи)
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eec03fe158164d
	ЭтоПартнер = ПраваПользователяПовтИсп.ЭтоПартнер();
	Если НЕ ЭтоПартнер
		 И ПолучитьФункциональнуюОпцию("НеВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи") Тогда
		// Счет на оплату
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьСчетовНаОплату";
		КомандаПечати.Идентификатор = "СчетНаОплату";
		КомандаПечати.Представление = НСтр("ru = 'Счет на оплату с факсимиле (подписи)';
											|en = 'Commercial invoice with facsimile'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ОтображатьФаксимиле", Истина);
		
		КомандаПечати.ДополнительныеПараметры.Вставить("ОтображатьПодписи", Истина);
	КонецЕсли;
	// ++ Галфинд СадомцевСА 01.02.2024
КонецПроцедуры
