
&После ("ДобавитьКомандыПечати")
Процедура гф_ДобавитьКомандыПечати(КомандыПечати)
	// ++ Галфинд ЕсиповАВ 30.12.2022
	ЭтоПартнер = ПраваПользователяПовтИсп.ЭтоПартнер();
	
	Если НЕ ЭтоПартнер Тогда
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "гф_СписокКодовМаркировки";
		КомандаПечати.Представление = НСтр("ru = 'Список кодов номенклатуры';
											|en = 'Item code list'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 10;
		//++ Галфинд ЕсиповАВ 30.03.2023
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "гф_РасходнаяНакладнаяКороб";
		КомандаПечати.Представление = НСтр("ru = 'Расходная накладная короб';
											|en = 'Consumable waybill box'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 10;
		//-- Галфинд ЕсиповАВ 30.03.2023
		
	КонецЕсли;
	// -- Галфинд ЕсиповАВ 30.12.2022
КонецПроцедуры

&После ("Печать")
Процедура гф_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// ++ Галфинд ЕсиповАВ 30.12.2022
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гф_СписокКодовМаркировки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"гф_СписокКодовМаркировки",
		НСтр("ru = 'Список кодов номенклатуры';
		|en = 'Item code list'"),
			гф_РасходныйОрдер.СформироватьПечатнуюФормуСписокКМ(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.РеализацияТоваровУслуг.гф_СписокКодовМаркировки");
	КонецЕсли;
	//++ Галфинд ЕсиповАВ 30.03.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "гф_РасходнаяНакладнаяКороб") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"гф_РасходнаяНакладнаяКороб",
		НСтр("ru = 'Расходная накладная короб';
		|en = 'Consumable waybill box'"),
			СформироватьПечатнуюФормуРасходнаяНакладнаяКороб(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.РеализацияТоваровУслуг.гф_РасходнаяНакладнаяКороб");
	КонецЕсли;
	//-- Галфинд ЕсиповАВ 30.03.2023
	// -- Галфинд ЕсиповАВ 30.12.2022
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьКомплектПечатныхФорм")
Функция гф_СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати)

	Перем АдресКомплектаПечатныхФорм;

	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("АдресКомплектаПечатныхФорм", АдресКомплектаПечатныхФорм) Тогда

		КомплектПечатныхФорм = ПолучитьИзВременногоХранилища(АдресКомплектаПечатныхФорм);

	Иначе

		КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
		Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя(),
		МассивОбъектов, Неопределено);

	КонецЕсли;

	Если КомплектПечатныхФорм = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	РеализацияТоваровУслугЛокализация.СформироватьКомплектПечатныхФорм(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	КомплектПечатныхФорм);

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"Накладная");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуНакладная(КомплектПечати.Объекты, ОбъектыПечати, Неопределено));
	КонецЦикла;
	#Вставка
	// ++ Галфинд ЕсиповАВ 30.12.2022
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	гф_РасходныйОрдер);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		гф_РасходныйОрдер.СформироватьПечатнуюФормуСписокКМ(КомплектПечати.Объекты, ОбъектыПечати, Неопределено));
	КонецЦикла;
	// -- Галфинд ЕсиповАВ 30.12.2022
	//++ Галфинд ЕсиповАВ 30.03.2023
	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"РасходнаяНакладнаяКороб");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуРасходнаяНакладнаяКороб(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;
	//-- Галфинд ЕсиповАВ 30.03.2023
	#КонецВставки

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"НакладнаяБезСкидок");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуНакладная(КомплектПечати.Объекты, ОбъектыПечати, Новый Структура("ОтображатьСкидки", Ложь)));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"РасходнаяНакладная");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		СформироватьПечатнуюФормуРасходнаяНакладная(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"Акт");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьАктОбОказанииУслуг.СформироватьПечатнуюФормуАктОбОказанииУслуг(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"АктБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьАктОбОказанииУслуг.СформироватьПечатнуюФормуАктОбОказанииУслуг(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплату");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуСФаксимиле");
	ПараметрыПечати.Удалить("ОтображатьСкидки");
	ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СчетНаОплатуСФаксимилеБезСкидок");
	ПараметрыПечати.Вставить("ОтображатьСкидки", Ложь);
	ПараметрыПечати.Вставить("ОтображатьФаксимиле", Истина);
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"InvoiceInt");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуInvoice(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ProformaInvoice");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуProformaInvoice(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"ЗаданиеНаОтборРазмещениеТовара");

	ПараметрыПечати.Вставить("ТипЗадания", "ЗаданиеНаОтбор");

	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		СтруктураТипов = Новый Соответствие;
		СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", КомплектПечати.Объекты);

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Обработки.ПечатьЗаданияНаОтборРазмещениеТоваров.СформироватьЗаданиеНаОтборРазмещениеТовара(СтруктураТипов,
		ОбъектыПечати,
		ПараметрыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СертификатыНоменклатурыРеестр");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуРеестрСертификатовНоменклатуры(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СертификатыНоменклатурыИзображенияИзДокументов");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуИзображенияСертификатовИзДокументов(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;

	КомплектыПечатиПоОбъектам = РегистрыСведений.НастройкиПечатиОбъектов.КомплектыПечатиПоОбъектам(КоллекцияПечатныхФорм,
	КомплектПечатныхФорм,
	МассивОбъектов,
	"СертификатыНоменклатурыИзображенияИзДокументовБезДублей");
	Для Каждого КомплектПечати Из КомплектыПечатиПоОбъектам Цикл
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		КомплектПечати.Имя,
		КомплектПечати.Представление,
		Справочники.СертификатыНоменклатуры.СформироватьПечатнуюФормуИзображенияСертификатовИзДокументовБезДублей(КомплектПечати.Объекты, ОбъектыПечати));
	КонецЦикла;


	РегистрыСведений.НастройкиПечатиОбъектов.СформироватьКомплектВнешнихПечатныхФорм(
	"Документ.РеализацияТоваровУслуг",
	МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати);

КонецФункции

Функция СформироватьПечатнуюФормуРасходнаяНакладнаяКороб(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	МакетОбработки = Документы.РеализацияТоваровУслуг.ПолучитьМакет("гф_РасходнаяНакладнаяКороб");
	
	ОбластьШапки = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьТЧ = МакетОбработки.ПолучитьОбласть("ТЧ");
	ОбластьИтого = МакетОбработки.ПолучитьОбласть("Итого");
	ОбластьТекст = МакетОбработки.ПолучитьОбласть("Текст");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.ВерсияДанных КАК ВерсияДанных,
	|	РеализацияТоваровУслуг.ПометкаУдаления КАК ПометкаУдаления,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен,
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.Валюта КАК Валюта,
	|	РеализацияТоваровУслуг.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Грузоотправитель КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Грузополучатель КАК Грузополучатель,
	|	РеализацияТоваровУслуг.УдалитьДатаПлатежа КАК УдалитьДатаПлатежа,
	|	РеализацияТоваровУслуг.УдалитьДатаРаспоряжения КАК УдалитьДатаРаспоряжения,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьДата КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо КАК ДоверенностьЛицо,
	|	РеализацияТоваровУслуг.ДоверенностьНомер КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ЗаказКлиента КАК ЗаказКлиента,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Менеджер КАК Менеджер,
	|	РеализацияТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Партнер КАК Партнер,
	|	РеализацияТоваровУслуг.Подразделение КАК Подразделение,
	|	РеализацияТоваровУслуг.Сделка КАК Сделка,
	|	РеализацияТоваровУслуг.СкидкиРассчитаны КАК СкидкиРассчитаны,
	|	РеализацияТоваровУслуг.Склад КАК Склад,
	|	РеализацияТоваровУслуг.Согласован КАК Согласован,
	|	РеализацияТоваровУслуг.Соглашение КАК Соглашение,
	|	РеализацияТоваровУслуг.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	|	РеализацияТоваровУслуг.ФормаОплаты КАК ФормаОплаты,
	|	РеализацияТоваровУслуг.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.Касса КАК Касса,
	|	РеализацияТоваровУслуг.Отпустил КАК Отпустил,
	|	РеализацияТоваровУслуг.ОтпустилДолжность КАК ОтпустилДолжность,
	|	РеализацияТоваровУслуг.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
	|	РеализацияТоваровУслуг.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	РеализацияТоваровУслуг.КартаЛояльности КАК КартаЛояльности,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.Основание КАК Основание,
	|	РеализацияТоваровУслуг.Статус КАК Статус,
	|	РеализацияТоваровУслуг.Автор КАК Автор,
	|	РеализацияТоваровУслуг.УдалитьСуммаПредоплаты КАК УдалитьСуммаПредоплаты,
	|	РеализацияТоваровУслуг.УдалитьСуммаПредоплатыЗаТару КАК УдалитьСуммаПредоплатыЗаТару,
	|	РеализацияТоваровУслуг.СпособДоставки КАК СпособДоставки,
	|	РеализацияТоваровУслуг.ЗонаДоставки КАК ЗонаДоставки,
	|	РеализацияТоваровУслуг.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
	|	РеализацияТоваровУслуг.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	РеализацияТоваровУслуг.ВремяДоставкиС КАК ВремяДоставкиС,
	|	РеализацияТоваровУслуг.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчика КАК АдресДоставкиПеревозчика,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначенияПолей КАК АдресДоставкиПеревозчикаЗначенияПолей,
	|	РеализацияТоваровУслуг.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформацияПоДоставке,
	|	РеализацияТоваровУслуг.КонтактноеЛицо КАК КонтактноеЛицо,
	|	РеализацияТоваровУслуг.Руководитель КАК Руководитель,
	|	РеализацияТоваровУслуг.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.ПорядокРасчетов КАК ПорядокРасчетов,
	|	РеализацияТоваровУслуг.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
	|	РеализацияТоваровУслуг.ДатаВозвратаМногооборотнойТары КАК ДатаВозвратаМногооборотнойТары,
	|	РеализацияТоваровУслуг.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
	|	РеализацияТоваровУслуг.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
	|	РеализацияТоваровУслуг.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата,
	|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
	|	РеализацияТоваровУслуг.ДопоставкаПоРеализации КАК ДопоставкаПоРеализации,
	|	РеализацияТоваровУслуг.ДатаПереходаПраваСобственности КАК ДатаПереходаПраваСобственности,
	|	РеализацияТоваровУслуг.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
	|	РеализацияТоваровУслуг.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание,
	|	РеализацияТоваровУслуг.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РеализацияТоваровУслуг.КурсЧислитель КАК КурсЧислитель,
	|	РеализацияТоваровУслуг.КурсЗнаменатель КАК КурсЗнаменатель,
	|	РеализацияТоваровУслуг.УдалитьПорядокОплаты КАК УдалитьПорядокОплаты,
	|	РеализацияТоваровУслуг.ЕстьМаркируемаяПродукцияГИСМ КАК ЕстьМаркируемаяПродукцияГИСМ,
	|	РеализацияТоваровУслуг.УдалитьЕстьАлкогольнаяПродукцияДляРеализацииРозницаЕГАИС КАК УдалитьЕстьАлкогольнаяПродукцияДляРеализацииРозницаЕГАИС,
	|	РеализацияТоваровУслуг.СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
	|	РеализацияТоваровУслуг.ОплатаВВалюте КАК ОплатаВВалюте,
	|	РеализацияТоваровУслуг.Курьер КАК Курьер,
	|	РеализацияТоваровУслуг.Сборщик КАК Сборщик,
	|	РеализацияТоваровУслуг.АдресДоставкиЗначение КАК АдресДоставкиЗначение,
	|	РеализацияТоваровУслуг.АдресДоставкиПеревозчикаЗначение КАК АдресДоставкиПеревозчикаЗначение,
	|	РеализацияТоваровУслуг.ВариантВыбытияМаркируемойПродукции КАК ВариантВыбытияМаркируемойПродукции,
	|	РеализацияТоваровУслуг.КлиентКонтрагент КАК КлиентКонтрагент,
	|	РеализацияТоваровУслуг.КлиентПартнер КАК КлиентПартнер,
	|	РеализацияТоваровУслуг.КлиентДоговор КАК КлиентДоговор,
	|	РеализацияТоваровУслуг.гф_РасходныйОрдер КАК гф_РасходныйОрдер,
	|	РеализацияТоваровУслуг.ЭтапГосконтрактаЕИС КАК ЭтапГосконтрактаЕИС,
	|	РеализацияТоваровУслуг.гф_АдресДоставки КАК гф_АдресДоставки,
	|	РеализацияТоваровУслуг.гф_ПочтовоеОтправление КАК гф_ПочтовоеОтправление,
	|	РеализацияТоваровУслуг.гф_Дополнение КАК гф_Дополнение,
	|	РеализацияТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Назначение КАК Назначение,
	|		Упаковка КАК Упаковка,
	|		КоличествоУпаковок КАК КоличествоУпаковок,
	|		Количество КАК Количество,
	|		ВидЦены КАК ВидЦены,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		УдалитьСтавкаНДС КАК УдалитьСтавкаНДС,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		СуммаСНДС КАК СуммаСНДС,
	|		КодСтроки КАК КодСтроки,
	|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
	|		ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|		КлючСвязи КАК КлючСвязи,
	|		Склад КАК Склад,
	|		СтатусУказанияСерий КАК СтатусУказанияСерий,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ЗаказКлиента КАК ЗаказКлиента,
	|		СрокПоставки КАК СрокПоставки,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		Серия КАК Серия,
	|		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		НоменклатураНабора КАК НоменклатураНабора,
	|		ХарактеристикаНабора КАК ХарактеристикаНабора,
	|		АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|		КодТНВЭД КАК КодТНВЭД,
	|		ОбъектРасчетов КАК ОбъектРасчетов,
	|		Подразделение КАК Подразделение,
	|		НоменклатураПартнера КАК НоменклатураПартнера,
	|		СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБалловКСписанию,
	|		СуммаБонусныхБалловКСписаниюВВалюте КАК СуммаБонусныхБалловКСписаниюВВалюте,
	|		СуммаНачисленныхБонусныхБалловВВалюте КАК СуммаНачисленныхБонусныхБалловВВалюте
	|	) КАК Товары,
	|	РеализацияТоваровУслуг.СкидкиНаценки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КлючСвязи КАК КлючСвязи,
	|		СкидкаНаценка КАК СкидкаНаценка,
	|		Сумма КАК Сумма,
	|		НапомнитьПозже КАК НапомнитьПозже
	|	) КАК СкидкиНаценки,
	|	РеализацияТоваровУслуг.ВидыЗапасов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ВидЗапасов КАК ВидЗапасов,
	|		НомерГТД КАК НомерГТД,
	|		Упаковка КАК Упаковка,
	|		КоличествоУпаковок КАК КоличествоУпаковок,
	|		Количество КАК Количество,
	|		КоличествоПоРНПТ КАК КоличествоПоРНПТ,
	|		УдалитьСтавкаНДС КАК УдалитьСтавкаНДС,
	|		СуммаСНДС КАК СуммаСНДС,
	|		СтавкаНДС КАК СтавкаНДС,
	|		СуммаНДС КАК СуммаНДС,
	|		ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ЗаказКлиента КАК ЗаказКлиента,
	|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|		АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|		Цена КАК Цена,
	|		ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
	|		ОбъектРасчетов КАК ОбъектРасчетов,
	|		КодТНВЭД КАК КодТНВЭД
	|	) КАК ВидыЗапасов,
	|	РеализацияТоваровУслуг.ДополнительныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Свойство КАК Свойство,
	|		Значение КАК Значение,
	|		ТекстоваяСтрока КАК ТекстоваяСтрока
	|	) КАК ДополнительныеРеквизиты,
	|	РеализацияТоваровУслуг.РасшифровкаПлатежа.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		УдалитьЗаказ КАК УдалитьЗаказ,
	|		Сумма КАК Сумма,
	|		ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ОбъектРасчетов КАК ОбъектРасчетов
	|	) КАК РасшифровкаПлатежа,
	|	РеализацияТоваровУслуг.Серии.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Серия КАК Серия,
	|		Количество КАК Количество,
	|		Номенклатура КАК Номенклатура,
	|		Характеристика КАК Характеристика,
	|		Назначение КАК Назначение,
	|		Склад КАК Склад
	|	) КАК Серии,
	|	РеализацияТоваровУслуг.ЭтапыГрафикаОплаты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Заказ КАК Заказ,
	|		СверхЗаказа КАК СверхЗаказа,
	|		ВариантОплаты КАК ВариантОплаты,
	|		ДатаПлатежа КАК ДатаПлатежа,
	|		Сдвиг КАК Сдвиг,
	|		СуммаПлатежа КАК СуммаПлатежа,
	|		ПроцентПлатежа КАК ПроцентПлатежа,
	|		СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
	|		ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
	|		СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		СуммаВзаиморасчетовПоТаре КАК СуммаВзаиморасчетовПоТаре,
	|		ОбъектРасчетов КАК ОбъектРасчетов,
	|		ВариантОтсчета КАК ВариантОтсчета
	|	) КАК ЭтапыГрафикаОплаты,
	|	РеализацияТоваровУслуг.ШтрихкодыУпаковок.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|		ЧастичноеВыбытиеКоличество КАК ЧастичноеВыбытиеКоличество,
	|		ЧастичноеВыбытиеВариантУчета КАК ЧастичноеВыбытиеВариантУчета,
	|		ЧастичноеВыбытиеНоменклатура КАК ЧастичноеВыбытиеНоменклатура,
	|		ЧастичноеВыбытиеХарактеристика КАК ЧастичноеВыбытиеХарактеристика
	|	) КАК ШтрихкодыУпаковок,
	|	РеализацияТоваровУслуг.гф_ТоварыВКоробах.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		УпаковочныйЛист КАК УпаковочныйЛист,
	|		Артикул КАК Артикул,
	|		КоличествоПар КАК КоличествоПар,
	|		Коэффициент КАК Коэффициент,
	|		ЦенаКороба КАК ЦенаКороба,
	|		НДС КАК НДС
	|	) КАК гф_ТоварыВКоробах,
	|	РеализацияТоваровУслуг.НачислениеБонусныхБаллов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КлючСвязи КАК КлючСвязи,
	|		БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
	|		ДатаНачисления КАК ДатаНачисления,
	|		ДатаСписания КАК ДатаСписания,
	|		СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
	|	) КАК НачислениеБонусныхБаллов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	//Таб[0].Номер
	НомерБезПрефикса = Прав(Таб[0].Номер,6);
	НомерБезНулей = НомерБезПрефикса;
	Пока Найти(НомерБезНулей,"0") = 1 Цикл
		//НомерБезНулей = Прав(НомерБезНулей, СтрДлина(НомерБезНулей)-1); //удаляет лидирующие нули
		НомерБезНулей = Сред(НомерБезНулей,2);
	КонецЦикла;
	
	ДатаЗаголовка = Формат(Таб[0].Дата, "ДЛФ=DD");
	ОбластьШапки.Параметры.Заголовок  = "Расходная накладная " + НомерБезНулей + " от " + ДатаЗаголовка;
	ОбластьШапки.Параметры.Поставщик  = Таб[0].Организация.НаименованиеПолное;
	ОбластьШапки.Параметры.Покупатель = Таб[0].Контрагент.НаименованиеПолное;
	ТабДок.Вывести(ОбластьШапки);
	
	Сч = 0;
	ИтогоСум = 0;
	СуммаНДССум = 0;
	ИтогоТекст = 0;
	
	Для Каждого Стр Из Таб Цикл
		
		Для Каждого СтрокаТовараВКоробах Из Стр.гф_ТоварыВКоробах Цикл
		
		Сч = Сч + 1;
		ОбластьТЧ.Параметры.Номер      = Сч;
		ОбластьТЧ.Параметры.Артикул    = СтрокаТовараВКоробах.Артикул;
		ОбластьТЧ.Параметры.Ростовка   = СтрокаТовараВКоробах.УпаковочныйЛист.гф_Комплектация.Характеристика;
		
		СтрокаСоСкобками = СтрокаТовараВКоробах.УпаковочныйЛист.Код;
		СтрокаБезЛевойСкобоки = СтрЗаменить(СтрокаСоСкобками,"(","");
		СтрокаБезПравойкобоки = СтрЗаменить(СтрокаСоСкобками,")","");
		
		НаименованиеПолноеКолиечство = СтрДлина(СтрокаТовараВКоробах.УпаковочныйЛист.гф_Комплектация.Владелец.НаименованиеПолное);
		НаименованиеКодаКоличество = СтрДлина(СтрокаТовараВКоробах.УпаковочныйЛист.гф_Комплектация.Владелец.КоллекцияНоменклатуры.Код);
		НаименованиеТовараКоличество = Лев(СтрокаТовараВКоробах.УпаковочныйЛист.гф_Комплектация.Владелец.НаименованиеПолное,НаименованиеПолноеКолиечство - НаименованиеКодаКоличество);
		
		ОбластьТЧ.Параметры.Товар      = НаименованиеТовараКоличество + "
		|" + "(" + СтрокаБезПравойкобоки + "," + "
		|" + СтрокаТовараВКоробах.УпаковочныйЛист.гф_Агрегация.гф_НомерГТД + "," + "
		|" + СтрокаТовараВКоробах.УпаковочныйЛист.гф_Агрегация.гф_НомерГТД.СтранаПроисхождения + "," + "
		|" + СтрокаБезПравойкобоки + ")";
		ОбластьТЧ.Параметры.Мест       = СтрокаТовараВКоробах.Коэффициент;
		ОбластьТЧ.Параметры.Количество = 1;
		ОбластьТЧ.Параметры.Пар        = СтрокаТовараВКоробах.КоличествоПар;
		ОбластьТЧ.Параметры.Цена       = СтрокаТовараВКоробах.ЦенаКороба + СтрокаТовараВКоробах.НДС;
		ОбластьТЧ.Параметры.Сумма      = (СтрокаТовараВКоробах.ЦенаКороба + СтрокаТовараВКоробах.НДС); 
		ОбластьТЧ.Параметры.ГДТ        = СтрокаТовараВКоробах.УпаковочныйЛист.гф_Агрегация.гф_НомерГТД.Код + "," + "
		|" + СтрокаТовараВКоробах.УпаковочныйЛист.гф_Агрегация.гф_НомерГТД.СтранаПроисхождения;
		
		ИтогоТекст = ИтогоТекст + (СтрокаТовараВКоробах.ЦенаКороба + СтрокаТовараВКоробах.НДС);
		ИтогоСум = ИтогоСум + СтрокаТовараВКоробах.ЦенаКороба;
		СуммаНДССум = СуммаНДССум + СтрокаТовараВКоробах.НДС;
		
		ТабДок.Вывести(ОбластьТЧ);
		
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьИтого.Параметры.Итого = ИтогоСум;
	ОбластьИтого.Параметры.СуммаНДС = СуммаНДССум;
	ТабДок.Вывести(ОбластьИтого);
	
	ОбластьТекст.Параметры.Всего = "Всего наименований " + Сч + ", на сумму " + ИтогоТекст + " руб.";
	ОбластьТекст.Параметры.ВсегоТекст = ЧислоПрописью(ИтогоТекст);
	ТабДок.Вывести(ОбластьТекст);
	
	Возврат ТабДок;
КонецФункции	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

#КонецОбласти

#КонецЕсли