
//(н)Галфинд/Сефербеков 12.04.2024 ( 
&НаКлиенте
&После("ОбработатьИзменениеНоменклатуры")
Процедура гф_ОбработатьИзменениеНоменклатуры(ЭтоНовыйКод, Знач ФлагИзмененияНоменклатуры, ПроверитьКод)
	
	Если (ФлагИзмененияНоменклатуры = 1 И ЗначениеЗаполнено(Объект.НоваяНоменклатура)) ИЛИ ЗначениеЗаполнено(Объект.Номенклатура) И НЕ (ЗначениеЗаполнено(Объект.СтранаПроизводства) И ЗначениеЗаполнено(Объект.Цвет) ) Тогда
		
		СтруктураЗначений = ПолучитьЗначенияДанных(Объект.НоваяНоменклатура) ;
		 
		Если ЗначениеЗаполнено(СтруктураЗначений.СтранаПроизводства) Тогда
			Объект.СтранаПроизводства = СтруктураЗначений.СтранаПроизводства;
		КонецЕсли;
				
		Если ЗначениеЗаполнено(СтруктураЗначений.Цвет) Тогда
			Объект.Цвет = СтруктураЗначений.Цвет; 						
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Характеристика) И (ФлагИзмененияНоменклатуры = 2 ИЛИ НЕ ЗначениеЗаполнено(Объект.Размер)) Тогда
		
		СтруктураЗначений = _омОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Характеристика, "Справочник.ХарактеристикиНоменклатуры", "Наименование");
		ЗначениеНаименование = Неопределено ;
		СтруктураЗначений.Свойство("Наименование", ЗначениеНаименование);
		Если ЗначениеЗаполнено(ЗначениеНаименование) Тогда
			Объект.Размер = СокрЛП(ЗначениеНаименование);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначенияДанных(Номенклатура)	
	
	Результат = Новый Структура("СтранаПроизводства, Цвет");
	
	Результат.СтранаПроизводства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "СтранаПроисхождения");

	СвойствоЦвет =  НайтиДополнительныйРеквизитПоИдентификатору("гф_НоменклатураColour_Name_Supplier");
	ЗначениеСвойства = B2B_ОбщиеПроцедурыИФункции.ПолучитьЗначениеСвойства(Номенклатура, СвойствоЦвет);
	Результат.Цвет = гф_МодульИнтеграцияСВнешнимиСистемами.ПолучитьПереводЗначения(ЗначениеСвойства, Справочники.гф_ВидыЯзыков.Russian) ; 
	
	Возврат Результат ;

КонецФункции

&НаСервере
Функция НайтиДополнительныйРеквизитПоИдентификатору(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = &ИдентификаторДляФормул";
	
	Запрос.УстановитьПараметр("ИдентификаторДляФормул", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции //(к)Галфинд/Сефербеков 12.04.2024 )