
// Галфинд СадомцевСА 27.06.2023 Отменил доработки от 27.04.2023
//e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee118b22fc44ea
//&Вместо("НастройкиПочтовыхСерверов")
//Функция гф_НастройкиПочтовыхСерверов()
//	Результат = ПродолжитьВызов();
//	// Галфинд СадомцевСА 27.04.2023 Добавил настройку почты для домена "wortmann-wostok.ru"
//	//e1cib/data/Задача.ЗадачаИсполнителя?ref=8132bcee7bda45d711eddd39a386dd01
//	Результат.Вставить("wortmann-wostok.ru", "office365.com");
//	Возврат Результат;
//КонецФункции
