
// #wortmann {
// #3.2.01 Адреса доставки
// Галфинд Журавлев 2022/07/08
&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("Справочник.гф_АдресаДоставки.ФормаВыбора", , ЭтотОбъект);
КонецПроцедуры // } #wortmann

// #wortmann {
// #3.2.01 Адреса доставки
// Галфинд Журавлев 2022/07/08
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.гф_АдресаДоставки") И ЗначениеЗаполнено(Контрагент) Тогда 
		ОбновитьВладельцаДляАдреса(ВыбранноеЗначение);
		Элементы.АдресаДоставки.Обновить();
	КонецЕсли;
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #3.2.01 Адреса доставки
// Галфинд Журавлев 2022/07/08
&НаСервере
Процедура ОбновитьВладельцаДляАдреса(ТекАдрес)
	
	Если ТекАдрес.Владелец = Контрагент Тогда
		Возврат;
	КонецЕсли;
	
	АдресОбъект = ТекАдрес.ПолучитьОбъект();
	АдресОбъект.Владелец = Контрагент;
	
	Попытка
		АдресОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #3.2.01 Адреса доставки
// Галфинд Журавлев 2022/07/08
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		Контрагент = Параметры.Контрагент;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АдресаДоставки, "Контрагент", Параметры.Контрагент);
	КонецЕсли;
	
КонецПроцедуры // } #wortmann
