 
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	НовоеЗначение = ВыбранныеЗначения.Добавить();
	НовоеЗначение.ВариантКомплектации = ВыбраннаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	МассивЗначений = Новый Массив;
	Форма = ЭтотОбъект;
	Для каждого Строка Из  ВыбранныеЗначения Цикл
		
		МассивЗначений.Добавить(Строка.ВариантКомплектации);
		
	КонецЦикла;	
	
	Форма.Закрыть(МассивЗначений); 
	
КонецПроцедуры

#КонецОбласти