
&После("ПриЗаполненииСписковСОграничениемДоступа")
Процедура гф_ПриЗаполненииСписковСОграничениемДоступа(Списки)
	
	Списки.Вставить(Метаданные.Справочники.гф_АдресаДоставки, Истина);
	Списки.Вставить(Метаданные.Документы.гф_АгрегацияКМ, Истина);
КонецПроцедуры

&После("ПриЗаполненииВидовОграниченийПравОбъектовМетаданных")
Процедура гф_ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание)

	Описание = Описание + "
		|Документ.гф_АгрегацияКМ.Чтение.Организации
		|Документ.гф_АгрегацияКМ.Изменение.Организации
		// #wortmann { 
		// Внесение изменений для ограничения чтения
		// Галфинд_Домнышева 2022/11/16 
		|Справочник.Номенклатура.Чтение.ГруппыНоменклатуры";
		// } #wortmann
	
КонецПроцедуры
