
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипЦеныЗакупочная = ПланыВидовХарактеристик.гф_ГлобальныеЗначения.НайтиПоРеквизиту(
								"Ключ", "гф_ГлобальныеЗначенияОптоваяЗакупочнаяЦена").Значение;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл загрузки";
	Диалог.ПолноеИмяФайла = ""; 	 
    Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьЗаказКлиента(Команда)
	
	ВладелецФормы.Объект.гф_ТоварыВКоробах.Очистить();
	
	Для каждого Строка Из ДанныеФайла Цикл
		
		НоваяСтрока = ВладелецФормы.Объект.гф_ТоварыВКоробах.Добавить();
		НоваяСтрока.ВариантКомплектации = Строка.ВариантКомплектации;
		НоваяСтрока.Количество = Строка.Количество;  
		НоваяСтрока.ЦенаКороба = Строка.Цена;
		НоваяСтрока.Сумма = Строка.Сумма; 
		
	КонецЦикла;
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, Характеристика)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);	
	Отбор.Вставить("ВидЦены", ТипЦеныЗакупочная);
	
	Возврат РегистрыСведений.ЦеныНоменклатуры25.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор).Цена;
	
КонецФункции

&НаСервере
Функция НайтиХарактеристикуНоменклатуры(Номенклатура, НаименованиеХарактеристики)
	
	Возврат Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(НаименованиеХарактеристики, Истина, ,
																							Номенклатура);
	
КонецФункции	

&НаСервере
Функция ПолучитьОсновнойВариантКомплектации(Номенклатура, Характеристика)
			
	Возврат Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(Номенклатура, Характеристика);
	
КонецФункции

&НаСервере
Функция НоменклатураПоАртикулу(Артикул)
	
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
	
КонецФункции	

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	ДанныеФайла.Очистить();
	
	Попытка 
		ex = ПолучитьCOMобъект("", "Excel.Application");
	Исключение
		СообщитьПользователю("Excel Application не создан!!");
		Возврат;
	КонецПопытки;
	
	Попытка
		ex.workbooks.open(ПутьКФайлу, 1);
	Исключение
		СообщитьПользователю("Файл перемещен или удален!");
		Возврат;
	КонецПопытки; 
	
	RCount = ex.ActiveSheet.UsedRange.Rows.Count();
	
	СоответствиеКолонок = Новый Соответствие;
	
	Для Колонка = ЗагружатьС По ЗагружатьПо Цикл
		
		_ИмяКолонки = ex.ActiveSheet.Cells(СтрокаНаименованияРостовки, Колонка).Value;
		Размер = Лев(СокрЛП(_ИмяКолонки), 3);
		
		Попытка
			РазмерЧислом = Число(Размер); 
		Исключение
			СообщитьПользователю("Наименование колонки " + Размер + 
						" с ростовкой не соответствует формату. Номер колонки XSL " + Колонка);
			Возврат;
		КонецПопытки;	
		
		СоответствиеКолонок.Вставить(Колонка, Размер);
		
	КонецЦикла;	
		
	Для j = СтрокаЗагрузки По RCount Цикл
			
		Артикул = ex.ActiveSheet.Cells(j, КолонкаАртикул).Value;
		
		Номенклатура = НоменклатураПоАртикулу(Артикул);
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			СообщитьПользователю("Не найдена номенклатура с артикулом " + Артикул + " в строке "+ Строка(j));
			Продолжить;
		КонецЕсли;	
		
		Для Колонка = ЗагружатьС По ЗагружатьПо Цикл 
			
			_Количество = ex.ActiveSheet.Cells(j, Колонка).Value;
						
			Если ЗначениеЗаполнено(_Количество) Тогда
				
				Попытка
					Количество = Число(СокрЛП(_Количество));
				Исключение
					СообщитьПользователю("Ошибка преобразования в число. Данные по строке XSL " + Строка(j) +
																		"файла XSL не загружены.");
					Продолжить;
				КонецПопытки;
				
				Размер = СоответствиеКолонок.Получить(Колонка);
				
				Характеристика = НайтиХарактеристикуНоменклатуры(Номенклатура, Размер);
				
				ВариантКомплектации = ПолучитьОсновнойВариантКомплектации(Номенклатура, Характеристика);
				
				НоваяСтрока = ДанныеФайла.Добавить();
								
				НоваяСтрока.ВариантКомплектации = ВариантКомплектации;
				НоваяСтрока.Количество = Число(Количество);
				НоваяСтрока.Цена = ПолучитьЦенуНоменклатуры(Номенклатура, Характеристика);  
				НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	ex.workbooks.Close();
	ex.quit();

КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю(Текст)
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	
КонецПроцедуры	
#КонецОбласти
