
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстСообщения = "";
	
	Объект.мсАдресЭлектроннойПочты = Параметры.мсАдресЭлектроннойПочты;
	Объект.мсНомерЗаказа           = Параметры.мсНомерЗаказа;
	Объект.РежимОбмена             = Параметры.РежимОбмена;
	
	Если Параметры.Свойство("ТемаОбращения") И ЗначениеЗаполнено(Параметры.ТемаОбращения) Тогда
		ТекстСообщения = ТекстСообщения + Параметры.ТемаОбращения + Символы.ПС + Символы.ПС;
	КонецЕсли;
	
	Если Параметры.Свойство("ТемаОбращения") И СтрНайти(Параметры.ТемаОбращения, "Обращение в техподдержку") > 0 Тогда
		ТекстСообщения = ТекстСообщения + "Описание ошибки переноса данных: " + Метаданные.Имя
					+ Символы.ПС + Символы.ПС
					+ "Текст ошибки: " + Метаданные.Имя
					+ Символы.ПС + Символы.ПС
					+ "Наименование текущей конфигурации: " + Метаданные.Имя
					+ Символы.ПС + Символы.ПС
					+ "Релиз: " + Метаданные.Версия
					+ Символы.ПС + Символы.ПС 
					+ "Имя файла правил: " + Объект.ИмяФайлаПравилОбмена
					+ Символы.ПС + Символы.ПС
					+ "Номер договора / заказа на Инфостарте: " + Объект.мсНомерЗаказа
					+ Символы.ПС + Символы.ПС
					+ "Адрес электронной почты: " + Объект.мсАдресЭлектроннойПочты
					+ Символы.ПС + Символы.ПС
					+ "Выполняется выгрузка или загрузка данных: " + Объект.РежимОбмена;
					
		Если Объект.РежимОбмена = "Выгрузка" Тогда
			ТекстСообщения = ТекстСообщения +
							Символы.ПС + Символы.ПС
							+ "Наименование конфигурации-приемника (заполните самостоятельно):"
							+ Символы.ПС + Символы.ПС
							+ "Релиз конфигурации-приемника (заполните самостоятельно):";
		Иначе
			ТекстСообщения = ТекстСообщения +
							Символы.ПС + Символы.ПС
							+ "Наименование конфигурации-источника (заполните самостоятельно):"
							+ Символы.ПС + Символы.ПС
							+ "Релиз конфигурации-источника (заполните самостоятельно):"
							;				
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения +
							+ Символы.ПС + Символы.ПС
							+ "Файл протокола выгрузки данных (протокол должен быть с включенными информационными сообщениями. Выложите на любой файлообменник, например, Яндекс.Диск и укажите тут ссылку):"
							+ Символы.ПС + Символы.ПС
							+ "Файл правил конвертации данных (выложите на любой файлообменник, например, Яндекс.Диск и укажите тут ссылку):"
							+ Символы.ПС + Символы.ПС;
	КонецЕсли; 
	
	Если Параметры.Свойство("ТемаОбращения") И СтрНайти(Параметры.ТемаОбращения, "продление подписки") > 0
		И Параметры.Свойство("мсНомерЗаказа") Тогда
		
		ТекстСообщения = ТекстСообщения + "Номер основного заказа (или номер договора): " + Параметры.мсНомерЗаказа + Символы.ПС + Символы.ПС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	ИмяСервера = Об.ПутьВебСервиса();
	ИмяПользователя = "Вебсервис"; 
	Пароль = Неопределено;
	
	Попытка
		Определения = Новый WSОпределения("http://" + ИмяСервера + "/moscowsoft/ws/msConvertationWork.1cws?wsdl", ИмяПользователя, Пароль);
		Прокси = Новый WSПрокси(Определения, "http://moscowsoft.com/", "msConvertationWork", "msConvertationWorkSoap");
		Прокси.Пользователь = ИмяПользователя;
		Прокси.Пароль = Пароль;
		
		РезультатОтправки = Прокси.createHelpdeskTicket(Объект.мсАдресЭлектроннойПочты, ТекстСообщения);
	Исключение
		РезультатОтправки = Ложь;
	КонецПопытки;
	
	Если Не РезультатОтправки Тогда
		Определения = Новый WSОпределения("http://192.168.88.248/moscowsoft/ws/msConvertationWork.1cws?wsdl", ИмяПользователя, Пароль);
		Прокси = Новый WSПрокси(Определения, "http://moscowsoft.com/", "msConvertationWork", "msConvertationWorkSoap");
		Прокси.Пользователь = ИмяПользователя;
		Прокси.Пароль = Пароль;
		
		РезультатОтправки = Прокси.createHelpdeskTicket(Объект.мсАдресЭлектроннойПочты, ТекстСообщения);
	
	КонецЕсли;
	
	Если РезультатОтправки Тогда
		Элементы.УспешноОтправлено.Видимость = Истина;
	КонецЕсли;
	
	//Адрес = ПоместитьВоВременноеХранилище(ФайлПравил.binaryData, УникальныйИдентификатор);
	//Возврат Адрес;

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Элементы.ПредупреждениеОтправки.Видимость = Ложь;
	Если Не ЗначениеЗаполнено(Объект.мсАдресЭлектроннойПочты) Тогда
		Элементы.ПредупреждениеОтправки.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура мсАдресЭлектроннойПочтыПриИзменении(Элемент)
	
	Элементы.ПредупреждениеОтправки.Видимость = Ложь;
	Если Не ЗначениеЗаполнено(Объект.мсАдресЭлектроннойПочты) Тогда
		Элементы.ПредупреждениеОтправки.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.УспешноОтправлено.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияПриИзменении(Элемент)
	Элементы.УспешноОтправлено.Видимость = ЛОжь;
КонецПроцедуры

&НаКлиенте
Процедура мсНомерЗаказаПриИзменении(Элемент)
	Элементы.УспешноОтправлено.Видимость = Ложь;
КонецПроцедуры
