
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// vvv Галфинд \ Sakovich 17.08.2023
	гф_ДобавитьЭлементы();
	// ^^^ Галфинд \ Sakovich 17.08.2023
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура гф_ДобавитьЭлементы()

	НовыйЭлемент = ЭтотОбъект.Элементы.Добавить("гф_РостовкаКороба", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.Заголовок = "Ростовка короба";
	НовыйЭлемент.ПутьКДанным = "Объект.гф_РостовкаКороба";

КонецПроцедуры


#КонецОбласти