 
#Область ОбработчикиСобытий

&После("ОбработкаПроведения")
Процедура гф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не Отказ И ЗначениеЗаполнено(Ссылка.гф_Заказ) Тогда
		гф_ДобавитьУпаковочныйЛистВЗаказКлиента();
	КонецЕсли;	
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Отказ И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
		  И ЗначениеЗаполнено(Ссылка.гф_Заказ) Тогда
		 гф_УдалитьУпаковочныйЛистИзЗаказаКлиента();
	КонецЕсли;	
	
КонецПроцедуры 

// #wortmann {
// Галфинд Sakovich 2022/09/09
&Перед("ОбработкаПроверкиЗаполнения")
Процедура гф_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(гф_Поставка) Тогда
		Текст = "Не заполнено поле ""Поставка""";
		ОбщегоНазначения.СообщитьПользователю(Текст, Ссылка, , "Объект.гф_Поставка", Отказ);
	КонецЕсли;
КонецПроцедуры // } #wortmann

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура гф_ДобавитьУпаковочныйЛистВЗаказКлиента()
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации КАК ВариантКомплектации,
	|	ЗаказКлиентагф_ТоварыВКоробах.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента.гф_ТоварыВКоробах КАК ЗаказКлиентагф_ТоварыВКоробах
	|ГДЕ
	|	ЗаказКлиентагф_ТоварыВКоробах.Ссылка = &ЗаказКлиента
	|	И ЗаказКлиентагф_ТоварыВКоробах.ВариантКомплектации = &ВариантКомплектации";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка.гф_Заказ);
	Запрос.УстановитьПараметр("ВариантКомплектации", Ссылка.гф_Комплектация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из Результат Цикл
		
		ЗаказКлиентаОбъект = Строка.ЗаказКлиента.ПолучитьОбъект();
		
		НоваяСтрока = ЗаказКлиентаОбъект.гф_УпаковочныеЛисты.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка.ИдентификаторСтроки;
		НоваяСтрока.УпаковочныйЛист = Ссылка;
				
		ЗаказКлиентаОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказКлиентаОбъект.Записать();
	КонецЦикла;

КонецПроцедуры	

Процедура гф_УдалитьУпаковочныйЛистИзЗаказаКлиента()
	
	ЗаказКлиентаОбъект = Ссылка.гф_Заказ.ПолучитьОбъект();
	
	Отбор = Новый Структура;
	Отбор.Вставить("УпаковочныйЛист", Ссылка);
	
	НайденныеСтроки = ЗаказКлиентаОбъект.гф_УпаковочныеЛисты.НайтиСтроки(Отбор);
    
	Для каждого Строка из НайденныеСтроки Цикл
		ЗаказКлиентаОбъект.гф_УпаковочныеЛисты.Удалить(Строка);
	КонецЦикла;
	
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ЗаказКлиентаОбъект.ОбменДанными.Загрузка = Истина;
		ЗаказКлиентаОбъект.Записать();              
	КонецЕсли;
	
КонецПроцедуры;

#КонецОбласти
