
// #wortmann {
// #4.2.03
// Расширение обработки заполнения контактных лиц
// Журавлев Чугуев 2022/07/12
&После("ОбработкаЗаполнения")
Процедура гф_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнить ТЧ группы доступа по партнеру
	ГруппаДоступаПартнера = Владелец.ГруппаДоступа;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаГруппыДоступа();
	Запрос.УстановитьПараметр("ГруппаДоступаПартнера", ГруппаДоступаПартнера);
	
	ГруппыДоступа = Запрос.Выполнить().Выгрузить();
	
	гф_ГруппыДоступа.Загрузить(ГруппыДоступа);
	
КонецПроцедуры // } #wortmann

// #wortmann {
// #4.2.03
// Текст запроса, возвращающий список групп доступа, которые содержат группы доступа партнера
// Журавлев Чугуев 2022/07/12
Функция ТекстЗапросаГруппыДоступа()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗначенияДоступа.Ссылка КАК ГруппаДоступа
	|ИЗ
	|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ЗначенияДоступа
	|ГДЕ ЗначенияДоступа.ЗначениеДоступа = &ГруппаДоступаПартнера";
	
	Возврат ТекстЗапроса;
	
КонецФункции // } #wortmann
