
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	гф_СоздатьНовыеРеквизиты();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_СоздатьНовыеРеквизиты()
	
	КвалификаторыСтроки	= Новый КвалификаторыСтроки(13);
		
	ОписаниеТиповСтрока 			= Новый ОписаниеТипов("Строка", , КвалификаторыСтроки);

	ДобавляемыеРеквизиты = Новый Массив;
											
	РеквизитФормы_гф_ГЛН_номер		= Новый РеквизитФормы("гф_RC_GLN_номер",
										ОписаниеТиповСтрока, , "GLN_номер", Истина);
		
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы_гф_ГЛН_номер);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ТипПолеФормы = Тип("ПолеФормы");
		
	НовоеПоле = Элементы.Добавить("гф_RC_GLN_номер", ТипПолеФормы, Элементы.ГруппаОбщаяИнформация);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_RC_GLN_номер";
	
// #wortmann {
// #Заявки на доставку
// Галфинд Окунев 2022/07/20
//
	НовоеПоле = Элементы.Добавить("гф_УчетнаяЗаписьПочтыРоссии", ТипПолеФормы, Элементы.ГруппаОбщаяИнформация);
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_УчетнаяЗаписьПочтыРоссии";
	НовоеПоле.Заголовок		= "Учетная запись Почты России";
	
	
	// ++ Галфинд ЕсиповАВ 28.02.24
	НовоеПоле = Элементы.Добавить("гф_ПеревозчикСМР", ТипПолеФормы, Элементы.ГруппаДополнительныеРеквизиты); 
	
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.гф_СМРПеревозчик";
	НовоеПоле.Заголовок		= "Перевозчик CMR";
	// -- Галфинд ЕсиповАВ 28.02.24
	
// } #wortmann

КонецПроцедуры	

#КонецОбласти 