
#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Владелец = ЭтотОбъект.ВладелецФормы;
	
	Отбор = новый Структура;
	Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	НайденныеСтроки = Владелец.Объект.гф_УпаковочныеЛисты.НайтиСтроки(Отбор);
	
	Для каждого Строка из НайденныеСтроки Цикл
		
		НоваяСтрока = УпаковочныеЛисты.Добавить();
		НоваяСтрока.УпаковочныйЛист = Строка.УпаковочныйЛист;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти