
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Товары = ПолучитьИзВременногоХранилища(Параметры.Товары);
	Для каждого Стр Из Товары Цикл
		ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Стр);
	КонецЦикла;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)

//	ТекстВопроса = НСтр("ru='У найденных GTIN уже есть установленный статус. Все равно продолжить установку?'");
//	ДопПараметры = Новый Структура() ;
//	Оповещение = Новый ОписаниеОповещения("гф_ВопросУстановитьСтатусЗавершение", ЭтотОбъект, ДопПараметры);
//	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

//КонецПроцедуры

//&НаКлиенте
//Процедура гф_ВопросУстановитьСтатусЗавершение(Результат, ДополнительныеПараметры) Экспорт
//		
//	Закрыть(Результат);	
//	
//КонецПроцедуры


&НаКлиенте
Процедура ВариантЗагрузкиПриИзменении(Элемент)
	
	Закрыть(ВариантЗагрузки);

КонецПроцедуры

