
&ИзменениеИКонтроль("СоздатьСчетНаОплату")
Процедура гф_СоздатьСчетНаОплату(МассивСсылок, ПараметрыВыполнения)
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);

	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		ПараметрКоманды = МассивСсылок;
	Иначе
		ПараметрКоманды = МассивСсылок[0];
	КонецЕсли;

	ДокументОснование = ПродажиВызовСервера.ПолучитьОснованиеДляСчетаНаОплату(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("ДокументОснование", ДокументОснование);
    #Вставка
	// ++ Галфинд СадомцевСА 12.02.2024
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811eec96fbdb98554
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		гф_СчетНаОплатуВызовСервера.ПараметрыФормыДобавитьТЧТоварыВКоробах(ПараметрыФормы, ПараметрКоманды);
	КонецЕсли;
	// -- Галфинд СадомцевСА 12.02.2024
	#КонецВставки

	ОткрытьФорму(
	"Документ.СчетНаОплатуКлиенту.Форма.ФормаСозданияСчетовНаОплату",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
