#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

&После("ДобавитьКомандыПечати")
Процедура гф_ДобавитьКомандыПечати(КомандыПечати)
	//++ ЕсиповАВ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.гф_ПечатьЗаказов";
	КомандаПечати.Идентификатор = "ЗаказПоставщикуСКартинками";
	КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику с картинками';
	|en = 'Purchase Order with pictures'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ЗаказПоставщикуСКартинками");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.гф_ПечатьЗаказов";
	КомандаПечати.Идентификатор = "ЗаказПоставщикуСКартинкамиРазмеры";
	КомандаПечати.Представление = НСтр("ru = 'Заказ поставщику с картинками размеры';
	|en = 'Purchase Order with pictures size'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.ДополнительныеПараметры.Вставить("Тип", "ЗаказПоставщикуСКартинкамиРазмеры");
	//-- ЕсиповАВ
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция УпаковочныеЛистыСозданыВсе(ОбъектИлиСсылка, ВариантКомплектации, КоличествоКоробов) Экспорт
	тзIDКоробов =  ОбъектИлиСсылка.гф_IDКоробов.Выгрузить(); 
	Отбор = Новый Структура;
	Отбор.Вставить("ВариантКомплектации", ВариантКомплектации);
	
	МассивСтрокПоВарианту = тзIDКоробов.НайтиСтроки(Отбор);
	
	Если МассивСтрокПоВарианту.Количество() = КоличествоКоробов Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ОпределитьГраницуСчета(ОбъектИлиСсылка, Эл) Экспорт
	
	тзIDКоробов =  ОбъектИлиСсылка.гф_IDКоробов.Выгрузить(); 
	Отбор = Новый Структура;
	Отбор.Вставить("ВариантКомплектации", Эл.ВариантКомплектации);
	
	МассивСтрокПоВарианту = тзIDКоробов.НайтиСтроки(Отбор);
	
	Если МассивСтрокПоВарианту.Количество() > 0 Тогда 
		Возврат Эл.КоличествоКоробов - МассивСтрокПоВарианту.Количество();
	Иначе
		Возврат Эл.КоличествоКоробов;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли