
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	// #wortmann {
	// #маркировка товаров
	// Галфинд Sakovich 2022/09/22
	гф_ДобавитьРеквизитыФормы();
	// } #wortmann
	
КонецПроцедуры


&НаСервере
Процедура гф_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// #wortmann {
	// #маркировка товаров
	// Галфинд Sakovich 2022/09/22
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи["РежимЗаписи"] <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанныеЗаказаЭмиссии = 
	гф_ЭмиссияКодовМаркировкиВызовСервера.гф_СоздатьЗаказНаЭмиссиюКодовМаркировки(Объект.Ссылка);
	
	СтруктураЗаказНаЭмиссиюКодовМаркировки = СтруктураДанныеЗаказаЭмиссии;
	
	ЗаказНаЭмиссиюКодовМаркировки = Неопределено;
	Если СтруктураЗаказНаЭмиссиюКодовМаркировки.Свойство("ЗаказНаЭмиссиюКодовМаркировкиСУЗ", ЗаказНаЭмиссиюКодовМаркировки) Тогда
		Если ЗначениеЗаполнено(ЗаказНаЭмиссиюКодовМаркировки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Создан документ " + ЗаказНаЭмиссиюКодовМаркировки, , , "Объект");
		КонецЕсли;
	КонецЕсли;
	// } #wortmann
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура гф_ДобавитьРеквизитыФормы()
	
	ДобавляемыеРеквизиты = Новый Массив;
	ТипРеквизита = Новый ОписаниеТипов("Неопределено");
	
	РеквизитФормы = Новый РеквизитФормы("СтруктураЗаказНаЭмиссиюКодовМаркировки", ТипРеквизита, "", "");
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

	ИзменитьРеквизиты(ДобавляемыеРеквизиты);	
	ЭтотОбъект["СтруктураЗаказНаЭмиссиюКодовМаркировки"] = Новый Структура;
КонецПроцедуры

#КонецОбласти

